title: ACME Credential
description: An ACME identity that should be generated by the device.
payload:
  credentialtype: com.apple.credential.acme
  supportedOS:
    iOS:
      introduced: '17.0'
    macOS:
      introduced: '14.0'
    tvOS:
      introduced: '17.0'
    watchOS:
      introduced: '10.0'
payloadkeys:
- key: DirectoryURL
  title: ACME directory URL
  type: <string>
  presence: required
  content: Specifies the directory URL of the ACME server. The URL must use the https
    scheme.
- key: ClientIdentifier
  title: Client identifier
  type: <string>
  presence: required
  content: The server may use this as a nonce to prevent issuing multiple certificates.
    It also indicates to the ACME server that the device has access to a valid client
    identifier that was issued by the enterprise infrastructure. This may help the
    ACME server determine whether to trust the device, however this is a relatively
    weak indication because of the risk that the client identifier may be intercepted
    and duplicated by an attacker.
- key: KeySize
  title: Key Size
  type: <integer>
  presence: required
  content: The valid values for KeySize depend on the values of KeyType and HardwareBound.
    See those keys for specific requirements.
- key: KeyType
  title: Key Type
  type: <string>
  presence: required
  rangelist:
  - RSA
  - ECSECPrimeRandom
  content: |-
    Specifies the type of key pair to generate.
    "RSA" specifies an RSA key pair. If this is specified, KeySize must be in the range [1024..4096] inclusive and a multiple of 8, and HardwareBound must be false.
    "ECSECPrimeRandom" indicates a key pair on the P-256, P-384 or P-521 curves as defined in FIPS Pub 186-4. The specific curve is selected by the KeySize, which must be 256, 384 or 521. Only 256 and 384 are supported for hardware bound keys. (Note that the key size is 521, not 512, even though the other key sizes are multiples of 64.)
- key: HardwareBound
  title: Hardware Bound
  type: <boolean>
  presence: required
  content: |-
    If false, the private key is not bound to the device.
    If true, the private key is bound to the device. The Secure Enclave generates the key pair, and the private key is cryptographically entangled with a system key. This protects the private key from being exported.
    If true, KeyType must be ECSECPrimeRandom and KeySize must be 256 or 384.
    On macOS, this key is required but must have a value of false.
- key: Subject
  title: Subject
  type: <array>
  presence: required
  content: |-
    The device requests this subject for the certificate that the ACME server issues. The ACME server may override or ignore this field in the certificate it issues.
    The representation of a X.500 name represented as an array of OID and value. For example, /C=US/O=Apple Inc./CN=foo/1.2.5.3=bar corresponds to:
    [ [ ["C", "US"] ], [ ["O", "Apple Inc."] ], ..., [ [ "1.2.5.3", "bar" ] ] ]
    OIDs can be represented as dotted numbers, with shortcuts for country (C), locality (L), state (ST), organization (O), organizational unit (OU), and common name (CN).
  subkeys:
  - key: ACMESubjectArrayInnerArray
    title: Array Inside ACME Subject Array
    type: <array>
    subkeys:
    - key: ACMESubjectArrayPair
      title: Subject Array Pair
      type: <array>
      subkeys:
      - key: ACMESubjectArrayPairItem
        title: ACME Subject Array Pair Item
        type: <string>
        repetition:
          min: 2
          max: 2
        content: One item in the array representing a pair of OID and value
- key: SubjectAltName
  title: Subject Alt Name
  type: <dictionary>
  presence: optional
  content: Specifies the Subject Alt Name that the device will request for the certificate
    that the ACME server issues. The ACME server may override or ignore this field
    in the certificate it issues.
  subkeys:
  - key: rfc822Name
    title: RFC 822 Name
    type: <string>
    presence: optional
    content: RFC 822 (email address) string
  - key: dNSName
    title: DNS Name
    type: <string>
    presence: optional
    content: The DNS name
  - key: uniformResourceIdentifier
    title: URI
    type: <string>
    presence: optional
    content: The Uniform Resource Identifier
  - key: ntPrincipalName
    title: NT Principal Name
    type: <string>
    presence: optional
    content: The NT principal name
- key: UsageFlags
  title: Key Usage
  type: <integer>
  presence: optional
  content: |-
    The device requests this key usage for the certificate that the ACME server issues. The ACME server may override or ignore this field in the certificate it issues.
    The value is a bit field. Bit 0x01 indicates digital signature, and bit 0x04 indicates key encipherment.
- key: ExtendedKeyUsage
  title: Extended Key Usage
  type: <array>
  presence: optional
  content: |-
    The device requests this extended key usage for the certificate that the ACME server issues. The ACME server may override or ignore this field in the certificate it issues.
    The value is an array of strings. Each string is an OID in dotted notation. For instance, ["1.3.6.1.5.5.7.3.2", "1.3.6.1.5.5.7.3.4"] indicates client authentication and email protection.
  subkeys:
  - key: OID
    type: <string>
    presence: optional
- key: Attest
  title: Attest
  type: <boolean>
  presence: optional
  default: false
  content: When true, the device provides attestations describing the device and the
    generated key to the ACME server. The server can use the attestations as strong
    evidence that the key is bound to the device, and that the device has properties
    listed in the attestation. The server can use that as part of a trust score to
    decide whether to issue the requested certificate. When Attest is true, HardwareBound
    must also be true. On macOS, this key, if present, must have a value of false.
