title: Identity Credential
description: 'The data for a PKCS #12 password-protected identity.'
payload:
  credentialtype: com.apple.credential.identity
  supportedOS:
    iOS:
      introduced: '17.0'
    macOS:
      introduced: '14.0'
    tvOS:
      introduced: '17.0'
    visionOS:
      introduced: '1.1'
    watchOS:
      introduced: '10.0'
payloadkeys:
- key: Password
  type: <string>
  presence: required
  content: 'The password required to decrypt the PKCS #12 identity data.'
- key: Identity
  type: <data>
  presence: required
  content: 'The PKCS #12 identity data.'
