title: User Name and Password Credential
description: Data describing a credential representing a user name and password.
payload:
  credentialtype: com.apple.credential.usernameandpassword
  supportedOS:
    iOS:
      introduced: '15.0'
    macOS:
      introduced: '13.0'
    tvOS:
      introduced: '16.0'
    watchOS:
      introduced: '10.0'
payloadkeys:
- key: UserName
  type: <string>
  presence: required
  content: The user name for this credential.
- key: Password
  type: <string>
  presence: optional
  content: The password for this credential.
