title: User Name and Password Credentials
description: Data describing a credential representing a user name and password.
payload:
  credentialtype: com.apple.credential.usernameandpassword
  supportedOS:
    iOS:
      introduced: '15.0'
payloadkeys:
- key: UserName
  type: <string>
  presence: required
  content: The user's user name for the credential.
- key: Password
  type: <string>
  presence: optional
  content: The user's password for the credential.
