title: Check Out
description: Responds to the removal of the MDM enrollment profile from a device.
payload:
  requesttype: CheckOut
  supportedOS:
    iOS:
      introduced: '4.0'
      supervised: false
      requiresdep: false
      sharedipad:
        mode: allowed
        devicechannel: true
        userchannel: false
      userenrollment:
        mode: allowed
    macOS:
      introduced: '10.7'
      devicechannel: true
      userchannel: false
      supervised: false
      requiresdep: false
      userenrollment:
        mode: allowed
    tvOS:
      introduced: '10.2'
      supervised: false
    visionOS:
      introduced: '1.1'
      supervised: false
      requiresdep: false
      userenrollment:
        mode: allowed
    watchOS:
      introduced: '10.0'
      supervised: false
  content: Check-in protocol check out request and response.
payloadkeys:
- key: MessageType
  type: <string>
  presence: required
  rangelist:
  - CheckOut
  content: The message type, which requires a value of `CheckOut`.
- key: Topic
  type: <string>
  presence: required
  content: The topic the device subscribes to.
- key: UDID
  supportedOS:
    iOS:
      userenrollment:
        mode: forbidden
    visionOS:
      userenrollment:
        mode: forbidden
  type: <string>
  presence: required
  content: The device's UDID (unique device identifier). The system requires this
    value if the enrollment type is a device enrollment.
- key: EnrollmentID
  supportedOS:
    iOS:
      introduced: '13.0'
      userenrollment:
        mode: required
    macOS:
      introduced: '10.15'
      userenrollment:
        mode: required
    tvOS:
      introduced: n/a
    visionOS:
      userenrollment:
        mode: required
    watchOS:
      introduced: n/a
  type: <string>
  presence: required
  content: |-
    The per-enrollment identifier for the device. The system requires this value if the enrollment type is a user enrollment.

    Available in iOS 13 and later, macOS 10.15 and later, and visionOS 2 and later.
notes:
- title: ''
  content: |-
    The system sends this message on a best-effort basis. If the system can't send the message while removing the MDM profile, it removes the profile and doesn't resend the message.

    On success, the server needs to respond with a `200 OK` status.
