title: Declarative Management
description: Declarative Management request keys.
payload:
  requesttype: DeclarativeManagement
  supportedOS:
    iOS:
      introduced: '15.0'
      supervised: false
      requiresdep: false
      sharedipad:
        mode: allowed
        devicechannel: true
        userchannel: true
      userenrollment:
        mode: allowed
    macOS:
      introduced: '13.0'
      devicechannel: true
      userchannel: true
      supervised: false
      requiresdep: false
      userenrollment:
        mode: allowed
    tvOS:
      introduced: '16.0'
      supervised: false
      requiresdep: false
    watchOS:
      introduced: '10.0'
      supervised: false
      requiresdep: false
  content: Check-in protocol declarative management request and response.
payloadkeys:
- key: MessageType
  type: <string>
  presence: required
  rangelist:
  - DeclarativeManagement
  content: The message type, which must have a value of 'DeclarativeManagement'.
- key: Endpoint
  type: <string>
  presence: required
  content: |-
    The type of operation the declaration is requesting. This key must be one of these values:
    * 'tokens': For fetching synchronization tokens from the server
    * 'declaration-items': For fetching the declaration manifest from the server
    * 'status': For sending a status report to the server
    * 'declaration/…/…': For fetching a specific declaration from the server. Include the declaration type and identifier separated by forward slashes ('/)'.
- key: Data
  type: <data>
  presence: optional
  content: A Base64-encoded JSON object using the SynchronizationTokens schema.
- key: UDID
  supportedOS:
    iOS:
      userenrollment:
        mode: forbidden
    macOS:
      userenrollment:
        mode: forbidden
  type: <string>
  presence: required
  content: The device's UDID.
- key: EnrollmentID
  supportedOS:
    iOS:
      userenrollment:
        mode: required
    macOS:
      userenrollment:
        mode: required
    tvOS:
      introduced: n/a
    watchOS:
      introduced: n/a
  type: <string>
  presence: required
  content: The per-enrollment identifier for the device.
- key: EnrollmentUserID
  supportedOS:
    iOS:
      introduced: n/a
    macOS:
      devicechannel: false
      userenrollment:
        mode: required
    tvOS:
      introduced: n/a
    watchOS:
      introduced: n/a
  type: <string>
  presence: required
  content: A per-enrollment identifier that identifies the user for user enrollments.
- key: UserShortName
  supportedOS:
    iOS:
      sharedipad:
        mode: required
    macOS:
      devicechannel: false
    tvOS:
      introduced: n/a
    watchOS:
      introduced: n/a
  type: <string>
  presence: optional
  content: On Shared iPad, this value returns the Managed Apple ID of the user. When
    present indicates that the token is for the user channel. On macOS, this value
    always returns the short name of the user.
- key: UserID
  supportedOS:
    iOS:
      sharedipad:
        mode: required
    macOS:
      devicechannel: false
    tvOS:
      introduced: n/a
    watchOS:
      introduced: n/a
  type: <string>
  presence: optional
  content: On macOS, this value always returns the ID of the user. On Shared iPad,
    this value is always set to FFFFFFFF-FFFF-FFFF-FFFF-FFFFFFFFFFFF to indicate that
    no authentication will occur.
- key: UserLongName
  supportedOS:
    iOS:
      introduced: n/a
    macOS:
      devicechannel: false
    tvOS:
      introduced: n/a
    watchOS:
      introduced: n/a
  type: <string>
  presence: required
  content: The full name of the user.
