title: Get Bootstrap Token
description: Check-in protocol get bootstrap token data.
payload:
  requesttype: GetBootstrapToken
  supportedOS:
    iOS:
      introduced: n/a
    macOS:
      introduced: '10.15'
      devicechannel: true
      userchannel: false
      supervised: true
      requiresdep: false
      userenrollment:
        mode: forbidden
    tvOS:
      introduced: n/a
    visionOS:
      introduced: n/a
    watchOS:
      introduced: n/a
  content: Check-in protocol get bootstrap token data request and response.
payloadkeys:
- key: MessageType
  type: <string>
  presence: required
  rangelist:
  - GetBootstrapToken
  content: The message type, which must have a value of 'GetBootstrapToken'.
- key: AwaitingConfiguration
  type: <boolean>
  presence: optional
  default: false
  content: If 'true', the device is awaiting a DeviceConfigured MDM command before
    proceeding through Setup Assistant.
responsekeys:
- key: BootstrapToken
  type: <data>
  presence: optional
  content: The current bootstrap token data for the device.
