title: Get Token
description: Check-in protocol get token data.
payload:
  requesttype: GetToken
  supportedOS:
    iOS:
      introduced: '17.0'
      supervised: false
      requiresdep: false
      sharedipad:
        mode: allowed
        devicechannel: true
        userchannel: true
      userenrollment:
        mode: allowed
    macOS:
      introduced: '14.0'
      devicechannel: true
      userchannel: true
      supervised: false
      requiresdep: false
      userenrollment:
        mode: allowed
    tvOS:
      introduced: n/a
    watchOS:
      introduced: n/a
  content: Check-in protocol get token data request and response.
payloadkeys:
- key: MessageType
  type: <string>
  presence: required
  rangelist:
  - GetToken
  content: Indicates that this is a get token request.
- key: TokenServiceType
  type: <string>
  presence: required
  rangelist:
  - com.apple.maid
  - com.apple.watch.pairing
  content: Indicates the service for which a token is being requested.
- key: TokenParameters
  type: <dictionary>
  presence: optional
  content: Parameters used to generate the token.
  subkeys:
  - key: SecurityToken
    title: Security Token
    supportedOS:
      iOS:
        sharedipad:
          mode: forbidden
        userenrollment:
          mode: forbidden
      macOS:
        introduced: n/a
    type: <string>
    presence: optional
    content: |-
      A security token used to generate the server token. Required by the following service types:
      * com.apple.watch.pairing
  - key: PhoneUDID
    title: Phone Identifier
    supportedOS:
      iOS:
        sharedipad:
          mode: forbidden
        userenrollment:
          mode: forbidden
      macOS:
        introduced: n/a
    type: <string>
    presence: optional
    content: |-
      The identifier of the phone paired to the watch. Required by the following service types:
      * com.apple.watch.pairing
  - key: WatchUDID
    title: Watch Identifier
    supportedOS:
      iOS:
        sharedipad:
          mode: forbidden
        userenrollment:
          mode: forbidden
      macOS:
        introduced: n/a
    type: <string>
    presence: optional
    content: |-
      The identifier of the watch paired to the phone. Required by the following service types:
      * com.apple.watch.pairing
- key: UDID
  supportedOS:
    iOS:
      userenrollment:
        mode: forbidden
    macOS:
      userenrollment:
        mode: forbidden
  type: <string>
  presence: required
  content: The device's UDID.
- key: EnrollmentID
  supportedOS:
    iOS:
      userenrollment:
        mode: required
    macOS:
      userenrollment:
        mode: required
  type: <string>
  presence: required
  content: A per-enrollment identifier that identifies the device for user enrollments.
- key: EnrollmentUserID
  supportedOS:
    iOS:
      introduced: n/a
    macOS:
      devicechannel: false
      userenrollment:
        mode: required
  type: <string>
  presence: required
  content: A per-enrollment identifier that identifies the user for user enrollments.
- key: UserShortName
  supportedOS:
    iOS:
      sharedipad:
        mode: required
    macOS:
      devicechannel: false
  type: <string>
  presence: optional
  content: On Shared iPad, this value returns the Managed Apple ID of the user. When
    present indicates that the token is for the user channel. On macOS, this value
    always returns the short name of the user.
- key: UserID
  supportedOS:
    iOS:
      sharedipad:
        mode: required
    macOS:
      devicechannel: false
  type: <string>
  presence: optional
  content: On macOS, this value always returns the ID of the user. On Shared iPad,
    this value is always set to FFFFFFFF-FFFF-FFFF-FFFF-FFFFFFFFFFFF to indicate that
    no authentication will occur.
- key: UserLongName
  supportedOS:
    iOS:
      introduced: n/a
    macOS:
      devicechannel: false
  type: <string>
  presence: required
  content: The full name of the user.
responsekeys:
- key: TokenData
  type: <data>
  presence: required
  content: The token represented as data. If the token is a string value, this will
    be the UTF-8 encoded string data.
