title: MachineInfo
description: The definition of MachineInfo payload sent by a client when fetching
  an MDM enrollment profile
payload:
  payloadtype: MachineInfo
  supportedOS:
    iOS:
      introduced: '7.0'
    macOS:
      introduced: '10.9'
    tvOS:
      introduced: '10.2'
    visionOS:
      introduced: '1.1'
    watchOS:
      introduced: '10.0'
payloadkeys:
- key: UDID
  title: UDID
  supportedOS:
    iOS:
      userenrollment:
        mode: forbidden
    macOS:
      userenrollment:
        mode: forbidden
    tvOS:
      userenrollment:
        mode: forbidden
    visionOS:
      userenrollment:
        mode: forbidden
  type: <string>
  presence: required
  content: The device's UDID.
- key: SERIAL
  title: Serial Number
  supportedOS:
    iOS:
      userenrollment:
        mode: forbidden
    macOS:
      userenrollment:
        mode: forbidden
    tvOS:
      userenrollment:
        mode: forbidden
    visionOS:
      userenrollment:
        mode: forbidden
  type: <string>
  presence: required
  content: The device's serial number.
- key: PRODUCT
  title: Product
  type: <string>
  presence: required
  content: The device's product type, e.g. iPhone5,1.
- key: VERSION
  title: Build Version
  type: <string>
  presence: required
  content: The build version installed on the device, e.g. 7A182.
- key: OS_VERSION
  title: OS Version
  supportedOS:
    iOS:
      introduced: '17.0'
    macOS:
      introduced: '14.0'
    tvOS:
      introduced: '17.0'
  type: <string>
  presence: required
  content: The OS version installed on the device, e.g. 17.0.
- key: SUPPLEMENTAL_BUILD_VERSION
  title: Supplemental Build Version
  supportedOS:
    iOS:
      introduced: '17.0'
    macOS:
      introduced: '14.0'
    tvOS:
      introduced: '17.0'
  type: <string>
  presence: optional
  content: The device's operating system supplemental build version (if available).
- key: SUPPLEMENTAL_OS_VERSION_EXTRA
  title: Supplemental OS Version Extra
  supportedOS:
    iOS:
      introduced: '17.0'
    macOS:
      introduced: '14.0'
    tvOS:
      introduced: '17.0'
  type: <string>
  presence: optional
  content: The device's operating system supplemental OS version extra (if available).
- key: IMEI
  title: IMEI
  supportedOS:
    iOS:
      userenrollment:
        mode: forbidden
    macOS:
      introduced: n/a
    tvOS:
      introduced: n/a
    visionOS:
      introduced: n/a
  type: <string>
  presence: optional
  content: The device's IMEI (if available).
- key: MEID
  title: MEID
  supportedOS:
    iOS:
      userenrollment:
        mode: forbidden
    macOS:
      introduced: n/a
    tvOS:
      introduced: n/a
    visionOS:
      introduced: n/a
  type: <string>
  presence: optional
  content: The device's MEID (if available).
- key: LANGUAGE
  title: Language
  type: <string>
  presence: optional
  content: The user's currently-selected language, e.g. en.
- key: MDM_CAN_REQUEST_SOFTWARE_UPDATE
  title: MDM Can Request Software Update
  supportedOS:
    iOS:
      introduced: '17.0'
    macOS:
      introduced: '14.0'
    tvOS:
      introduced: n/a
    visionOS:
      introduced: n/a
    watchOS:
      introduced: n/a
  type: <boolean>
  presence: optional
  default: false
  content: If set to "true", indicates that the device can be triggered by the server
    to do a required software update.
- key: PAIRING_TOKEN
  title: Watch Enrollment Pairing Token
  supportedOS:
    iOS:
      introduced: n/a
    macOS:
      introduced: n/a
    tvOS:
      introduced: n/a
    visionOS:
      introduced: n/a
  type: <data>
  presence: optional
  content: The pairing token to validate when a watch is enrolling.
- key: SOFTWARE_UPDATE_DEVICE_ID
  title: Software Update Device ID
  supportedOS:
    iOS:
      introduced: '17.4'
    macOS:
      introduced: '14.4'
    tvOS:
      introduced: n/a
  type: <string>
  presence: optional
  content: The device model identifier used to lookup available OS updates through
    https://gdmf.apple.com/v2/pmv.
