title: ManifestURL
description: The URL to the app manifest.
payload:
  payloadtype: ManifestURL
  supportedOS:
    iOS:
      introduced: '7.0'
      sharedipad:
        mode: allowed
      userenrollment:
        mode: allowed
    macOS:
      introduced: '10.9'
      userenrollment:
        mode: allowed
    tvOS:
      introduced: '10.2'
    visionOS:
      introduced: '1.1'
    watchOS:
      introduced: '10.0'
payloadkeys:
- key: items
  title: The manifest items
  type: <array>
  presence: required
  content: An array of dictionaries representing what the manifest installs.
  subkeys:
  - key: items-item
    type: <dictionary>
    presence: required
    subkeys:
    - key: assets
      title: An asset
      type: <array>
      presence: required
      content: An array of dictionaries that describe an item to install.
      subkeys:
      - key: assets-item
        type: <dictionary>
        presence: required
        subkeys:
        - key: kind
          title: The asset kind
          type: <string>
          presence: required
          rangelist:
          - asset-pack-manifest
          - display-image
          - full-size-image
          - software-package
          content: The kind of manifest item to install. Use `software-package` for
            apps and macOS packages.
        - key: md5
          title: md5 hash
          type: <string>
          presence: optional
          content: The MD5 hash value the device uses when verifying the hash of the
            manifest item data. When this key is present, the device ignores the `md5-size`
            and `md5s` keys.
        - key: md5-size
          title: md5 chunk size
          type: <integer>
          presence: optional
          content: The data *chunk* size the device uses when verifying the hash of
            the manifest item data. Required when the `md5s` key is present.
        - key: md5s
          title: md5 hashes
          type: <array>
          presence: optional
          content: An array of strings representing a set of MD5 hash values. The
            device uses these values to verify the integrity of the downloaded manifest
            item data. Required when the `md5-size` key is present.
          subkeys:
          - key: md5s-item
            title: md5 hash
            type: <string>
            presence: required
            content: An MD5 hash value.
        - key: sha256
          title: sha256 hash
          type: <string>
          presence: optional
          content: The SHA-256 hash value the device uses when verifying the hash
            of the manifest item data. When this key is present, the device ignores
            the `sha256-size` and `sha256` keys.
        - key: sha256-size
          title: sha256 chunk size
          type: <integer>
          presence: optional
          content: The data *chunk* size the device uses when verifying the hash of
            the manifest item data. Required when the `sha256s` key is present.
        - key: sha256s
          title: If there are multiple sha256 hashes provide a chunk size
          type: <array>
          presence: optional
          content: An array of strings representing a set of SHA-256 hash values.
            The device uses these values to verify the integrity of the downloaded
            manifest item data. Required when the `sha256-size` key is present.
          subkeys:
          - key: sha256s-item
            title: sha256 hash
            type: <string>
            presence: required
            content: A SHA-256 hash value.
        - key: url
          title: The asset URL
          type: <string>
          presence: required
          content: The URL that hosts the manifest item data. The URL needs to start
            with `https://`.
        - key: needs-shine
          title: Icon treatment
          supportedOS:
            iOS:
              removed: '0'
            macOS:
              removed: '0'
            tvOS:
              removed: '0'
            visionOS:
              removed: '0'
            watchOS:
              introduced: n/a
          type: <boolean>
          presence: optional
          default: false
          content: removed
    - key: metadata
      title: Application metadata
      type: <dictionary>
      presence: required
      content: The metadata for an application or package manifest item.
      subkeys:
      - key: bundle-identifier
        title: Bundle identifier
        type: <string>
        presence: required
        content: The bundle identifier of the app or package manifest item.
      - key: bundle-version
        title: The bundle version
        type: <string>
        presence: optional
        content: The bundle version of the app or package manifest item.
      - key: kind
        title: The kind
        type: <string>
        presence: required
        rangelist:
        - software
        content: The type of manifest item. For an app or package, this needs to be
          `software`.
      - key: sizeInBytes
        title: Size in bytes
        supportedOS:
          iOS:
            removed: '0'
          macOS:
            removed: '0'
          tvOS:
            removed: '0'
          visionOS:
            removed: '0'
          watchOS:
            introduced: n/a
        type: <integer>
        presence: optional
        content: removed
      - key: subtitle
        title: The application subtitle
        type: <string>
        presence: optional
        content: The name of the app or package developer.
      - key: title
        title: The title
        type: <string>
        presence: required
        content: The title of the app or package being installed.
      - key: items
        title: The items
        supportedOS:
          iOS:
            removed: '0'
          macOS:
            removed: '0'
          tvOS:
            removed: '0'
          visionOS:
            removed: '0'
          watchOS:
            introduced: n/a
        type: <array>
        presence: optional
        content: Removed
        subkeys:
        - key: metadata-items-item
          type: <dictionary>
          presence: optional
          subkeys:
          - key: bundle-identifier
            title: removed
            type: <string>
            presence: optional
            content: removed
          - key: bundle-version
            title: removed
            type: <string>
            presence: optional
            content: removed
notes:
- title: ''
  content: Use SHA-256 hashes instead of MD5 because SHA-256 has stronger security.
    If both SHA-256 and MD5 hash properties are present, the device uses only the
    SHA-256 hashes to verify the manifest data.
