title: passwordHash
description: The passwordHash object used in the AccountConfiguration and SetAutoAdminPassword
  commands
payload:
  payloadtype: passwordHash
  supportedOS:
    macOS:
      introduced: '10.11'
      userenrollment:
        mode: allowed
payloadkeys:
- key: SALTED-SHA512-PBKDF2
  title: SALTED-SHA512-PBKDF2
  type: <dictionary>
  presence: required
  content: A dictionary containing the entropy, iterations and salt
  subkeys:
  - key: entropy
    title: Entropy
    type: <data>
    presence: required
    content: The derived key from the password hash; for example, from CCKeyDerivationPBKDF()
  - key: iterations
    title: Iterations
    type: <integer>
    presence: required
    content: The number of iterations; for example, from CCCalibratePBKDF() using
      a minimum hash time of 100 milliseconds, or if unknown, a number in the range
      of 20,000 to 40,000 iterations
  - key: salt
    title: Salt
    type: <data>
    presence: required
    content: The 32-byte randomized salt; for example, from CCRandomCopyBytes()
