title: passwordHash
description: A dictionary that contains the password hash for the account.
payload:
  payloadtype: passwordHash
  supportedOS:
    iOS:
      introduced: n/a
    macOS:
      introduced: '10.11'
      userenrollment:
        mode: allowed
    tvOS:
      introduced: n/a
    visionOS:
      introduced: n/a
    watchOS:
      introduced: n/a
payloadkeys:
- key: SALTED-SHA512-PBKDF2
  title: SALTED-SHA512-PBKDF2
  type: <dictionary>
  presence: required
  content: A dictionary that contains the `entropy`, `iterations`, and `salt` elements
    to create the password hash using the CommonCrypto libraries, or equivalent. Convert
    this dictionary to binary data before setting it as the value for the password
    hash.
  subkeys:
  - key: entropy
    title: Entropy
    type: <data>
    presence: required
    content: The derived key from the password hash; for example, from `CCKeyDerivationPBKDF()`.
  - key: iterations
    title: Iterations
    type: <integer>
    presence: required
    content: The number of iterations; for example, from `CCCalibratePBKDF()` using
      a minimum hash time of 100 milliseconds, or if unknown, a number in the range
      of 20,000 to 40,000 iterations.
  - key: salt
    title: Salt
    type: <data>
    presence: required
    content: The 32-byte randomized data; for example, from `CCRandomCopyBytes()`.
