title: CalDAV
description: The payload that configures a Calendar account.
payload:
  payloadtype: com.apple.caldav.account
  supportedOS:
    iOS:
      introduced: '4.0'
      multiple: true
      supervised: false
      allowmanualinstall: true
      sharedipad:
        mode: allowed
        devicechannel: false
        userchannel: true
      userenrollment:
        mode: allowed
    macOS:
      introduced: '10.7'
      multiple: true
      devicechannel: false
      userchannel: true
      supervised: false
      requiresdep: false
      userapprovedmdm: false
      allowmanualinstall: true
      userenrollment:
        mode: allowed
    tvOS:
      introduced: n/a
    visionOS:
      introduced: '1.1'
      multiple: true
      supervised: false
      allowmanualinstall: true
      userenrollment:
        mode: allowed
    watchOS:
      introduced: n/a
payloadkeys:
- key: CalDAVAccountDescription
  title: Account Description
  type: <string>
  presence: optional
  content: The description of the account.
- key: CalDAVHostName
  title: Account Hostname
  type: <string>
  presence: required
  content: The server's address.
- key: CalDAVUsername
  title: Account Username
  type: <string>
  presence: optional
  content: The user name for logins. If this profile is part of a non-interactive
    install, the system requires this field.
- key: CalDAVPassword
  title: Account Password
  type: <string>
  presence: optional
  content: The user's password. Only use this in encrypted profiles.
- key: CalDAVPrincipalURL
  title: Principal URL
  type: <string>
  presence: optional
  content: The base URL to the user's calendar.
- key: CalDAVUseSSL
  title: Use SSL
  type: <boolean>
  presence: optional
  default: true
  content: If `true`, the system enables SSL.
- key: CalDAVPort
  title: Port Number
  type: <integer>
  presence: optional
  content: The server's port.
- key: VPNUUID
  title: VPNUUID
  supportedOS:
    iOS:
      introduced: '14.0'
    macOS:
      introduced: n/a
  type: <string>
  presence: optional
  content: The VPNUUID of the per-app VPN the account uses for network communication.
    Available in iOS 14 and later.
