title: Passcode
description: Use this section to define passcode policy settings
payload:
  payloadtype: com.apple.mobiledevice.passwordpolicy
  supportedOS:
    iOS:
      introduced: '4.0'
      supervised: false
      allowmanualinstall: true
      sharedipad:
        mode: forbidden
      userenrollment:
        mode: allowed
    macOS:
      introduced: '10.7'
      devicechannel: true
      userchannel: true
      requiresdep: false
      userapprovedmdm: false
      allowmanualinstall: true
      userenrollment:
        mode: forbidden
payloadkeys:
- key: allowSimple
  title: Allow Simple Value
  supportedOS:
    iOS:
      userenrollment:
        mode: ignored
  type: <boolean>
  presence: optional
  default: true
  content: If 'true', allows a simple passcode. A simple passcode contains repeated
    characters, or increasing or decreasing characters (such as '123' or 'CBA').
- key: forcePIN
  title: Require Passcode on Device
  supportedOS:
    iOS:
      userenrollment:
        mode: ignored
  type: <boolean>
  presence: optional
  default: false
  content: If 'true', forces the user to enter a PIN.
- key: maxFailedAttempts
  title: Maximum Number of Failed Attempts
  supportedOS:
    iOS:
      userenrollment:
        mode: ignored
  type: <integer>
  presence: optional
  range:
    min: 2
    max: 11
  default: 11
  content: The number of allowed failed attempts to enter the passcode at the device's
    lock screen. After six failed attempts, a time delay is imposed before a passcode
    can be entered again. The delay increases with each attempt. In macOS, set 'minutesUntilFailedLoginReset'
    to define a delay before the next passcode can be entered. When this number is
    exceeded in macOS, the device is locked; in iOS, the device is wiped.
- key: maxInactivity
  title: Auto-Lock
  supportedOS:
    iOS:
      userenrollment:
        mode: ignored
  type: <integer>
  presence: optional
  range:
    min: 0
    max: 15
  content: The maximum number of minutes for which the device can be idle, without
    being unlocked by the user, before it gets locked by the system. When this limit
    is reached, the device is locked and the passcode must be entered. The user can
    edit this setting, but the value cannot exceed the 'maxInactivity' value. In macOS,
    this inactivity value is translated to screen-saver settings.
- key: maxPINAgeInDays
  title: Maximum Passcode Age
  supportedOS:
    iOS:
      userenrollment:
        mode: ignored
  type: <integer>
  presence: optional
  range:
    min: 0
    max: 730
  content: The number of days for which the passcode can remain unchanged. After this
    number of days, the user is forced to change the passcode before the device is
    unlocked.
- key: minComplexChars
  title: Minimum Number of Complex Characters
  supportedOS:
    iOS:
      userenrollment:
        mode: ignored
  type: <integer>
  presence: optional
  range:
    min: 0
    max: 4
  default: 0
  content: |-
    The minimum number of complex characters that a passcode must contain. A complex character is a character other than a number or a letter, such as & % $ #.
    This property is ignored for User Enrollments.
- key: minLength
  title: Minimum Passcode Length
  supportedOS:
    iOS:
      userenrollment:
        mode: ignored
  type: <integer>
  presence: optional
  range:
    min: 0
    max: 16
  default: 0
  content: The minimum overall length of the passcode. This parameter is independent
    of the also optional minComplexChars argument.
- key: requireAlphanumeric
  title: Require Alphabetic Value
  supportedOS:
    iOS:
      userenrollment:
        mode: ignored
  type: <boolean>
  presence: optional
  default: false
  content: If 'true', requires alphabetic characters (abcd) instead of only numeric
    characters.
- key: pinHistory
  title: Passcode History
  supportedOS:
    iOS:
      userenrollment:
        mode: ignored
  type: <integer>
  presence: optional
  range:
    min: 1
    max: 50
  content: This value defines N, where the new passcode must be unique within the
    last N entries in the passcode history.
- key: maxGracePeriod
  title: Grace Period for Device Lock
  supportedOS:
    iOS:
      userenrollment:
        mode: ignored
  type: <integer>
  presence: optional
  default: 0
  content: The maximum grace period, in minutes, to unlock the phone without entering
    a passcode. The default is 0, which is no grace period and requires a passcode
    immediately. In macOS, this grace period value is translated to screen-saver settings.
- key: minutesUntilFailedLoginReset
  supportedOS:
    iOS:
      introduced: n/a
    macOS:
      introduced: '10.10'
      userenrollment:
        mode: ignored
  type: <integer>
  presence: optional
  content: The number of minutes before the login is reset after the maximum number
    of unsuccessful login attempts is reached. This key requires setting 'maxFailedAttempts'.
    Available in macOS 10.10 and later.
- key: changeAtNextAuth
  supportedOS:
    iOS:
      introduced: n/a
    macOS:
      introduced: '10.13'
      userenrollment:
        mode: ignored
  type: <boolean>
  presence: optional
  default: false
  content: If 'true', causes a password reset to occur the next time the user tries
    to authenticate. If this key is set in a device profile, the setting takes effect
    for all users, and admin authentications may fail until the admin user password
    is also reset. Available in macOS 10.13 and later.
