title: Certificate (Root)
description: Use this section to define settings for a root certificate.
payload:
  payloadtype: com.apple.security.root
  supportedOS:
    iOS:
      introduced: '4.0'
      multiple: true
      supervised: false
      allowmanualinstall: true
      sharedipad:
        mode: allowed
        devicechannel: true
        userchannel: false
      userenrollment:
        mode: allowed
    macOS:
      introduced: '10.7'
      multiple: true
      devicechannel: true
      userchannel: true
      requiresdep: false
      userapprovedmdm: false
      allowmanualinstall: true
      userenrollment:
        mode: allowed
    tvOS:
      introduced: '5.0'
      multiple: true
      supervised: false
      allowmanualinstall: true
    visionOS:
      introduced: '1.0'
      multiple: true
      supervised: false
      allowmanualinstall: true
      userenrollment:
        mode: allowed
    watchOS:
      introduced: '3.0'
      multiple: true
      allowmanualinstall: true
  content: Alias for com.apple.security.pkcs1.
payloadkeys:
- key: PayloadCertificateFileName
  title: Payload Certificate Filename
  type: <string>
  presence: optional
  content: The file name of the enclosed certificate.
- key: PayloadContent
  title: Payload Certificate Filename
  type: <data>
  presence: required
  content: The binary representation of the payload encoded in base64.
