title: Conference Room Display
description: The payload that configures Conference Room Display mode for Apple TV.
payload:
  payloadtype: com.apple.conferenceroomdisplay
  supportedOS:
    iOS:
      introduced: n/a
    macOS:
      introduced: n/a
    tvOS:
      introduced: '10.2'
      multiple: false
      supervised: true
      allowmanualinstall: true
    visionOS:
      introduced: n/a
    watchOS:
      introduced: n/a
  content: Configures an Apple TV to enter Conference Room Display mode, and restrictions
    exit from that mode
payloadkeys:
- key: Message
  title: Custom message
  type: <string>
  presence: optional
  content: The custom message displayed on the screen in Conference Room Display mode.
notes:
- title: ''
  content: Conference Room Display mode locks Apple TV into that mode, to prevent
    other types of usage.
