title: App Store
description: ''
payload:
  payloadtype: com.apple.appstore
  supportedOS:
    macOS:
      introduced: '10.9'
      multiple: false
      devicechannel: true
      userchannel: true
      requiresdep: false
      userapprovedmdm: false
      allowmanualinstall: true
      userenrollment:
        mode: forbidden
  content: Use this payload to set restrictions used by the Mac App Store.
payloadkeys:
- key: restrict-store-require-admin-to-install
  supportedOS:
    macOS:
      introduced: '10.9'
      deprecated: '10.14'
  type: <boolean>
  presence: optional
  default: false
  content: If 'true', restricts app installations to admin users only. Deprecated
    in macOS 10.14. Use the 'com.apple.SoftwareUpdate' payload key 'restrict-software-update-require-admin-to-install'
    as a replacement.
- key: restrict-store-softwareupdate-only
  supportedOS:
    macOS:
      introduced: '10.10'
  type: <boolean>
  presence: optional
  default: false
  content: If 'true', prevents App Store from launching. Available in macOS 10.14
    and later. Restricts installations to software updates only in macOS 10.10 - 10.13.
- key: restrict-store-disable-app-adoption
  supportedOS:
    macOS:
      introduced: '10.10'
  type: <boolean>
  presence: optional
  default: false
  content: If 'true', disables app adoption by users. Available in macOS 10.10 and
    later.
- key: DisableSoftwareUpdateNotifications
  supportedOS:
    macOS:
      introduced: '10.10'
  type: <boolean>
  presence: optional
  default: false
  content: If 'true', disables software update notifications. Available in macOS 10.10
    and later.
