title: Finder
description: ''
payload:
  payloadtype: com.apple.finder
  supportedOS:
    iOS:
      introduced: n/a
    macOS:
      introduced: '10.7'
      multiple: false
      devicechannel: true
      userchannel: true
      requiresdep: false
      userapprovedmdm: false
      allowmanualinstall: true
      userenrollment:
        mode: forbidden
    tvOS:
      introduced: n/a
    visionOS:
      introduced: n/a
    watchOS:
      introduced: n/a
payloadkeys:
- key: ProhibitBurn
  type: <boolean>
  presence: optional
  default: false
  content: If 'true', the system disables the Finder's burn support.
- key: InterfaceLevel
  supportedOS:
    macOS:
      removed: '10.15'
  type: <string>
  presence: optional
  rangelist:
  - Simple
  - Full
  content: Specifies whether Finder should operate in Simple or Full mode.
- key: ProhibitConnectTo
  type: <boolean>
  presence: optional
  default: false
  content: If 'true', the system disables Connect to Server.
- key: ProhibitEject
  type: <boolean>
  presence: optional
  default: false
  content: If 'true', the system disables Eject.
- key: ProhibitGoToFolder
  type: <boolean>
  presence: optional
  default: false
  content: If 'true', the system disables Go to Folder.
- key: ShowExternalHardDrivesOnDesktop
  type: <boolean>
  presence: optional
  default: true
  content: If 'false', the system doesn't show external hard drives on the Desktop.
- key: ShowHardDrivesOnDesktop
  type: <boolean>
  presence: optional
  default: false
  content: If 'false', the system doesn't show internal hard drives on the Desktop.
- key: ShowMountedServersOnDesktop
  type: <boolean>
  presence: optional
  default: false
  content: If 'false', the system doesn't show mounted file servers on the Desktop.
- key: ShowRemovableMediaOnDesktop
  type: <boolean>
  presence: optional
  default: true
  content: If 'false', the system doesn't show removable media items on the Desktop.
- key: WarnOnEmptyTrash
  type: <boolean>
  presence: optional
  default: true
  content: If 'false', the system doesn't warn the user before emptying the trash.
