title: LDAP
description: Use this section to define settings for configuration access to LDAP
  servers.
payload:
  payloadtype: com.apple.ldap.account
  supportedOS:
    iOS:
      introduced: '4.0'
      supervised: false
      allowmanualinstall: true
      sharedipad:
        mode: allowed
        devicechannel: false
        userchannel: true
      userenrollment:
        mode: allowed
    macOS:
      introduced: '10.7'
      devicechannel: false
      userchannel: true
      requiresdep: false
      userapprovedmdm: false
      allowmanualinstall: true
      userenrollment:
        mode: allowed
payloadkeys:
- key: LDAPAccountDescription
  title: Account Description
  type: <string>
  presence: optional
  content: The description of the account.
- key: LDAPAccountHostName
  title: Account Hostname
  type: <string>
  presence: required
  content: The server's address.
- key: LDAPAccountUserName
  title: Account Username
  type: <string>
  presence: optional
  content: The user's user name.
- key: LDAPAccountPassword
  title: Account Password
  type: <string>
  presence: optional
  content: The user's password. The password is enabled only with encrypted profiles.
- key: LDAPAccountUseSSL
  title: Use SSL
  type: <boolean>
  presence: optional
  default: true
  content: If 'true', enables SSL.
- key: LDAPSearchSettings
  title: Search Settings
  type: <array>
  presence: optional
  content: An array of search settings dictionaries.
  subkeys:
  - key: LDAPSearchSettingsItem
    title: An LDAP Search Setting
    type: <dictionary>
    subkeys:
    - key: LDAPSearchSettingDescription
      title: Description
      type: <string>
      presence: optional
      content: The description of this search setting.
    - key: LDAPSearchSettingSearchBase
      title: Search Setting Search Base
      type: <string>
      presence: required
      content: The path to the node where a search should start.
    - key: LDAPSearchSettingScope
      title: Search Setting Scope
      type: <string>
      presence: optional
      rangelist:
      - LDAPSearchSettingScopeBase
      - LDAPSearchSettingScopeOneLevel
      - LDAPSearchSettingScopeSubtree
      default: LDAPSearchSettingScopeSubtree
      content: |-
        The type of recursion to use in the search. It is one of the following values:
        * 'LDAPSearchSettingScopeBase': Only the immediate node that the search base points to.
        * 'LDAPSearchSettingScopeOneLevel': The node plus its immediate children.
        * 'LDAPSearchSettingScopeSubtree': The node plus all children, regardless of depth.
- key: VPNUUID
  title: VPNUUID
  supportedOS:
    iOS:
      introduced: '14.0'
    macOS:
      introduced: n/a
  type: <string>
  presence: optional
  content: |-
    The VPNUUID of the per-app VPN the account uses for network communication.
    Available in iOS 14 and later.
