title: System Policy Control
description: The payload that configures the system policy for assessments.
payload:
  payloadtype: com.apple.systempolicy.control
  supportedOS:
    iOS:
      introduced: n/a
    macOS:
      introduced: '10.8'
      multiple: true
      devicechannel: true
      userchannel: false
      requiresdep: false
      userapprovedmdm: false
      allowmanualinstall: true
      userenrollment:
        mode: forbidden
    tvOS:
      introduced: n/a
    visionOS:
      introduced: n/a
    watchOS:
      introduced: n/a
  content: Provides a way of enabling System Policy assessment processing. This corresponds
    to the Gatekeeper UI in the Security pref pane.
payloadkeys:
- key: EnableAssessment
  type: <boolean>
  presence: optional
  content: If `true`, enables Gatekeeper. If `false`, disables Gatekeeper.
- key: AllowIdentifiedDevelopers
  type: <boolean>
  presence: optional
  content: |-
    If `true`, enables Gatekeeper's "Mac App Store and identified developers" option.

    If `false`, enables Gatekeeper's "Mac App Store" option.

    If the value of `EnableAssessment` isn't set to `true`, this key has no effect.
- key: EnableXProtectMalwareUpload
  supportedOS:
    macOS:
      introduced: '15.0'
  type: <boolean>
  presence: optional
  content: If `false`, prevents Gatekeeper from prompting the user to upload blocked
    malware to Apple for purposes of improving malware detection.
