title: Subscribed Calendars
description: The payload that configures subscribed calendars.
payload:
  payloadtype: com.apple.subscribedcalendar.account
  supportedOS:
    iOS:
      introduced: '4.0'
      multiple: true
      supervised: false
      allowmanualinstall: true
      sharedipad:
        mode: allowed
        devicechannel: false
        userchannel: true
      userenrollment:
        mode: allowed
    macOS:
      introduced: n/a
    tvOS:
      introduced: n/a
    visionOS:
      introduced: '1.1'
      multiple: true
      supervised: false
      allowmanualinstall: true
      userenrollment:
        mode: allowed
    watchOS:
      introduced: n/a
payloadkeys:
- key: SubCalAccountDescription
  title: Description
  type: <string>
  presence: optional
  content: The description of the account.
- key: SubCalAccountHostName
  title: URL
  type: <string>
  presence: required
  content: The server's address.
- key: SubCalAccountUsername
  title: Username
  type: <string>
  presence: optional
  content: The user's user name.
- key: SubCalAccountPassword
  title: Password
  type: <string>
  presence: optional
  content: The user's password.
- key: SubCalAccountUseSSL
  title: Use SSL
  type: <boolean>
  presence: optional
  default: false
  content: If `true`, the system enables SSL.
- key: VPNUUID
  title: VPNUUID
  supportedOS:
    iOS:
      introduced: '14.0'
  type: <string>
  presence: optional
  content: The VPNUUID of the per-app VPN the account uses for network communication.
    Available in iOS 14 and later.
