title: Managed Preferences
description: ''
payload:
  payloadtype: com.apple.ManagedClient.preferences
  supportedOS:
    iOS:
      introduced: n/a
    macOS:
      introduced: '10.7'
      multiple: true
      devicechannel: true
      userchannel: true
      requiresdep: false
      userapprovedmdm: false
      allowmanualinstall: true
      userenrollment:
        mode: forbidden
    tvOS:
      introduced: n/a
    visionOS:
      introduced: n/a
    watchOS:
      introduced: n/a
payloadkeys:
- key: PreferenceDomain
  type: <dictionary>
  presence: required
  content: The dictionary containing app preference domains.
  subkeys:
  - key: Forced
    type: <array>
    presence: required
    content: The dictionary of forced settings.
    subkeys: &id001
    - key: Settings
      type: <dictionary>
      presence: required
      subkeys:
      - key: mcx_preference_settings
        type: <dictionary>
        presence: required
        content: The dictionary of settings.
        subkeys:
        - key: ANY
          type: <any>
          presence: optional
          content: The setting/value pairs.
  - key: Set-Once
    type: <array>
    presence: required
    content: The dictionary of one-time settings.
    subkeys: *id001
