title: LDAP
description: The payload that configures a Lightweight Directory Access Protocol (LDAP)
  account.
payload:
  payloadtype: com.apple.ldap.account
  supportedOS:
    iOS:
      introduced: '4.0'
      multiple: true
      supervised: false
      allowmanualinstall: true
      sharedipad:
        mode: allowed
        devicechannel: false
        userchannel: true
      userenrollment:
        mode: allowed
    macOS:
      introduced: '10.7'
      multiple: true
      devicechannel: false
      userchannel: true
      supervised: false
      requiresdep: false
      userapprovedmdm: false
      allowmanualinstall: true
      userenrollment:
        mode: allowed
    tvOS:
      introduced: n/a
    visionOS:
      introduced: '1.1'
      multiple: true
      supervised: false
      allowmanualinstall: true
      userenrollment:
        mode: allowed
    watchOS:
      introduced: n/a
payloadkeys:
- key: LDAPAccountDescription
  title: Account Description
  type: <string>
  presence: optional
  content: The description of the account.
- key: LDAPAccountHostName
  title: Account Hostname
  type: <string>
  presence: required
  content: The server's address.
- key: LDAPAccountUserName
  title: Account Username
  type: <string>
  presence: optional
  content: The user's user name.
- key: LDAPAccountPassword
  title: Account Password
  type: <string>
  presence: optional
  content: The user's password. Only use this in encrypted profiles.
- key: LDAPAccountUseSSL
  title: Use SSL
  type: <boolean>
  presence: optional
  default: true
  content: If `true`, the system enables SSL.
- key: LDAPSearchSettings
  title: Search Settings
  type: <array>
  presence: optional
  content: An array of search settings dictionaries.
  subkeys:
  - key: LDAPSearchSettingsItem
    title: An LDAP Search Setting
    type: <dictionary>
    subkeys:
    - key: LDAPSearchSettingDescription
      title: Description
      type: <string>
      presence: optional
      content: The description of this search setting.
    - key: LDAPSearchSettingSearchBase
      title: Search Setting Search Base
      type: <string>
      presence: required
      content: The path to the node where a search should start.
    - key: LDAPSearchSettingScope
      title: Search Setting Scope
      type: <string>
      presence: optional
      rangelist:
      - LDAPSearchSettingScopeBase
      - LDAPSearchSettingScopeOneLevel
      - LDAPSearchSettingScopeSubtree
      default: LDAPSearchSettingScopeSubtree
      content: |-
        The type of recursion to use in the search:

        - `LDAPSearchSettingScopeBase`: The search uses only the immediate node that the search base points to.
        - `LDAPSearchSettingScopeOneLevel`: The search uses the node plus its immediate children.
        - `LDAPSearchSettingScopeSubtree`: The search uses the node plus all children, regardless of depth.
- key: VPNUUID
  title: VPNUUID
  supportedOS:
    iOS:
      introduced: '14.0'
    macOS:
      introduced: n/a
  type: <string>
  presence: optional
  content: The VPNUUID of the per-app VPN the account uses for network communication.
    Available in iOS 14 and later.
