title: Screensaver User
description: The payload that configures a user's screen saver settings.
payload:
  payloadtype: com.apple.screensaver.user
  supportedOS:
    iOS:
      introduced: n/a
    macOS:
      introduced: '10.11'
      multiple: false
      devicechannel: false
      userchannel: true
      supervised: false
      requiresdep: false
      userapprovedmdm: false
      allowmanualinstall: true
      userenrollment:
        mode: forbidden
    tvOS:
      introduced: n/a
    visionOS:
      introduced: n/a
    watchOS:
      introduced: n/a
  content: Specifies *user* screen saver settings. (Settings for Login Window screen
    saver use a different payload)
payloadkeys:
- key: moduleName
  type: <string>
  presence: required
  content: The name of the screen saver module.
- key: modulePath
  type: <string>
  presence: optional
  content: A full path to the screen saver module to use.
- key: idleTime
  type: <integer>
  presence: optional
  content: The number of seconds of inactivity before the screen saver activates (`0`
    = Never activate).
