title: NSExtension Management
description: The payload that configures the extensions that the system allows or
  disallows to run on the device.
payload:
  payloadtype: com.apple.NSExtension
  supportedOS:
    iOS:
      introduced: n/a
    macOS:
      introduced: '10.13'
      multiple: true
      devicechannel: true
      userchannel: true
      supervised: false
      requiresdep: false
      userapprovedmdm: false
      allowmanualinstall: true
      userenrollment:
        mode: forbidden
    tvOS:
      introduced: n/a
    visionOS:
      introduced: n/a
    watchOS:
      introduced: n/a
  content: Specifies which NSExtension extensions are to be allowed or disallowed
    on a system. Extensions can be managed by bundleID allow/deny lists and "extension
    points".
payloadkeys:
- key: AllowedExtensions
  type: <array>
  presence: optional
  content: An array of bundle identifiers for allowed extensions.
  subkeys:
  - key: AllowedExtensionsItem
    type: <string>
    presence: required
    content: An extension identifier.
- key: DeniedExtensions
  type: <array>
  presence: optional
  content: An array of bundle identifiers for extensions that the system doesn't allow
    to run.
  subkeys:
  - key: DeniedExtensionsItem
    type: <string>
    presence: required
    content: An extension identifier.
- key: DeniedExtensionPoints
  type: <array>
  presence: optional
  content: An array of extension points for extensions that the system doesn't allow
    to run.
  subkeys:
  - key: DeniedExtensionPointsItem
    type: <string>
    presence: required
    content: An extension identifier.
notes:
- title: ''
  content: |-
    You can manage extensions by bundle identifiers in allow and deny lists, or by a deny list of extension points.

    You can also start with all public extensions disallowed. To do so, include `AllPublicExtensionPoints` in `DeniedExtensionPoints`. This causes the system to expand the list to include all extensions that belong to any public extension points. This expansion occurs at evaluation time. The list of extension points can change from release to release. The expanded list disallows Apple and third-party extensions, but still allows extensions that belong to system-critcial extension points to execute.
