title: Desktop
description: The payload that configures the desktop wallpaper.
payload:
  payloadtype: com.apple.desktop
  supportedOS:
    iOS:
      introduced: n/a
    macOS:
      introduced: '10.10'
      multiple: false
      devicechannel: true
      userchannel: true
      supervised: false
      requiresdep: false
      userapprovedmdm: false
      allowmanualinstall: true
      userenrollment:
        mode: forbidden
    tvOS:
      introduced: n/a
    visionOS:
      introduced: n/a
    watchOS:
      introduced: n/a
payloadkeys:
- key: locked
  supportedOS:
    macOS:
      deprecated: '10.13'
  type: <boolean>
  presence: optional
  default: false
  content: If `true`, locks the desktop picture. Replaced with allowWallpaperModification
    in macOS 10.13.
- key: override-picture-path
  type: <string>
  presence: optional
  content: The path to the desktop picture. If set, this picture is always locked.
