title: Autonomous Single App Mode
description: The payload that configures Autonomous Single App mode.
payload:
  payloadtype: com.apple.asam
  supportedOS:
    iOS:
      introduced: n/a
    macOS:
      introduced: 10.13.4
      multiple: false
      devicechannel: true
      userchannel: false
      requiresdep: false
      userapprovedmdm: true
      allowmanualinstall: false
      userenrollment:
        mode: forbidden
    tvOS:
      introduced: n/a
    visionOS:
      introduced: n/a
    watchOS:
      introduced: n/a
payloadkeys:
- key: AllowedApplications
  supportedOS:
    macOS:
      introduced: 10.13.4
  type: <array>
  presence: required
  content: An array of dictionaries that specifies the apps that the system grants
    access to the Accessibility APIs.
  subkeys:
  - key: AllowedApplicationsItem
    type: <dictionary>
    content: A dictionary that specifies an app that can be granted access to the
      Accessibilty APIs.
    subkeys:
    - key: BundleIdentifier
      supportedOS:
        macOS:
          introduced: 10.13.4
      type: <string>
      presence: required
      content: The unique bundle identifier. If two dictionaries contain the same
        `BundleIdentifier` value but a different `TeamIdentifier` value, an error
        occurs and the profile won't be installed.
    - key: TeamIdentifier
      supportedOS:
        macOS:
          introduced: 10.13.4
      type: <string>
      presence: required
      content: The developer's team identifier that the system used when it signed
        the app.
notes:
- title: ''
  content: |-
    The system only allows installation of one profile of this type, and it requires installation through a user-approved MDM server. Apps listed in this profile have low-level access to the system, including, but not limited to, key logging and user interface manipulation outside the app's context.

    > Important:
    > If two dictionaries contain the same `BundleIdentifier` value but a different `TeamIdentifier` value, an error occurs and the system doesn’t install the profile.
