title: Profile Removal Password
description: Use this section to define settings for profile removal
payload:
  payloadtype: com.apple.profileRemovalPassword
  supportedOS:
    iOS:
      introduced: '4.0'
      supervised: true
      allowmanualinstall: true
      sharedipad:
        mode: forbidden
      userenrollment:
        mode: forbidden
    macOS:
      introduced: '10.7'
      devicechannel: true
      userchannel: true
      requiresdep: false
      userapprovedmdm: false
      allowmanualinstall: true
      userenrollment:
        mode: forbidden
    tvOS:
      introduced: '9.0'
      supervised: true
      allowmanualinstall: true
payloadkeys:
- key: RemovalPassword
  title: Removal Password
  type: <string>
  presence: optional
  content: The password for allowing the profile to be removed.
