title: Certificate Preference
description: ''
payload:
  payloadtype: com.apple.security.certificatepreference
  supportedOS:
    macOS:
      introduced: '10.12'
      multiple: true
      devicechannel: false
      userchannel: true
      requiresdep: false
      userapprovedmdm: false
      allowmanualinstall: true
      userenrollment:
        mode: allowed
  content: Defines a Certificate Preference item in the user's keychain that references
    a certificate payload included in the same profile. Can only appear in a user
    profile (not a device profile). See also "com.apple.security.identitypreference"
    for setting up identity preferences.
payloadkeys:
- key: Name
  type: <string>
  presence: required
  content: An email address (in RFC 822 format) or other name for which a preferred
    certificate is requested.
- key: PayloadCertificateUUID
  type: <string>
  presence: required
  content: The UUID of the certificate payload within the same profile to use for
    the identity credential.
