title: FDE FileVault Options
description: ''
payload:
  payloadtype: com.apple.MCX
  supportedOS:
    iOS:
      introduced: n/a
    macOS:
      introduced: '10.7'
      multiple: false
      devicechannel: true
      userchannel: false
      requiresdep: false
      userapprovedmdm: false
      allowmanualinstall: true
      userenrollment:
        mode: forbidden
    tvOS:
      introduced: n/a
    visionOS:
      introduced: n/a
    watchOS:
      introduced: n/a
  content: The FileVault accounts payload sets up options for enabling FileVault.
payloadkeys:
- key: dontAllowFDEDisable
  type: <boolean>
  presence: optional
  default: false
  content: If 'true', the system won't disable FileVault.
- key: dontAllowFDEEnable
  type: <boolean>
  presence: optional
  default: false
  content: If 'true', the system won't enable FileVault.
- key: DestroyFVKeyOnStandby
  supportedOS:
    macOS:
      introduced: '10.9'
  type: <boolean>
  presence: optional
  default: false
  content: If 'true', the system won't store th FileVault key across restarts.
