title: '802.1X: First Active Ethernet'
description: ''
payload:
  payloadtype: com.apple.firstactiveethernet.managed
  supportedOS:
    macOS:
      introduced: '10.7'
      devicechannel: true
      userchannel: true
      requiresdep: false
      userapprovedmdm: false
      allowmanualinstall: true
      userenrollment:
        mode: allowed
payloadkeys:
- key: ANY
  type: <any>
  presence: optional
  content: Keys relevant to 802.1x configuration.   User enrollment payloads do not
    support the various proxy keys including ProxyType, ProxyServer, ProxyServerPort,
    ProxyUsername, ProxyPassword,, ProxyPACURL and ProxyPACFallbackAllowed.
