title: SCEP
description: Use this section to define settings for configuration access to SCEP
  servers.
payload:
  payloadtype: com.apple.security.scep
  supportedOS:
    iOS:
      introduced: '4.0'
      multiple: true
      supervised: false
      allowmanualinstall: true
      sharedipad:
        mode: allowed
        devicechannel: true
        userchannel: false
      userenrollment:
        mode: allowed
    macOS:
      introduced: '10.7'
      multiple: true
      devicechannel: true
      userchannel: true
      requiresdep: false
      userapprovedmdm: false
      allowmanualinstall: true
      userenrollment:
        mode: allowed
    tvOS:
      introduced: '6.0'
      multiple: true
      supervised: false
      allowmanualinstall: true
    watchOS:
      introduced: '3.0'
      multiple: true
      supervised: false
      allowmanualinstall: true
payloadkeys:
- key: PayloadContent
  title: Payload Content
  type: <dictionary>
  presence: required
  content: An array of payload dictionaries. This array isn't present if 'IsEncrypted'
    is 'true'.
  subkeys:
  - key: URL
    title: URL
    supportedOS:
      macOS:
        introduced: '10.7'
    type: <string>
    presence: required
    content: The SCEP URL. See Over-the-Air Profile Delivery and Configuration for
      more information about SCEP.
  - key: Name
    title: Name
    type: <string>
    presence: optional
    content: A string that's understood by the SCEP server; for example, a domain
      name like example.org. If a certificate authority has multiple CA certificates,
      this field can be used to distinguish which is required.
  - key: Subject
    title: Subject
    type: <array>
    presence: optional
    content: |-
      The representation of an X.500 name as an array of OID and value.
      For example, '/C=US/O=Apple Inc./CN=foo/1.2.5.3=bar' translates to '[ [ [“C”, “US”] ], [ [“O”, “Apple Inc.'] ], …, [ [ “1.2.5.3”, “bar” ] ] ]'.

      OIDs can be represented as dotted numbers, with shortcuts for country (C), locality (L), state (ST), organization (O), organizational unit (OU), and common name (CN).
    subkeys:
    - key: SCEPSubjectArrayInnerArray
      title: Array Inside SCEP Subject Array
      type: <array>
      subkeys:
      - key: SCEPSubjectArrayPair
        title: Subject Array Pair
        type: <array>
        subkeys:
        - key: SCEPSubjectArrayPairItem
          title: SCEP Subject Array Pair Item
          type: <string>
          repetition:
            min: 2
            max: 2
  - key: Challenge
    title: Challenge
    type: <string>
    presence: optional
    content: A preshared secret.
  - key: Keysize
    title: Key Size
    type: <integer>
    presence: optional
    rangelist:
    - 1024
    - 2048
    - 4096
    default: 1024
    content: The key size, in bits.
  - key: Key Type
    title: Key Type
    type: <string>
    presence: optional
    default: RSA
    content: Always 'RSA'.
  - key: Key Usage
    title: Key Usage
    supportedOS:
      macOS:
        introduced: '10.11'
    type: <integer>
    presence: optional
    default: 0
    content: |-
      A bitmask indicating the use of the key.

      * 1: Signing
      * 4: Encryption

      Some certificate authorities, such as Windows CA, support only encryption or signing, but not both at the same time.
  - key: CAFingerprint
    title: Fingerprint
    type: <data>
    presence: optional
    content: The fingerprint of the Certificate Authority certificate.
  - key: Retries
    title: Retries
    supportedOS:
      macOS:
        introduced: '10.10'
    type: <integer>
    presence: optional
    default: 3
    content: The number of times the device should retry if the server sends a PENDING
      response.
  - key: RetryDelay
    title: Retry Delay
    supportedOS:
      macOS:
        introduced: '10.10'
    type: <integer>
    presence: optional
    default: 10
    content: The number of seconds to wait between subsequent retries. The first retry
      is attempted without this delay.
  - key: SubjectAltName
    title: Subject Alt Name
    type: <dictionary>
    presence: optional
    content: The SCEP payload can specify an optional 'SubjectAltName' dictionary
      that provides values required by the CA for issuing a certificate. You can specify
      a single string or an array of strings for each key. The values you specify
      depend on the CA you're using, but might include DNS name, URL, or email values.
      For an example, see Sample Configuration Profile or Over-the-Air Profile Delivery
      and Configuration.
    subkeys:
    - key: rfc822Name
      title: RFC 822 Name
      type: <string>
      presence: optional
      content: The RFC 822 (email address) string.
    - key: dNSName
      title: DNS Name
      type: <string>
      presence: optional
      content: The DNS name.
    - key: uniformResourceIdentifier
      title: URI
      type: <string>
      presence: optional
      content: The Uniform Resource Identifier.
    - key: ntPrincipalName
      title: NT Principal Name
      type: <string>
      presence: optional
      content: The NT principal name.
  - key: KeyIsExtractable
    supportedOS:
      macOS:
        introduced: 10.13.4
    type: <boolean>
    presence: optional
    default: true
    content: If 'false', disables exporting the private key from the keychain.
  - key: AllowAllAppsAccess
    title: Allow All Apps Access
    supportedOS:
      macOS:
        introduced: '10.10'
    type: <boolean>
    presence: optional
    default: false
    content: If 'true', all apps have access to the private key.
