title: Single Sign-On
description: ''
payload:
  payloadtype: com.apple.sso
  supportedOS:
    iOS:
      introduced: '7.0'
      multiple: false
      supervised: false
      allowmanualinstall: true
      sharedipad:
        mode: forbidden
      userenrollment:
        mode: allowed
    macOS:
      introduced: n/a
    tvOS:
      introduced: n/a
    visionOS:
      introduced: n/a
    watchOS:
      introduced: n/a
payloadkeys:
- key: Name
  type: <string>
  presence: required
  content: The human-readable name for the account.
- key: Kerberos
  type: <dictionary>
  presence: optional
  content: The Kerberos dictionary.
  subkeys:
  - key: PrincipalName
    type: <string>
    presence: optional
    content: The principal name. If not provided, the system prompts the user for
      one during profile installation. Required for MDM installation.
  - key: PayloadCertificateUUID
    supportedOS:
      iOS:
        introduced: '8.0'
    type: <string>
    presence: optional
    content: The 'PayloadUUID' of an identity certificate payload that the system
      can use to renew the Kerberos credential without user interaction. Set the payload
      type to either 'com.apple.security.pkcs12' or 'com.apple.security.scep' in the
      certificate payload. The configuration file needs to contain both the SSO payload
      and the identity certificate payload.
  - key: Realm
    type: <string>
    presence: required
    content: The properly capitalized realm name.
  - key: URLPrefixMatches
    type: <array>
    presence: optional
    content: |-
      The list of URL prefixes to match in order to use this account for Kerberos authentication over HTTP. If this key is missing, the system makes the account eligible to match all 'http://' and 'https://' URLs.
      Begin the URL matching patterns with either 'http://' or 'https://'. The system performs a simple string match, so the URL prefix 'http://www.apple.com/' doesn't match 'http://www.apple.com:80/'. However, if a matching pattern doesn't end in '/', the system automatically append a '/' to it.
    subkeys:
    - key: URLPrefixMatchesItem
      type: <string>
      presence: required
      content: A URL prefix.
  - key: AppIdentifierMatches
    type: <array>
    presence: optional
    content: |-
      The list of app identifiers that the system allows to use this login. If this field missing, the system matches all app identifiers with this login.
      Don't set an empty array. The array needs to contain strings that match App Bundle IDs. These strings can be exact matches such as 'com.mycompany.myapp', or they may specify a prefix match on the Bundle ID by using the '*' wildcard character. The wildcard character needs to appear after a period ('.'), and may only appear once, at the end of the string, for example, 'com.mycompany.*'. When you provide a wildcard, the system grants access to the account to any app with a Bundle ID that begins with the prefix.
    subkeys:
    - key: AppIdentifierMatchesItem
      type: <string>
      presence: required
      content: An app identifier.
