title: '802.1X: Second Ethernet'
description: The payload that configures the second wired Ethernet interface.
payload:
  payloadtype: com.apple.secondethernet.managed
  supportedOS:
    iOS:
      introduced: n/a
    macOS:
      introduced: '10.7'
      multiple: false
      devicechannel: true
      userchannel: true
      supervised: false
      requiresdep: false
      userapprovedmdm: false
      allowmanualinstall: true
      userenrollment:
        mode: allowed
    tvOS:
      introduced: n/a
    visionOS:
      introduced: n/a
    watchOS:
      introduced: n/a
payloadkeys:
- key: ANY
  type: <any>
  presence: optional
  content: Keys relevant to 802.1x configuration.  User enrollment payloads do not
    support the various proxy keys including ProxyType, ProxyServer, ProxyServerPort,
    ProxyUsername, ProxyPassword,, ProxyPACURL and ProxyPACFallbackAllowed.
notes:
- title: ''
  content: |-
    This payload's contents contain these profile-specific keys:

    - Interface (String): This payload uses the value `SecondEthernet`.
    - EAPClientConfiguration (`EAPClientConfiguration`): The dictionary that defines the enterprise profile for the network.
    - SetupModes (String): The type of connection mode, which is either "System" or "Loginwindow." "System" is the default.

    This payload applies to Ethernet interfaces according to service order, regardless of whether the interface is working.
