title: Cellular Private Network
description: Cellular Private Network Settings and Device Configuration
payload:
  payloadtype: com.apple.cellularprivatenetwork.managed
  supportedOS:
    iOS:
      introduced: '17.0'
      multiple: true
      supervised: false
      allowmanualinstall: true
      sharedipad:
        mode: allowed
        devicechannel: true
        userchannel: false
      userenrollment:
        mode: allowed
    macOS:
      introduced: n/a
    tvOS:
      introduced: n/a
    visionOS:
      introduced: n/a
    watchOS:
      introduced: n/a
  content: Payload can be used to provide device info on private network deployments
    including geographical location, preference over wifi, and network deployment
    type. Only five Cellular Private Networks can be configured simultaneously.
payloadkeys:
- key: Geofences
  type: <array>
  presence: optional
  content: A list of up to 1000 geofences for private networks. Geofencing is only
    used on iPhone.
  subkeys:
  - key: GeofenceItem
    type: <dictionary>
    subkeys:
    - key: Longitude
      type: <real>
      presence: required
      range:
        min: -180.0
        max: 180.0
      content: The longitude of the geofence.
    - key: Latitude
      type: <real>
      presence: required
      range:
        min: -90.0
        max: 90.0
      content: The latitude of the geofence.
    - key: Radius
      type: <real>
      presence: required
      range:
        min: 100.0
        max: 6500.0
      content: Specifies the radius of the geofence in meters. Set this value slightly
        greater than the private cellular network coverage area.
    - key: GeofenceId
      type: <string>
      presence: required
      content: A geofence identifier that's unique within a list of geofences.
- key: DataSetName
  type: <string>
  presence: required
  content: The name of the private network configuration data set.
- key: VersionNumber
  type: <string>
  presence: required
  content: The version number of this dataset that the system uses to track updates.
- key: CellularDataPreferred
  type: <boolean>
  presence: optional
  default: false
  content: Set to 'true' to prefer this private network over Wi-Fi.
- key: EnableNRStandalone
  type: <boolean>
  presence: optional
  default: false
  content: Set to 'true' if this private network is NR Standalone.
- key: NetworkIdentifier
  supportedOS:
    iOS:
      introduced: '18.0'
  type: <string>
  presence: optional
  content: String formatted in accordance with the definition of a "Coordinated NID"
    (option 1 or option 2) in 3GPP 31.102 §12.7.1. Used to match this profile to a
    SIM present on the device. All combinations of NetworkIdentifier and CsgNetworkIdentifier
    must be unique between profiles installed on the device.
- key: CsgNetworkIdentifier
  supportedOS:
    iOS:
      introduced: '18.0'
  type: <string>
  presence: optional
  content: String formatted in accordance with the definition of "CSG_ID" in 3GPP
    23.003 §4.7. Used to match this profile to a SIM present on the device. All combinations
    of NetworkIdentifier and CsgNetworkIdentifier must be unique between profiles
    installed on the device.
