title: TV Remote
description: The payload that configures the Apple TV remote.
payload:
  payloadtype: com.apple.tvremote
  supportedOS:
    iOS:
      introduced: '11.3'
      multiple: false
      supervised: true
      allowmanualinstall: true
      sharedipad:
        mode: allowed
        devicechannel: true
        userchannel: true
      userenrollment:
        mode: forbidden
    macOS:
      introduced: n/a
    tvOS:
      introduced: '11.3'
      multiple: false
      supervised: true
      allowmanualinstall: true
    visionOS:
      introduced: n/a
    watchOS:
      introduced: n/a
payloadkeys:
- key: AllowedRemotes
  supportedOS:
    iOS:
      introduced: n/a
  type: <array>
  presence: optional
  content: The array of valid devices that Apple TV can connect to.
  subkeys:
  - key: AllowedRemotesItem
    type: <dictionary>
    content: The array of valid devices that Apple TV can connect to.
    subkeys:
    - key: RemoteDeviceID
      type: <string>
      presence: required
      content: The MAC address of a permitted iOS device that can control this Apple
        TV. Use the format `xx:xx:xx:xx:xx:xx`, which isn't case-sensitive.
- key: AllowedTVs
  supportedOS:
    tvOS:
      introduced: n/a
  type: <array>
  presence: optional
  content: The array of valid Apple TV identifiers that the remote can connect to.
  subkeys:
  - key: AllowedTVsItem
    type: <dictionary>
    content: The array of valid Apple TV identifiers that the remote can connect to.
    subkeys:
    - key: TVDeviceID
      type: <string>
      presence: required
      content: The MAC address of an Apple TV device that the system permits this
        iOS device to control. Use the format `xx:xx:xx:xx:xx:xx`, which isn't case-sensitive.
    - key: TVDeviceName
      supportedOS:
        iOS:
          introduced: '15.0'
      type: <string>
      presence: optional
      content: The name of an Apple TV device that the system permits this iOS device
        to control.
