title: Mobile Accounts
description: The payload that configures mobile accounts on the device.
payload:
  payloadtype: com.apple.MCX
  supportedOS:
    iOS:
      introduced: n/a
    macOS:
      introduced: '10.7'
      multiple: false
      devicechannel: true
      userchannel: true
      supervised: false
      requiresdep: false
      userapprovedmdm: false
      allowmanualinstall: true
      userenrollment:
        mode: forbidden
    tvOS:
      introduced: n/a
    visionOS:
      introduced: n/a
    watchOS:
      introduced: n/a
  content: Sets up mobile account options for network based user accounts.
payloadkeys:
- key: com.apple.cachedaccounts.CreateAtLogin
  type: <boolean>
  presence: optional
  default: false
  content: If `true`, the system creates the mobile account at login time.
- key: com.apple.cachedaccounts.WarnOnCreate
  type: <boolean>
  presence: optional
  default: false
  content: If `true`, the system asks the user whether to create the mobile account
    and it allows the user to not create it.
- key: cachedaccounts.WarnOnCreate.allowNever
  type: <boolean>
  presence: optional
  default: false
  content: If `true`, the system allows the user to stop the prompts about mobile
    account creation every time the user logs in. This key is only valid if `com.apple.cachedaccounts.WarnOnCreate`
    is `true`.
- key: cachedaccounts.expiry.delete.disusedSeconds
  type: <integer>
  presence: optional
  default: -1
  content: The minimum number of seconds a mobile account can exist before the system
    makes an automatic attempt to remove the mobile account. Set to `0` to attempt
    removing it at the next login or logout. Set to `-1` to never attempt removing
    the mobile account.
- key: cachedaccounts.askForSecureTokenAuthBypass
  type: <boolean>
  presence: optional
  default: false
  content: If `true`, the system bypasses the secure token authorization dialog. This
    dialog only appears on APFS volumes.
