title: 'Parental Control: Dictation and Profanity'
description: Parental controls for restricting Siri, Dictation and Profanity
payload:
  payloadtype: com.apple.ironwood.support
  supportedOS:
    iOS:
      introduced: n/a
    macOS:
      introduced: '10.9'
      deprecated: '10.13'
      multiple: false
      devicechannel: true
      userchannel: true
      requiresdep: false
      userapprovedmdm: false
      allowmanualinstall: true
      userenrollment:
        mode: forbidden
    tvOS:
      introduced: n/a
    visionOS:
      introduced: n/a
    watchOS:
      introduced: n/a
payloadkeys:
- key: Profanity Allowed
  type: <boolean>
  presence: optional
  default: true
  content: If 'false', suppresses profanity. Use 'forceAssistantProfanityFilter' in
    Restrictions instead.
- key: Ironwood Allowed
  type: <boolean>
  presence: optional
  default: true
  content: If 'false', disables dictation. Use 'allowDictation' in Restrictions instead.
