title: AirPlay
description: AirPlay settings
payload:
  payloadtype: com.apple.airplay
  supportedOS:
    iOS:
      introduced: '7.0'
      multiple: true
      supervised: false
      allowmanualinstall: true
      sharedipad:
        mode: allowed
        devicechannel: true
        userchannel: false
      userenrollment:
        mode: allowed
    macOS:
      introduced: '10.10'
      multiple: true
      devicechannel: true
      userchannel: true
      requiresdep: false
      userapprovedmdm: false
      allowmanualinstall: true
      userenrollment:
        mode: allowed
    tvOS:
      introduced: n/a
    visionOS:
      introduced: n/a
    watchOS:
      introduced: n/a
  content: macOS supports more than one payload, iOS does not. Supported on the user
    channel for macOS only.
payloadkeys:
- key: AllowList
  title: AllowList
  supportedOS:
    iOS:
      introduced: '14.5'
      supervised: true
      userenrollment:
        mode: forbidden
    macOS:
      introduced: '11.3'
      userenrollment:
        mode: ignored
  type: <array>
  presence: optional
  content: If present, only AirPlay destinations in this list are available to the
    device. This allow list applies to supervised devices.
  subkeys: &id001
  - key: AllowListItem
    title: AllowList Content Item
    supportedOS:
      iOS:
        introduced: '7.0'
        supervised: true
        userenrollment:
          mode: forbidden
      macOS:
        introduced: '10.10'
        userenrollment:
          mode: ignored
    type: <dictionary>
    presence: required
    subkeys:
    - key: DeviceID
      title: Device ID
      supportedOS:
        iOS:
          deprecated: '18.0'
        macOS:
          deprecated: '15.0'
      type: <string>
      presence: optional
      format: ^([0-9A-Fa-f]{2}:){5}([0-9A-Fa-f]{2})$
      content: |-
        The device ID of the AirPlay destination in the format 'xx:xx:xx:xx:xx:xx'. This field isn't case-sensitive.
        The list of visible AirPlay destinations will be limited to devices that are present in the `AllowList` field of all installed AirPlay payloads.
        Specifying the same MACAddress more than once, whether in the same payload across different payloads, will result in undefined behavior.
        As of iOS 18 and macOS 15, `DeviceID` isn't supported, as tvOS 18 AirPlay destinations do not support it.
    - key: DeviceName
      title: Device Name
      supportedOS:
        iOS:
          introduced: '18.0'
        macOS:
          introduced: '15.0'
      type: <string>
      presence: optional
      content: |-
        The name of the AirPlay device.
        The list of visible AirPlay destinations will be limited to devices that are present in the AllowList field of all installed AirPlay payloads.
- key: Passwords
  title: Passwords
  type: <array>
  presence: optional
  content: If present, sets passwords for known AirPlay destinations. Using multiple
    entries for the same destination, whether within the same payload or across multiple
    installed payloads, is an error and results in undefined behavior.
  subkeys:
  - key: PasswordsItem
    title: Password Content Item
    type: <dictionary>
    presence: required
    subkeys:
    - key: DeviceName
      title: Device Name
      supportedOS:
        macOS:
          introduced: '15.0'
      type: <string>
      presence: required
      content: The name of the AirPlay destination; used in iOS, and available in
        macOS 15 and later.
    - key: Password
      title: Password
      type: <string>
      presence: required
      content: The password for the AirPlay destination.
    - key: DeviceID
      supportedOS:
        iOS:
          introduced: n/a
        macOS:
          deprecated: '15.0'
      type: <string>
      presence: optional
      content: |-
        The device ID of the AirPlay destination; used in macOS.
        In macOS 15 and later, 'DeviceID' is deprecated as tvOS 18 AirPlay destinations do not support it; use 'DeviceName' instead.
- key: Whitelist
  title: Whitelist
  supportedOS:
    iOS:
      deprecated: '14.5'
      supervised: true
      userenrollment:
        mode: forbidden
    macOS:
      deprecated: '11.3'
      userenrollment:
        mode: ignored
  type: <array>
  presence: optional
  content: Use 'AllowList' instead. This key is deprecated in iOS 14.5 and macOS 11.3.
  subkeys: *id001
