title: VPN
description: Use this section to define settings for VPN access.
payload:
  payloadtype: com.apple.vpn.managed
  supportedOS:
    iOS:
      introduced: '4.0'
      supervised: false
      allowmanualinstall: true
      sharedipad:
        mode: allowed
        devicechannel: true
        userchannel: false
      userenrollment:
        mode: forbidden
    macOS:
      introduced: '10.7'
      devicechannel: true
      userchannel: true
      requiresdep: false
      userapprovedmdm: false
      allowmanualinstall: true
      userenrollment:
        mode: forbidden
payloadkeys:
- key: VPNType
  title: Type
  type: <string>
  presence: required
  rangelist:
  - VPN
  - L2TP
  - PPTP
  - IPSec
  - IKEv2
  - AlwaysOn
  content: |-
    The type of the VPN, which defines which settings are appropriate for this VPN payload.
    If the type is 'VPN', then 'VPNSubType' is required.
- key: VPNSubType
  title: VPN Subtype
  type: <string>
  presence: optional
  content: "An identifier for a vendor-specified configuration dictionary if 'VPNType'\
    \ is 'VPN'.\nIf 'VPNType' is 'VPN', this field is required. If the configuration\
    \ is targeted at a VPN solution that uses a VPN plugin, then this field contains\
    \ the bundle identifier of the plugin. Here are some examples:\n* CiscoAnyConnect:\
    \ \L'com.cisco.anyconnect.applevpn.plugin'\n* JuniperSSL: 'net.juniper.sslvpn'\n\
    * F5SSL: 'com.f5.F5-Edge-Client.vpnplugin'\n* SonicWALLMobileConnect: \L'com.sonicwall.SonicWALL-SSLVPN.vpnplugin\
    \ '\n* ''ArubaVIA: \L'com.arubanetworks.aruba-via.vpnplugin'\nIf the configuration\
    \ is targeted at a VPN solution that uses a network extension provider, then this\
    \ field contains the bundle identifier of the app that contains the provider.\
    \ Contact the VPN solution vendor for the value of the identifier.\nIf 'VPNType'\
    \ is 'IKEv2', then the 'VPNSubType' field is optional and is reserved for future\
    \ use. If it is specified, it must contain the empty string."
- key: UserDefinedName
  title: User Defined Name
  type: <string>
  presence: required
  content: The description of the VPN connection displayed on the device.
- key: VendorConfig
  title: Vendor Configuration Dictionary
  type: <dictionary>
  presence: optional
  content: The vendor-specific configuration dictionary. This dictionary is read only
    if 'VPNSubType' is specified.
  subkeys:
  - key: Realm
    title: Realm
    type: <string>
    presence: optional
    content: The Kerberos realm name. This value should be properly capitalized.
  - key: Role
    title: Role
    type: <string>
    presence: optional
    content: |-
      The role to select when connecting to the server.
      This key is valid only for Juniper SSL.
  - key: Group
    title: Group
    type: <string>
    presence: optional
    content: |-
      The group to connect to on the head end.
      This key is valid only for Cisco AnyConnect
  - key: LoginGroupOrDomain
    title: Login Group or Domain
    type: <string>
    presence: optional
    content: The login group or domain.
- key: VPN
  title: VPN
  type: <dictionary>
  presence: optional
  content: A dictionary used to specify a VPN when 'VPNType' is set to 'VPN', 'IPSec',
    or 'IKEv2'.
  subkeys:
  - key: AuthenticationMethod
    title: Authentication Method
    type: <string>
    presence: optional
    rangelist:
    - Password
    - Certificate
    - Password+Certificate
    default: Password
    content: The authentication method to use.
  - key: PayloadCertificateUUID
    title: Certificate UUID
    type: <string>
    presence: optional
    content: The UUID of the certificate payload within the same profile to use for
      account credentials.
  - key: Password
    title: Account Password
    type: <string>
    presence: optional
    content: The VPN user password.
  - key: ProviderBundleIdentifier
    title: Provider Bundle Identifier
    type: <string>
    presence: optional
    content: The bundle identifier for the VPN provider.
  - key: ProviderDesignatedRequirement
    title: Provider Designated Requirement
    supportedOS:
      iOS:
        introduced: n/a
      macOS:
        introduced: '10.15'
    type: <string>
    presence: optional
    content: If the VPN provider is implemented as a system extension, then this field
      is required.
  - key: DisconnectOnIdle
    title: Enable Disconnect on Idle
    type: <integer>
    presence: optional
    rangelist:
    - 0
    - 1
    default: 0
    content: If 'true', disconnects after an on-demand connection idles.
  - key: DisconnectOnIdleTimer
    title: Disconnect on Idle time
    type: <integer>
    presence: optional
    content: The length of time to wait before disconnecting an on-demand connection
  - key: ProviderType
    type: <string>
    presence: optional
    rangelist:
    - packet-tunnel
    - app-proxy
    default: packet-tunnel
    content: The type of VPN service. If it is 'app-proxy', the service will tunnel
      traffic at the application level. If it is 'packet-tunnel', the service will
      tunnel traffic at the IP layer.
  - key: IncludeAllNetworks
    title: Include All Networks
    supportedOS:
      iOS:
        introduced: '14.0'
      macOS:
        introduced: '10.15'
    type: <integer>
    presence: optional
    rangelist:
    - 0
    - 1
    default: 0
    content: If 'true', routes all traffic through the VPN.
  - key: EnforceRoutes
    title: Enforce Routes
    supportedOS:
      iOS:
        introduced: '14.2'
      macOS:
        introduced: '11.0'
    type: <integer>
    presence: optional
    rangelist:
    - 0
    - 1
    default: 0
    content: |-
      If 'true', all the VPN's non-default routes take precedence over any locally defined routes.
      If 'IncludeAllNetworks' is 'true', the value of 'EnforceRoutes' is ignored.
      Available in iOS 14.2 and later, and macOS 11 and later.
  - key: ExcludeLocalNetworks
    title: Exclude Local Networks
    supportedOS:
      iOS:
        introduced: '14.2'
      macOS:
        introduced: '10.15'
    type: <integer>
    presence: optional
    rangelist:
    - 0
    - 1
    content: If 'true' and 'IncludeAllNetworks' is 'true', routes all local network
      traffic outside the VPN.
  - key: OnDemandEnabled
    title: Enable VPN On Demand
    type: <integer>
    presence: optional
    rangelist:
    - 0
    - 1
    default: 0
    content: If 'true', enables VPN On Demand.
  - key: OnDemandUserOverrideDisabled
    title: Prevent users from toggling VPN On Demand
    supportedOS:
      iOS:
        introduced: '14.0'
      macOS:
        introduced: n/a
    type: <integer>
    presence: optional
    rangelist:
    - 0
    - 1
    default: 0
    content: |-
      If 'true', the Connect On Demand toggle in Settings is disabled for this configuration.
      Available in iOS 14 and later.
  - key: OnDemandMatchDomainsAlways
    title: On Demand Match Domains Always
    type: <array>
    presence: optional
    content: |-
      A list of domain names. The associated domain names are treated as though they were associated with the 'OnDemandMatchDomainsOnRetry' key.

      This behavior can be overridden by 'OnDemandRules'.
    subkeytype: MatchDomainAlwaysElement
    subkeys: &id001
    - key: MatchDomainAlwaysElement
      title: Match Domain Always Element
      type: <string>
  - key: OnDemandMatchDomainsNever
    title: On Demand Match Domains Never
    type: <array>
    presence: optional
    content: |-
      A list of domain names. If the host name ends with one of these domain names, the VPN isn't started automatically. This is used to exclude a subdomain within an included domain.

      In iOS 7 and later, this key is deprecated (but still supported) in favor of 'EvaluateConnection' actions in the 'OnDemandRules' dictionaries.
    subkeytype: MatchDomainNeverElement
    subkeys: &id002
    - key: MatchDomainNeverElement
      title: Match Domain Never Element
      type: <string>
  - key: OnDemandMatchDomainsOnRetry
    title: On Demand Match Domains On Retry
    type: <array>
    presence: optional
    content: |-
      A list of domain names. If the host name ends with one of these domain names and a DNS query for that domain name fails, the VPN is started automatically.

      In iOS 7 and later, this key is deprecated (but still supported) in favor of 'EvaluateConnection' actions in the 'OnDemandRules' dictionaries.
    subkeytype: MatchDomainOnRetryElement
    subkeys: &id003
    - key: MatchDomainOnRetryElement
      title: Match Domain On Retry Element
      type: <string>
  - key: OnDemandRules
    title: On Demand Rules
    type: <array>
    presence: optional
    content: An array of dictionaries defining On Demand Rules.
    subkeytype: OnDemandRulesElement
    subkeys: &id004
    - key: OnDemandRulesElement
      title: On Demand Rules Element
      type: <dictionary>
      subkeys:
      - key: Action
        title: On Demand Action
        type: <string>
        presence: required
        rangelist:
        - Allow
        - Connect
        - Disconnect
        - EvaluateConnection
        - Ignore
        content: |-
          The action to take if this dictionary matches the current network. Possible values are:
          * 'Allow': Deprecated. Allow VPN On Demand to connect if triggered.
          * 'Connect': Unconditionally initiate a VPN connection on the next network attempt.
          * 'Disconnect': Tear down the VPN connection and do not reconnect on demand as long as this dictionary matches.
          * 'EvaluateConnection': Evaluate the ActionParameters array for each connection attempt.
          * 'Ignore:' Leave any existing VPN connection up, but do not reconnect on demand as long as this dictionary matches.
      - key: ActionParameters
        title: Action Parameters
        type: <dictionary>
        presence: optional
        content: |-
          A dictionary that provides rules similar to the 'OnDemandRules' dictionary, but evaluated on each connection instead of when the network changes. These dictionaries are evaluated in order, and the behavior is determined by the first dictionary that matches.
          The keys allowed in each dictionary are described below. Note: This array is used only for dictionaries in which 'EvaluateConnection' is the 'Action' value.
        subkeys:
        - key: Domains
          title: Domains
          type: <array>
          presence: required
          content: The domains for which this evaluation applies.
          subkeys:
          - key: DomainsElement
            title: Domains Element
            type: <string>
        - key: DomainAction
          title: Domain Action
          type: <string>
          presence: required
          rangelist:
          - ConnectIfNeeded
          - NeverConnect
          content: |-
            Defines the VPN behavior for the specified domains. Allowed values are:
            * 'ConnectIfNeeded': The specified domains should trigger a VPN connection attempt if domain name resolution fails, such as when the DNS server indicates that it cannot resolve the domain, responds with a redirection to a different server, or fails to respond (timeout).
            * 'NeverConnect': The specified domains should never trigger a VPN connection attempt.
        - key: RequiredDNSServers
          title: Required DNS Servers
          type: <array>
          presence: optional
          content: |-
            An array of IP addresses of DNS servers to be used for resolving the specified domains. These servers need not be part of the device's current network configuration. If these DNS servers are not reachable, a VPN connection is established in response. These DNS servers should be either internal DNS servers or trusted external DNS servers.
            Note: This key is valid only if the value of 'DomainAction' is 'ConnectIfNeeded'.
          subkeys:
          - key: RequiredDNSServersElement
            title: Required DNS Servers Element
            type: <string>
        - key: RequiredURLStringProbe
          title: Required URL String Probe
          type: <string>
          presence: optional
          content: |-
            An HTTP or HTTPS (preferred) URL to probe, using a GET request. If the URL's hostname cannot be resolved, if the server is unreachable, or if the server does not respond with a 200 HTTP status code, a VPN connection is established in response.
            Note: This key is valid only if the value of 'DomainAction' is 'ConnectIfNeeded'.
      - key: DNSDomainMatch
        title: DNS Domain Match
        type: <array>
        presence: optional
        content: |-
          An array of domain names. This rule matches if any of the domain names in the specified list matches any domain in the device's search domains list.
          A wildcard '*' prefix is supported. For example, '*.example.com' matches against either 'mydomain.example.com' or 'yourdomain.example.com'.
        subkeys:
        - key: DNSDomainMatchElement
          title: DNS Domain Match Element
          type: <string>
      - key: DNSServerAddressMatch
        title: DNS Server Address Match
        type: <array>
        presence: optional
        content: |-
          An array of IP addresses. This rule matches if any of the network's specified DNS servers match any entry in the array.
          Matching with a single wildcard is supported. For example, 17.* matches any DNS server in the 17.0.0.0/8 subnet.
        subkeys:
        - key: DNSServerAddressMatchElement
          title: DNS Server Address Match Element
          type: <string>
      - key: InterfaceTypeMatch
        title: Interface Type Match
        type: <string>
        presence: optional
        rangelist:
        - Ethernet
        - WiFi
        - Cellular
        content: An interface type. If specified, this rule matches only if the primary
          network interface hardware matches the specified type.
      - key: SSIDMatch
        title: SSID Match
        type: <array>
        presence: optional
        content: |-
          An array of SSIDs to match against the current network. If the network is not a Wi-Fi network or if the SSID does not appear in this array, the match fails.
          Omit this key and the corresponding array to match against any SSID.
        subkeys:
        - key: SSIDMatchElement
          title: SSID Match Element
          type: <string>
      - key: URLStringProbe
        title: URL String Probe
        type: <string>
        presence: optional
        content: A URL to probe. If this URL is successfully fetched (returning a
          200 HTTP status code) without redirection, this rule matches.
- key: IPv4
  title: IPv4 Settings
  type: <dictionary>
  presence: optional
  content: The dictionary containing IPv4 settings.
  subkeys:
  - key: OverridePrimary
    title: Override Primary Connection
    type: <integer>
    presence: optional
    rangelist:
    - 0
    - 1
    default: 0
    content: If 'true', all network traffic is sent over VPN.
- key: PPP
  title: PPP
  type: <dictionary>
  presence: optional
  content: The dictionary used when 'VPNType' is set to 'L2TP' or 'PTPP'.
  subkeys:
  - key: AuthName
    title: Account Username
    type: <string>
    presence: optional
    content: The VPN account user name. This key is used for L2TP and PPTP networks.
  - key: AuthPassword
    title: Account Password
    type: <string>
    presence: optional
    content: If TokenCard is 'false', use this password for authentication. This key
      is used for L2TP and PPTP networks.
  - key: TokenCard
    title: Use Token Card
    type: <integer>
    presence: optional
    rangelist:
    - 0
    - 1
    default: 0
    content: |-
      If 'true', uses a token card such as an RSA SecurID card for connecting.

      This key is used for L2TP networks.
  - key: CommRemoteAddress
    title: Remote Address
    type: <string>
    presence: optional
    content: |-
      The IP address or host name of VPN server.

      This key is used for L2TP and PPTP networks.
  - key: AuthEAPPlugins
    title: EAP Plugins
    type: <array>
    presence: optional
    content: An array of authentication plugins. If RSA SecurID is being used, this
      array should only have one value, 'EAP-RSA'. This key is used for L2TP and PPTP
      networks.
    subkeys:
    - key: EAPPluginElement
      title: EAP Plugin
      type: <string>
      rangelist:
      - EAP-RSA
      - EAP-TLS
      - EAP-KRB
      repetition:
        min: 1
        max: 1
  - key: AuthProtocol
    title: Protocol
    type: <array>
    presence: optional
    content: An array of authentication protocols. If RSA SecurID is being used, this
      array should have one value, 'EAP'. This key is used for L2TP and PPTP networks.
    subkeys:
    - key: AuthProtocolElement
      title: Auth Protocol
      type: <string>
      rangelist:
      - EAP
      repetition:
        min: 1
        max: 1
  - key: CCPMPPE40Enabled
    title: Enable CCPMPPE40
    type: <integer>
    presence: optional
    rangelist:
    - 0
    - 1
    content: If 'true' and 'CCPEnabled' is also 'true', enables CCPMPPE128 encryption.
  - key: CCPMPPE128Enabled
    title: Enable CCPMPPE128
    type: <integer>
    presence: optional
    rangelist:
    - 0
    - 1
    content: If 'true' and 'CCPEnabled' is also 'true', enables CCPMPPE40 encryption.
  - key: CCPEnabled
    title: Enable CCP
    type: <integer>
    presence: optional
    rangelist:
    - 0
    - 1
    content: |-
      If 'true', enables encryption on the connection.

      This key is used for PPTP networks.
  - key: DisconnectOnIdle
    title: Enable Disconnect on Idle
    type: <integer>
    presence: optional
    rangelist:
    - 0
    - 1
    default: 0
    content: If 'true', disconnects after an on demand connection idles.
  - key: DisconnectOnIdleTimer
    title: Disconnect on Idle time
    type: <integer>
    presence: optional
    content: The length of time to wait before disconnecting an on demand connection
- key: IPSec
  title: IPSec Settings
  type: <dictionary>
  presence: optional
  content: The dictionary containing IPSec settings.
  subkeys:
  - key: RemoteAddress
    title: Remote Address
    type: <string>
    presence: optional
    content: The IP address or host name of the VPN server.
  - key: AuthenticationMethod
    title: Authentication Method
    type: <string>
    presence: optional
    rangelist:
    - SharedSecret
    - Certificate
    default: SharedSecret
    content: The authentication method. Used for L2TP and Cisco IPSec.
  - key: XAuthName
    title: Username
    type: <string>
    presence: optional
    content: The user name for the VPN account for Cisco IPSec.
  - key: XAuthPassword
    title: Password
    type: <string>
    presence: optional
    content: The VPN account password used for Cisco IPSec.
  - key: XAuthEnabled
    title: XAUTH Enabled
    type: <integer>
    presence: optional
    rangelist:
    - 0
    - 1
    content: If 'true', enables Xauth for Cisco IPSec VPNs.
  - key: XAuthPasswordEncryption
    title: XAUTH Password Encryption
    type: <string>
    presence: optional
    rangelist:
    - Prompt
    content: String value is either “Prompt” or not present.
  - key: LocalIdentifier
    title: Local Identifier
    type: <string>
    presence: optional
    content: |-
      The name of the group. If Hybrid Authentication is used, the string must end with 'hybrid'.

      Present only if 'AuthenticationMethod' is 'SharedSecret' and using for Cisco IPSec.
  - key: LocalIdentifierType
    title: Local Identifier Type
    type: <string>
    presence: optional
    rangelist:
    - KeyID
    default: KeyID
    content: |-
      Present only if 'AuthenticationMethod' is 'SharedSecret'. The value is 'KeyID'.

      This type is used for L2TP and Cisco IPSec VPNs.
  - key: SharedSecret
    title: Shared Secret
    type: <data>
    presence: optional
    content: |-
      The shared secret for this VPN account.

      Only use this with L2TP and Cisco IPSec VPNs and if the 'AuthenticationMethod' key is set to 'SharedSecret'.
  - key: PayloadCertificateUUID
    title: Certificate UUID
    type: <string>
    presence: optional
    content: |-
      The UUID of the certificate payload within the same profile to use for the account credentials.

      Only use this with Cisco IPSec VPNs and if the 'AuthenticationMethod' key is set to 'Certificate'.
  - key: PromptForVPNPIN
    title: Prompt for PIN
    type: <boolean>
    presence: optional
    default: false
    content: If 'true', prompts for a PIN when connecting to Cisco IPSec VPNs.
  - key: DisconnectOnIdle
    title: Enable Disconnect on Idle
    type: <integer>
    presence: optional
    rangelist:
    - 0
    - 1
    default: 0
    content: If 'true', disconnect after an on-demand connection idles.
  - key: DisconnectOnIdleTimer
    title: Disconnect on Idle time
    type: <integer>
    presence: optional
    content: The length of time to wait before disconnecting an on-demand connection.
  - key: OnDemandEnabled
    title: Enable VPN On Demand
    type: <integer>
    presence: optional
    rangelist:
    - 0
    - 1
    default: 0
    content: If 'true', bring the VPN connection up on demand.
  - key: OnDemandMatchDomainsAlways
    title: On Demand Match Domains Always
    type: <array>
    presence: optional
    content: Deprecated. A list of domain names. In iOS 7 and later, if this key is
      present, the associated domain names are treated as though they were associated
      with the 'OnDemandMatchDomainsOnRetry' key. This behavior can be overridden
      by 'OnDemandRules'.
    subkeytype: MatchDomainAlwaysElement
    subkeys: *id001
  - key: OnDemandMatchDomainsNever
    title: On Demand Match Domains Never
    type: <array>
    presence: optional
    content: Deprecated. A list of domain names. In iOS 7 and later, this key is deprecated
      (but still supported) in favor of 'EvaluateConnection' actions in the 'OnDemandRules'
      dictionaries.
    subkeytype: MatchDomainNeverElement
    subkeys: *id002
  - key: OnDemandMatchDomainsOnRetry
    title: On Demand Match Domains On Retry
    type: <array>
    presence: optional
    content: Deprecated. A list of domain names. In iOS 7 and later, this key is deprecated
      (but still supported) in favor of 'EvaluateConnection' actions in the 'OnDemandRules'
      dictionaries.
    subkeytype: MatchDomainOnRetryElement
    subkeys: *id003
  - key: OnDemandRules
    title: On Demand Rules
    type: <array>
    presence: optional
    content: The on-demand rules dictionary.
    subkeytype: OnDemandRulesElement
    subkeys: *id004
- key: IKEv2
  title: IKEv2
  type: <dictionary>
  presence: optional
  content: The dictionary used when 'VPNType' is set to 'IKEv2.'
  subkeys:
  - key: RemoteAddress
    title: RemoteAddress
    type: <string>
    presence: required
    content: The IP address or host name of the VPN server.
  - key: LocalIdentifier
    title: LocalIdentifier
    type: <string>
    presence: required
    content: Identifier of the IKEv2 client.
  - key: RemoteIdentifier
    title: RemoteIdentifier
    type: <string>
    presence: required
    content: The remote identifier.
  - key: AuthenticationMethod
    title: AuthenticationMethod
    type: <string>
    presence: required
    rangelist:
    - None
    - SharedSecret
    - Certificate
    content: |-
      The type of authentication method for the VPN.

      To enable EAP-only authentication, the authentication method should be set to 'None' and the 'ExtendedAuthEnabled' key should be set to 1. If this key is set to 'None' and the 'ExtendedAuthEnabled' key isn't set, the authentication configuration defaults to 'SharedSecret'.
  - key: CertificateType
    title: Certificate Type
    type: <string>
    presence: optional
    rangelist:
    - RSA
    - ECDSA256
    - ECDSA384
    - ECDSA521
    - Ed25519
    default: RSA
    content: This key specifies the type of 'PayloadCertificateUUID' used for IKEv2
      machine authentication. If this key is included, the 'ServerCertificateIssuerCommonName'
      key is required.
  - key: PayloadCertificateUUID
    title: PayloadCertificateUUID
    type: <string>
    presence: optional
    content: The UUID of the certificate payload within the same profile to use as
      the account credential. If the value of 'AuthenticationMethod' is 'Certificate',
      this certificate is sent out for IKEv2 machine authentication. If extended authentication
      (EAP) is used, it is sent out for EAP-TLS authentication.
  - key: SharedSecret
    title: SharedSecret
    type: <string>
    presence: optional
    content: If 'AuthenticationMethod' is 'SharedSecret', this value is used for IKE
      authentication.
  - key: ExtendedAuthEnabled
    title: ExtendedAuthEnabled
    type: <integer>
    presence: optional
    rangelist:
    - 0
    - 1
    default: 0
    content: If 'true', enables EAP-only authentication.
  - key: AuthName
    title: AuthName
    type: <string>
    presence: optional
    content: The user name used for authentication.
  - key: AuthPassword
    title: AuthPassword
    type: <string>
    presence: optional
    content: The password used for authentication.
  - key: OnDemandEnabled
    title: Enable VPN On Demand
    type: <integer>
    presence: optional
    rangelist:
    - 0
    - 1
    default: 0
    content: If 1, VPN is brought up on demand.
  - key: OnDemandUserOverrideDisabled
    title: Prevent users from toggling VPN On Demand
    supportedOS:
      iOS:
        introduced: '14.0'
      macOS:
        introduced: n/a
    type: <integer>
    presence: optional
    rangelist:
    - 0
    - 1
    default: 0
    content: If 1, the Connect On Demand toggle in Settings is disabled for this configuration.
  - key: OnDemandRules
    title: On Demand Rules
    type: <array>
    presence: optional
    content: Determines when and how an OnDemand VPN should be used.
    subkeytype: OnDemandRulesElement
    subkeys: *id004
  - key: DeadPeerDetectionRate
    title: Dead Peer Detection Rate
    type: <string>
    presence: optional
    rangelist:
    - None
    - Low
    - Medium
    - High
    default: Medium
    content: |-
      One of the following:
      * 'None': No keepalive.
      * 'Low': Send keepalive every 30 minutes.
      * 'Medium': Send keepalive every 10 minutes.
      * 'High': Send keepalive every 1 minute.
  - key: ServerCertificateIssuerCommonName
    title: ServerCertificateIssuerCommonName
    type: <string>
    presence: optional
    content: Common Name of the server certificate issuer. If set, this field causes
      IKE to send a certificate request based on this certificate issuer to the server.
      This key is required if the 'CertificateType' key is included and the 'ExtendedAuthEnabled'
      key is set to 1.
  - key: ServerCertificateCommonName
    title: ServerCertificateCommonName
    type: <string>
    presence: optional
    content: The common name of the server certificate. This name is used to validate
      the certificate sent by the IKE server. If not set, the remote identifier is
      used to validate the certificate.
  - key: TLSMinimumVersion
    title: TLS Minimum Version
    supportedOS:
      iOS:
        introduced: '11.0'
      macOS:
        introduced: '10.13'
    type: <string>
    presence: optional
    rangelist:
    - '1.0'
    - '1.1'
    - '1.2'
    default: '1.0'
    content: The minimum TLS version to be used with EAP-TLS authentication.
  - key: TLSMaximumVersion
    title: TLS Maximum Version
    supportedOS:
      iOS:
        introduced: '11.0'
      macOS:
        introduced: '10.13'
    type: <string>
    presence: optional
    rangelist:
    - '1.0'
    - '1.1'
    - '1.2'
    default: '1.2'
    content: The maximum TLS version to be used with EAP-TLS authentication.
  - key: UseConfigurationAttributeInternalIPSubnet
    title: Use IPv4 / IPv6 Internal Subnet Attributes
    supportedOS:
      iOS:
        introduced: '9.0'
    type: <integer>
    presence: optional
    rangelist:
    - 0
    - 1
    default: 0
    content: If 'true', negotiations should use IKEv2 Configuration Attribute INTERNAL_IP4_SUBNET
      and INTERNAL_IP6_SUBNET.
  - key: DisableMOBIKE
    title: Disable Mobility and Multihoming
    supportedOS:
      iOS:
        introduced: '9.0'
    type: <integer>
    presence: optional
    rangelist:
    - 0
    - 1
    default: 0
    content: If 'true', disables MOBIKE.
  - key: DisableRedirect
    title: Disable Redirect
    supportedOS:
      iOS:
        introduced: '9.0'
    type: <integer>
    presence: optional
    rangelist:
    - 0
    - 1
    default: 0
    content: If 'true', disables IKEv2 redirect. If not set, the IKEv2 connection
      is redirected if a redirect request is received from the server.
  - key: NATKeepAliveOffloadEnable
    title: NAT Keep Alive Offload Enable
    supportedOS:
      iOS:
        introduced: '9.0'
    type: <integer>
    presence: optional
    rangelist:
    - 0
    - 1
    default: 1
    content: |-
      If 'true', enables NAT Keepalive offload for Always On VPN IKEv2 connections. Keepalive packets are sent by the device to maintain NAT mappings for IKEv2 connections that have a NAT on the path. Keepalive packets are sent at regular interval when the device is awake. If 'NATKeepAliveOffloadEnable' is set to 'true', Keepalive packets will be offloaded to hardware while the device is asleep.

      NAT Keepalive offload has an impact on the battery life since extra workload is added during sleep. The default interval for the Keepalive offload packets is 20 seconds over WiFi and 110 seconds over Cellular interface. The default NAT Keepalive works well on networks with small NAT mapping timeouts but imposes a potential battery impact. If a network is known to have larger NAT mapping timeouts, larger Keepalive intervals may be safely used to minimize battery impact. The Keepalive interval can be modified by setting the `NATKeepAliveInterval` key.
  - key: NATKeepAliveInterval
    title: NAT Keepalive Interval
    supportedOS:
      iOS:
        introduced: '9.0'
    type: <integer>
    presence: optional
    default: 20
    content: The NAT Keepalive interval for Always On VPN IKEv2 connections. This
      value controls the interval over which Keepalive offload packets are sent by
      the device. The minimum value is 20 seconds. If no key is specified, the default
      is 20 seconds over Wi-Fi and 110 seconds over a cellular interface.
  - key: EnablePFS
    title: Enable perfect forward secrecy
    supportedOS:
      iOS:
        introduced: '9.0'
    type: <integer>
    presence: optional
    rangelist:
    - 0
    - 1
    default: 0
    content: If 'true',  enables Perfect Forward Secrecy (PFS) for IKEv2 Connections.
  - key: EnableCertificateRevocationCheck
    title: Enable certificate revocation check
    supportedOS:
      iOS:
        introduced: '9.0'
    type: <integer>
    presence: optional
    rangelist:
    - 0
    - 1
    default: 0
    content: If 'true', performs a certificate revocation check for IKEv2 connections.
      This is a best-effort revocation check; server response timeouts won't cause
      it to fail.
  - key: EnableFallback
    title: Enable fallback
    supportedOS:
      iOS:
        introduced: '13.0'
      macOS:
        introduced: n/a
    type: <integer>
    presence: optional
    rangelist:
    - 0
    - 1
    default: 0
    content: |-
      If true, enables a tunnel over cellular data to carry traffic that is eligible for WiFi Assist and also requires VPN.
      Enabling fallback requires that the server support multiple tunnels for a single user.
  - key: MTU
    title: Maximum Tranmission Unit
    supportedOS:
      iOS:
        introduced: '14.0'
      macOS:
        introduced: '11.0'
    type: <integer>
    presence: optional
    range:
      min: 1280
      max: 1400
    default: 1280
    content: |-
      The Maximum Transmission Unit (MTU) specifies the maximum size in bytes of each packet that will be sent over the IKEv2 VPN interface.
      Available in iOS 14 and later, and macOS 11 and later.
  - key: IKESecurityAssociationParameters
    title: IKESecurityAssociationParameters
    type: <dictionary>
    presence: optional
    content: These parameters apply to Child Security Association unless 'ChildSecurityAssociationParameters'
      is specified.
    subkeytype: SecurityAssociationParameters
    subkeys: &id005
    - key: EncryptionAlgorithm
      title: EncryptionAlgorithm
      type: <string>
      presence: optional
      rangelist:
      - DES
      - 3DES
      - AES-128
      - AES-256
      - AES-128-GCM
      - AES-256-GCM
      - ChaCha20Poly1305
      default: AES-256
      content: The encryption algorithm.
    - key: IntegrityAlgorithm
      title: IntegrityAlgorithm
      type: <string>
      presence: optional
      rangelist:
      - SHA1-96
      - SHA1-160
      - SHA2-256
      - SHA2-384
      - SHA2-512
      default: SHA2-256
      content: The integrity algorithm.
    - key: DiffieHellmanGroup
      title: DiffieHellmanGroup
      type: <integer>
      presence: optional
      rangelist:
      - 1
      - 2
      - 5
      - 14
      - 15
      - 16
      - 17
      - 18
      - 19
      - 20
      - 21
      - 31
      default: 14
      content: The Diffie-Hellman group. For AlwaysOn VPN, minimum allowed Diffie
        Hellman Group is 14 in iOS 14.2 and later.
    - key: LifeTimeInMinutes
      title: LifeTimeInMinutes
      type: <integer>
      presence: optional
      range:
        min: 10
        max: 1440
      default: 1440
      content: The SA lifetime (rekey interval) in minutes.
  - key: ChildSecurityAssociationParameters
    title: ChildSecurityAssociationParameters
    type: <dictionary>
    presence: optional
    content: The 'ChildSecurityAssociationParameters' dictionaries.
    subkeytype: SecurityAssociationParameters
    subkeys: *id005
- key: DNS
  title: DNS
  type: <dictionary>
  presence: optional
  content: A dictionary used for all VPN types.
  subkeys:
  - key: ServerAddresses
    title: DNS Server Addresses
    supportedOS:
      iOS:
        introduced: '10.0'
      macOS:
        introduced: '10.12'
    type: <array>
    presence: required
    content: The array of DNS server IP address strings. These IP addresses can be
      a mixture of IPv4 and IPv6 addresses.
    subkeys:
    - key: ServerAddressesElement
      title: Server Address Element
      type: <string>
  - key: SearchDomains
    title: DNS Search Domains
    supportedOS:
      iOS:
        introduced: '10.0'
      macOS:
        introduced: '10.12'
    type: <array>
    presence: optional
    content: The list of domain strings used to fully qualify single-label host names.
    subkeys:
    - key: SearchDomainsElement
      title: Search Domains Element
      type: <string>
  - key: DomainName
    title: Domain Name
    supportedOS:
      iOS:
        introduced: '10.0'
      macOS:
        introduced: '10.12'
    type: <string>
    presence: optional
    content: The primary domain of the tunnel.
  - key: SupplementalMatchDomains
    title: Supplemental Match Domains
    supportedOS:
      iOS:
        introduced: '10.0'
      macOS:
        introduced: '10.12'
    type: <array>
    presence: optional
    content: |-
      The list of domain strings used to determine which DNS queries will use the DNS resolver settings contained in 'ServerAddresses'. This key is used to create a split DNS configuration where only hosts in certain domains are resolved using the tunnel's DNS resolver. Hosts not in one of the domains in this list are resolved using the system's default resolver.

      If 'SupplementalMatchDomains' contains the empty string it becomes the default domain.

      Split-tunnel configurations can direct all DNS queries to the VPN DNS servers before the primary DNS servers. If the VPN tunnel becomes the network's default route, the servers listed in 'ServerAddresses' become the default resolver and the 'SupplementalMatchDomains' list is ignored.
    subkeys: &id006
    - key: SupplementalMatchDomainsElement
      title: Supplemental Match Domains Element
      type: <string>
  - key: SupplementalMatchDomainsNoSearch
    title: Supplemental Match Domains No Search
    supportedOS:
      iOS:
        introduced: '10.0'
      macOS:
        introduced: '10.12'
    type: <integer>
    presence: optional
    rangelist:
    - 0
    - 1
    default: 0
    content: If 'false', append the domains in the 'SupplementalMatchDomains' list
      to the resolver's list of search domains.
- key: Proxies
  title: Proxies
  type: <dictionary>
  presence: optional
  content: The dictionary used to configure 'Proxies' for use with 'VPN'.
  subkeys:
  - key: ProxyAutoConfigEnable
    title: Proxy AutoConfig Enable
    type: <integer>
    presence: optional
    rangelist:
    - 0
    - 1
    content: If 'true', enables automatic proxy configuration.
  - key: ProxyAutoDiscoveryEnable
    title: Proxy Auto Discovery Enable
    type: <integer>
    presence: optional
    rangelist:
    - 0
    - 1
    default: 1
    content: If 'true', enables proxy auto discovery.
  - key: ProxyAutoConfigURLString
    title: Proxy Server URL
    type: <string>
    presence: optional
    content: The URL to the location of the proxy auto-configuration file. Used only
      when 'ProxyAutoConfigEnable' is 'true'.
  - key: SupplementalMatchDomains
    title: Supplemental Match Domains
    type: <array>
    presence: optional
    content: An array of domains that defines which hosts use proxy settings for hosts.
    subkeys: *id006
  - key: HTTPEnable
    title: Enable HTTP
    type: <integer>
    presence: optional
    rangelist:
    - 0
    - 1
    default: 0
    content: If 'true', enables proxy for HTTP traffic.
  - key: HTTPProxy
    title: HTTP Proxy
    type: <string>
    presence: optional
    content: The port number of the HTTP proxy. This field is required if 'HTTPProxy'
      is specified.
  - key: HTTPPort
    title: HTTP Port
    type: <integer>
    presence: optional
    range:
      min: 0
      max: 65535
    content: The host name of the HTTP proxy.
  - key: HTTPProxyUsername
    title: HTTP ProxyUsername
    type: <string>
    presence: optional
    content: The user name used for authentication.
  - key: HTTPProxyPassword
    title: HTTP ProxyPassword
    type: <string>
    presence: optional
    content: The password used for authentication.
  - key: HTTPSEnable
    title: Enable HTTPS
    type: <integer>
    presence: optional
    rangelist:
    - 0
    - 1
    default: 0
    content: If 'true', enables proxy for HTTPS traffic.
  - key: HTTPSProxy
    title: HTTPS Proxy
    type: <string>
    presence: optional
    content: The host name of the HTTPS proxy.
  - key: HTTPSPort
    title: HTTPS Port
    type: <integer>
    presence: optional
    range:
      min: 0
      max: 65535
    content: The port number of the HTTPS proxy. This field is required if 'HTTPSProxy'
      is specified.
- key: AlwaysOn
  title: AlwaysOn
  supportedOS:
    iOS:
      introduced: '8.0'
    macOS:
      introduced: n/a
  type: <dictionary>
  presence: optional
  content: The dictionary used when 'VPNType' is set to 'AlwaysOn'.
  subkeys:
  - key: UIToggleEnabled
    title: UI Toggle Enabled
    type: <integer>
    presence: optional
    rangelist:
    - 0
    - 1
    default: 0
    content: If 'true', allows the user to disable the VPN configuration.
  - key: TunnelConfigurations
    title: TunnelConfigurations
    type: <array>
    presence: required
    content: An array that contains an arbitrary number of tunnel configurations.
    subkeys:
    - key: TunnelConfigurationElement
      title: A TunnelConfiguration Element
      type: <dictionary>
      subkeys:
      - key: ProtocolType
        title: Protocol Type
        type: <string>
        presence: required
        rangelist:
        - IKEv2
        content: The type of connection, which must be 'IKEv2'.
      - key: Interfaces
        title: Interfaces
        type: <array>
        presence: optional
        content: The interfaces to apply this configuration to.
        subkeys:
        - key: InterfacesElement
          title: Interfaces Element
          type: <string>
          rangelist:
          - Cellular
          - WiFi
  - key: ServiceExceptions
    title: ServiceExceptions
    type: <array>
    presence: optional
    content: An array that contains an arbitrary number of service exceptions.
    subkeys:
    - key: ServiceExceptionElement
      title: A ServiceException Element
      type: <dictionary>
      subkeys:
      - key: ServiceName
        title: Service Name
        type: <string>
        presence: required
        rangelist:
        - VoiceMail
        - AirPrint
        - CellularServices
        content: The name of a service which is exempt from Always On VPN. 'CellularServices'
          is available in iOS 11.3 and later; it exempts 'VoLTE', 'IMS' and 'MMS'.
          WiFiCalling is exempted in iOS 13.4 and later.
      - key: Action
        title: Action
        type: <string>
        presence: required
        rangelist:
        - Allow
        - Drop
        content: The action to take with network connections from the named service.
  - key: ApplicationExceptions
    title: ApplicationExceptions
    supportedOS:
      iOS:
        introduced: '13.6'
    type: <array>
    presence: optional
    content: An array that contains an arbitrary number of applications whose connections
      will occur outside the VPN.
    subkeys:
    - key: ApplicationExceptionElement
      title: A ApplicationException Element
      type: <dictionary>
      subkeys:
      - key: BundleIdentifier
        title: Bundle Identifier
        type: <string>
        presence: required
        content: The app's bundle identifier.
      - key: LimitToProtocols
        title: LimitToProtocols
        type: <array>
        presence: optional
        content: Limit the exception to only the specified list of protocol(s). Only
          'UDP' is supported.
        subkeys:
        - key: LimitToProtocolElement
          title: LimitToProtocol Element
          type: <string>
          rangelist:
          - UDP
  - key: AllowCaptiveWebSheet
    title: Allow Captive Web Sheet
    type: <integer>
    presence: optional
    rangelist:
    - 0
    - 1
    default: 0
    content: If 'true', allows traffic from Captive Web Sheet outside the VPN tunnel.
  - key: AllowAllCaptiveNetworkPlugins
    title: Allow All Captive Network Plugins
    type: <integer>
    presence: optional
    rangelist:
    - 0
    - 1
    default: 0
    content: If 'true', allows traffic from all captive networking apps outside the
      VPN tunnel to perform captive network handling.
  - key: AllowedCaptiveNetworkPlugins
    title: AllowedCaptiveNetworkPlugins
    type: <array>
    presence: optional
    content: The array of captive networking apps whose traffic is allowed outside
      the VPN tunnel, to perform captive network handling. Used only when 'AllowAllCaptiveNetworkPlugins
      'is 'false'.
    subkeys:
    - key: AllowedCaptiveNetworkPluginElement
      title: An AllowedCaptiveNetworkPlugin Element
      type: <dictionary>
      subkeys:
      - key: BundleIdentifier
        title: Bundle Identifier
        type: <string>
        presence: required
        content: The bundle identifier for the app that is allowed on the captive
          network.
