title: Profile Removal Password
description: The payload that configures profile removal.
payload:
  payloadtype: com.apple.profileRemovalPassword
  supportedOS:
    iOS:
      introduced: '4.0'
      multiple: false
      supervised: true
      allowmanualinstall: true
      sharedipad:
        mode: forbidden
      userenrollment:
        mode: forbidden
    macOS:
      introduced: '10.7'
      multiple: false
      devicechannel: true
      userchannel: true
      supervised: false
      requiresdep: false
      userapprovedmdm: false
      allowmanualinstall: true
      userenrollment:
        mode: forbidden
    tvOS:
      introduced: '9.0'
      multiple: false
      supervised: true
      allowmanualinstall: true
    visionOS:
      introduced: n/a
    watchOS:
      introduced: n/a
payloadkeys:
- key: RemovalPassword
  title: Removal Password
  type: <string>
  presence: optional
  content: The password to allow removing the profile.
notes:
- title: ''
  content: This payload provides a password to allow users to remove a locked configuration
    profile from the device. If this payload is present and has a password value set,
    the device asks for the password when the user taps a profile's Remove button.
    This system encrypts the payload with the rest of the profile.
