title: Content Caching
description: ''
payload:
  payloadtype: com.apple.AssetCache.managed
  supportedOS:
    iOS:
      introduced: n/a
    macOS:
      introduced: 10.13.4
      multiple: false
      devicechannel: true
      userchannel: false
      requiresdep: false
      userapprovedmdm: false
      allowmanualinstall: true
      userenrollment:
        mode: forbidden
    tvOS:
      introduced: n/a
    visionOS:
      introduced: n/a
    watchOS:
      introduced: n/a
  content: Configures the Content Caching service.
payloadkeys:
- key: AllowCacheDelete
  supportedOS:
    macOS:
      introduced: '10.15'
  type: <boolean>
  presence: optional
  default: true
  content: If true, the system purges content from the cache automatically when it
    needs disk space for other apps when free disk space runs low on the computer.
    Set to 'false' to maximize effectiveness of Content Caching. Available in macOS
    10.15 and later.
- key: AllowPersonalCaching
  supportedOS:
    macOS:
      introduced: 10.13.4
  type: <boolean>
  presence: optional
  default: true
  content: |-
    If 'true', the system caches the user's iCloud data. Changes to this value don't have an immediate effect. Clients may take some time, such as hours or days, to react to changes.
    At least one of the 'AllowPersonalCaching' or 'AllowSharedCaching' keys need to be 'true'.
- key: AllowSharedCaching
  supportedOS:
    macOS:
      introduced: 10.13.4
  type: <boolean>
  presence: optional
  default: true
  content: |-
    If 'true', the system caches non-iCloud content, such as apps and software updates. Changes to this value don't have an immediate effect. Clients may take some time, such as hours or days, to react to changes.
    At least one of the 'AllowPersonalCaching' or 'AllowSharedCaching' keys need to be 'true'.
- key: AutoActivation
  supportedOS:
    macOS:
      introduced: 10.13.4
  type: <boolean>
  presence: optional
  default: false
  content: |-
    If 'true', the system automatically activates the content cache when possible and prevents disabling it. If 'allowContentCaching' is 'false', 'AutoActivation' is also 'false'.
    Removing a profile that set 'AutoActivation' to 'true' doesn't deactivate the Content Cache.
- key: AutoEnableTetheredCaching
  supportedOS:
    macOS:
      introduced: 10.15.4
  type: <boolean>
  presence: optional
  default: false
  content: |-
    If 'true', the system automatically enables Internet connection sharing when possible and prevent disabling Internet connection sharing. 'DenyTetheredCaching' overrides 'AutoEnableTetheredCaching'. Tethered caching requires Content Caching.
    Available in macOS 10.15.4 and later.
- key: CacheLimit
  supportedOS:
    macOS:
      introduced: 10.13.4
  type: <integer>
  presence: optional
  default: 0
  content: The maximum number of bytes of disk space to use for the content cache.
    Set to '0' for unlimited disk space.
- key: DataPath
  supportedOS:
    macOS:
      introduced: 10.13.4
  type: <string>
  presence: optional
  default: /Library/Application Support/Apple/AssetCache/Data
  content: |-
    The path to the directory used to store cached content. Changing this setting manually doesn't automatically move cached content from the old location to the new one. To move content automatically, use the Sharing preference's Content Caching pane. The value must be (or end with) '/Library/Application Support/Apple/AssetCache/Data'.
    The system creates a directory and its intermediates for the given data path if it doesn't already exist. The directory is owned by '_assetcache:_assetcache' and has mode 0750. Its immediate parent directory ('.../Library/Application Support/Apple/AssetCache') is owned by '_assetcache:_assetcache' and has mode '0755'.
- key: DenyTetheredCaching
  supportedOS:
    macOS:
      introduced: 10.13.4
  type: <boolean>
  presence: optional
  default: false
  content: If 'true', the system disables tethered caching.
- key: DisplayAlerts
  supportedOS:
    macOS:
      introduced: '10.15'
  type: <boolean>
  presence: optional
  default: false
  content: If 'true', Content Caching displays exceptional conditions (alerts) as
    system notifications in the upper corner of the screen. Alerts were automatically
    displayed starting in macOS 10.13. In macOS 10.15 the alerts are off by default,
    but still available through this setting. Available in macOS 10.15 and later.
- key: KeepAwake
  supportedOS:
    macOS:
      introduced: '10.15'
  type: <boolean>
  presence: optional
  default: false
  content: If 'true', the system prevents the computer from sleeping as long as Content
    Caching is on (System Settings > Sharing > Content Caching is on). Customers who
    want Content Caching to be as available as much as possible should turn this setting
    on. Available in macOS 10.15 and later.
- key: ListenRanges
  supportedOS:
    macOS:
      introduced: 10.13.4
  type: <array>
  presence: optional
  content: An array of dictionaries that describe a range of client IP addresses to
    serve.
  subkeytype: Ranges
  subkeys: &id001
  - key: RangesItem
    type: <dictionary>
    subkeys:
    - key: type
      supportedOS:
        macOS:
          introduced: 10.13.4
      type: <string>
      presence: optional
      rangelist:
      - IPv4
      - IPv6
      default: IPv4
      content: The IP address type.
    - key: first
      supportedOS:
        macOS:
          introduced: 10.13.4
      type: <string>
      presence: required
      content: The first IP address in the range.
    - key: last
      supportedOS:
        macOS:
          introduced: 10.13.4
      type: <string>
      presence: required
      content: The last IP address in the range.
- key: ListenRangesOnly
  supportedOS:
    macOS:
      introduced: 10.13.4
  type: <boolean>
  presence: optional
  default: false
  content: If 'true', the content cache provides content to the clients in the 'ListenRanges'.
- key: ListenWithPeersAndParents
  supportedOS:
    macOS:
      introduced: 10.13.4
  type: <boolean>
  presence: optional
  default: true
  content: If 'true', the content cache provides content to the clients in the union
    of the 'ListenRanges', 'PeerListenRanges' and 'Parents'.
- key: LocalSubnetsOnly
  supportedOS:
    macOS:
      introduced: 10.13.4
  type: <boolean>
  presence: optional
  default: true
  content: If 'true', the content cache offers content to clients only on the same
    immediate local network only. No content is offered to clients on other networks
    reachable by the content cache. If 'LocalSubnetsOnly' is 'true', the system ignores
    'ListenRanges'.
- key: LogClientIdentity
  supportedOS:
    macOS:
      introduced: 10.13.4
  type: <boolean>
  presence: optional
  default: false
  content: If 'true', the Content Cache logs the IP address and port number of the
    clients that request content.
- key: Parents
  supportedOS:
    macOS:
      introduced: 10.13.4
  type: <array>
  presence: optional
  content: An array of the local IP addresses of other content caches that this cache
    should download from or upload to, instead of downloading from or uploading to
    Apple directly. The system ignores invalid addresses and addresses of computers
    that aren't content caches. The system skips Parent caches that become unavailable.
    If all parent content caches become unavailable, the content cache downloads from
    or uploads to Apple directly, until a parent content cache becomes available again.
  subkeys:
  - key: ParentsItem
    type: <string>
    presence: required
    content: An IP address.
- key: ParentSelectionPolicy
  supportedOS:
    macOS:
      introduced: 10.13.4
  type: <string>
  presence: optional
  rangelist:
  - first-available
  - url-path-hash
  - random
  - round-robin
  - sticky-available
  default: round-robin
  content: |-
    The policy to implement when choosing among more than one configured parent content cache. With every policy, the system skips parent caches that are temporarily unavailable. Allowed values:

    * 'first-available': Always use the first available parent in the Parents list. Use this policy to designate permanent primary, secondary, and subsequent parents.
    * 'url-path-hash': Hash the path part of the requested URL so that the same parent is always used for the same URL. This is useful for maximizing the size of the combined caches of the parents.
    * 'random': Choose a parent at random. Use this policy for load balancing.
    * 'round-robin': Rotate through the parents in order. Use this policy for load balancing.
    * 'sticky-available': Use the first available parent in the Parents list until it becomes unavailable, then advance to the next one. Use this policy for designating floating primary, secondary, and subsequent parents.
- key: PeerFilterRanges
  supportedOS:
    macOS:
      introduced: 10.13.4
  type: <array>
  presence: optional
  content: An array of dictionaries describing a range of peer IP addresses that the
    content cache uses to filter its list of peers to query for content. The content
    cache only queries peers in 'PeerFilterRanges'. When 'PeerFilterRanges' is an
    empty array, the content cache doesn't query any peers.
  subkeytype: Ranges
  subkeys: *id001
- key: PeerListenRanges
  supportedOS:
    macOS:
      introduced: 10.13.4
  type: <array>
  presence: optional
  content: An array of dictionaries describing a range of peer IP addresses the content
    cache responds to. When 'PeerListenRanges' is an empty array, the content cache
    responds with an error to all cache queries.
  subkeytype: Ranges
  subkeys: *id001
- key: PeerLocalSubnetsOnly
  supportedOS:
    macOS:
      introduced: 10.13.4
  type: <boolean>
  presence: optional
  default: true
  content: If 'true', the content cache only peers with other content caches on the
    same immediate local network, rather than with content caches that use the same
    public IP address as the device. When 'PeerLocalSubnetsOnly' is 'true', it overrides
    the configuration of 'PeerFilterRanges' and 'PeerListenRanges'. If the network
    changes, the local network peering restrictions update appropriately. If 'false',
    the content cache defers to 'PeerFilterRanges' and 'PeerListenRanges' for configuring
    the peering restrictions.
- key: Port
  supportedOS:
    macOS:
      introduced: 10.13.4
  type: <integer>
  presence: optional
  default: 0
  content: The TCP port number on which the content cache accepts requests for uploads
    or downloads. Set to '0' to pick a random, available port.
- key: PublicRanges
  supportedOS:
    macOS:
      introduced: 10.13.4
  type: <array>
  presence: optional
  content: An array of dictionaries describing a range of public IP addresses that
    the cloud servers should use for matching clients to content caches.
  subkeytype: Ranges
  subkeys: *id001
