title: Finder
description: ''
payload:
  payloadtype: com.apple.finder
  supportedOS:
    macOS:
      introduced: '10.7'
      multiple: false
      devicechannel: true
      userchannel: true
      requiresdep: false
      userapprovedmdm: false
      allowmanualinstall: true
      userenrollment:
        mode: forbidden
payloadkeys:
- key: ProhibitBurn
  type: <boolean>
  presence: optional
  default: false
  content: If 'true', the system disables the Finder's burn support.
- key: InterfaceLevel
  supportedOS:
    macOS:
      removed: '10.15'
  type: <string>
  presence: optional
  rangelist:
  - Simple
  - Full
  content: Specifies whether Finder should operate in Simple or Full mode.
- key: ProhibitConnectTo
  type: <boolean>
  presence: optional
  default: false
  content: If 'true', the system disables Connect to Server.
- key: ProhibitEject
  type: <boolean>
  presence: optional
  default: false
  content: If 'true', the system disables Eject.
- key: ProhibitGoToFolder
  type: <boolean>
  presence: optional
  default: false
  content: If 'true', the system disables Go to Folder.
- key: ShowExternalHardDrivesOnDesktop
  type: <boolean>
  presence: optional
  default: true
  content: If 'false', external hard drives don't appear on the Desktop.
- key: ShowHardDrivesOnDesktop
  type: <boolean>
  presence: optional
  default: false
  content: If 'false', internal hard drives don't appear on the Desktop.
- key: ShowMountedServersOnDesktop
  type: <boolean>
  presence: optional
  default: false
  content: If 'false', mounted file servers don't appear on the Desktop.
- key: ShowRemovableMediaOnDesktop
  type: <boolean>
  presence: optional
  default: true
  content: If 'false', removable media items don't appear on the Desktop.
- key: WarnOnEmptyTrash
  type: <boolean>
  presence: optional
  default: true
  content: If 'false', the user isn't warned before emptying the trash.
