title: Login Window
description: ''
payload:
  payloadtype: com.apple.loginwindow
  supportedOS:
    macOS:
      introduced: '10.7'
      devicechannel: true
      userchannel: false
      requiresdep: false
      userapprovedmdm: false
      allowmanualinstall: true
      userenrollment:
        mode: forbidden
  content: The com.apple.loginwindow payload creates managed preferences on macOS
    for system/device profiles.
payloadkeys:
- key: SHOWFULLNAME
  type: <boolean>
  presence: optional
  default: false
  content: If 'true', shows the name and password dialog; if 'false', displays a list
    of users.
- key: HideLocalUsers
  type: <boolean>
  presence: optional
  default: false
  content: If 'true', shows only network and system users when showing a user list.
- key: IncludeNetworkUser
  type: <boolean>
  presence: optional
  default: false
  content: If 'true', shows network users when showing a user list.
- key: HideAdminUsers
  type: <boolean>
  presence: optional
  default: false
  content: If 'true', hides administrator users when showing a user list.
- key: SHOWOTHERUSERS_MANAGED
  type: <boolean>
  presence: optional
  default: false
  content: If 'true', displays Other... when showing a list of users.
- key: AdminHostInfo
  type: <string>
  presence: optional
  rangelist:
  - HostName
  - SystemVersion
  - IPAddress
  content: If this key is included in the payload, its value is displayed in the login
    window as additional computer information. Before macOS 10.10, this string could
    contain only certain information (host name, system version, or IP address). After
    macOS 10.10, setting this key to any value allows the user to click the time area
    of the menu bar to toggle through various computer information values.
- key: AllowList
  type: <array>
  presence: optional
  content: The list of user GUIDs or group GUIDs of users that are allowed to log
    in. An asterisk '*' string specifies all users or groups.
  subkeys:
  - key: AllowListItem
    type: <string>
    presence: required
    content: A user or group GUID.
- key: DenyList
  type: <array>
  presence: optional
  content: The list of user GUIDs or group GUIDs of users that cannot log in. This
    list takes priority over the list in the 'AllowList' key.
  subkeys:
  - key: DenyListItem
    type: <string>
    presence: required
    content: A user or group GUID.
- key: HideMobileAccounts
  type: <boolean>
  presence: optional
  default: false
  content: If 'true', hides mobile account users in a user list. In some cases, mobile
    users show up as network users.
- key: ShutDownDisabled
  type: <boolean>
  presence: optional
  default: false
  content: If 'true', disables the Shut Down button.
- key: RestartDisabled
  type: <boolean>
  presence: optional
  default: false
  content: If 'true', disables the Restart item.
- key: SleepDisabled
  type: <boolean>
  presence: optional
  default: false
  content: If 'true', disables the Sleep button.
- key: DisableConsoleAccess
  type: <boolean>
  presence: optional
  default: false
  content: If 'true', disregards the '>console' special user name, which will provide
    a command line UI.
- key: LoginwindowText
  type: <string>
  presence: optional
  content: The text to display in the login window.
- key: ShutDownDisabledWhileLoggedIn
  type: <boolean>
  presence: optional
  default: false
  content: If 'true', disables the Shut Down menu item when the user is logged in.
- key: RestartDisabledWhileLoggedIn
  type: <boolean>
  presence: optional
  default: false
  content: If 'true', disables the Restart menu item when the user is logged in.
- key: PowerOffDisabledWhileLoggedIn
  type: <boolean>
  presence: optional
  default: false
  content: If 'true', disables the Power Off menu item when the user is logged in.
- key: LogOutDisabledWhileLoggedIn
  supportedOS:
    macOS:
      introduced: '10.13'
  type: <boolean>
  presence: optional
  default: false
  content: If 'true', disables the Log Out menu item when the user is logged in. Available
    in macOS 10.13 and later.
- key: DisableScreenLockImmediate
  supportedOS:
    macOS:
      introduced: '10.13'
  type: <boolean>
  presence: optional
  default: false
  content: If 'true', disables the immediate Screen Lock functions. Available in macOS
    10.13 and later.
- key: showInputMenu
  supportedOS:
    macOS:
      introduced: '10.8'
  type: <boolean>
  presence: optional
  default: false
  content: If 'True', shows the Input Menu in the login window.
- key: DisableFDEAutoLogin
  supportedOS:
    macOS:
      introduced: '10.9'
  type: <boolean>
  presence: optional
  default: false
  content: If t'rue', disables the automatic login option when using FileVault.
