title: System Logging
description: The payload that configures system logging.
payload:
  payloadtype: com.apple.system.logging
  supportedOS:
    iOS:
      introduced: n/a
    macOS:
      introduced: '10.12'
      multiple: true
      devicechannel: true
      userchannel: true
      supervised: false
      requiresdep: false
      userapprovedmdm: false
      allowmanualinstall: true
      userenrollment:
        mode: forbidden
    tvOS:
      introduced: n/a
    visionOS:
      introduced: n/a
    watchOS:
      introduced: n/a
payloadkeys:
- key: Processes
  supportedOS:
    macOS:
      introduced: n/a
  type: <dictionary>
  presence: optional
  content: Not to be used.
  subkeytype: Item
  subkeys: &id001
  - key: ANY
    type: <any>
    presence: optional
    content: TBD
- key: Subsystems
  supportedOS:
    macOS:
      introduced: n/a
  type: <dictionary>
  presence: optional
  content: A dictionary enabling the logging level for subsystems. See `Customizing
    Logging Behavior While Debugging` for more details about the format of the dictionary.
  subkeytype: Item
  subkeys: *id001
- key: System
  supportedOS:
    macOS:
      introduced: n/a
  type: <dictionary>
  presence: optional
  content: This dictionary has one key, `Enable-Private-Data`. Setting that value
    to `true` enables private data logging for the entire system.
  subkeytype: Item
  subkeys: *id001
