title: Setup Assistant
description: ''
payload:
  payloadtype: com.apple.SetupAssistant.managed
  supportedOS:
    iOS:
      introduced: '14.0'
      multiple: false
      supervised: true
      allowmanualinstall: true
      sharedipad:
        mode: allowed
        devicechannel: true
        userchannel: false
      userenrollment:
        mode: forbidden
    macOS:
      introduced: '10.12'
      multiple: false
      devicechannel: true
      userchannel: true
      requiresdep: false
      userapprovedmdm: false
      allowmanualinstall: true
      userenrollment:
        mode: forbidden
  content: On macOS, this payload can specify Setup Assistant options for either the
    system or particular users.
payloadkeys:
- key: SkipCloudSetup
  supportedOS:
    iOS:
      introduced: n/a
  type: <boolean>
  presence: optional
  default: false
  content: If 'true', the system skips the Apple ID setup pane.
- key: SkipSiriSetup
  supportedOS:
    iOS:
      introduced: n/a
  type: <boolean>
  presence: optional
  default: false
  content: If 'true', the system skips the Siri setup pane.
- key: SkipPrivacySetup
  supportedOS:
    iOS:
      introduced: n/a
    macOS:
      introduced: 10.13.4
  type: <boolean>
  presence: optional
  default: false
  content: If 'true', the system skips the Privacy consent pane.
- key: SkipiCloudStorageSetup
  supportedOS:
    iOS:
      introduced: n/a
    macOS:
      introduced: 10.13.4
  type: <boolean>
  presence: optional
  default: false
  content: If 'true', the system skips the iCloud Storage pane.
- key: SkipTrueTone
  supportedOS:
    iOS:
      introduced: n/a
    macOS:
      introduced: 10.13.6
  type: <boolean>
  presence: optional
  default: false
  content: If 'true', the system skips the True Tone Display pane.
- key: SkipAppearance
  supportedOS:
    iOS:
      introduced: n/a
    macOS:
      introduced: '10.14'
  type: <boolean>
  presence: optional
  default: false
  content: If 'true', the system skips the Choose Your Look pane.
- key: SkipTouchIDSetup
  supportedOS:
    iOS:
      introduced: n/a
    macOS:
      introduced: '10.15'
  type: <boolean>
  presence: optional
  default: false
  content: If 'true', the system skips the Touch ID setup pane.
- key: SkipScreenTime
  supportedOS:
    iOS:
      introduced: n/a
    macOS:
      introduced: '10.15'
  type: <boolean>
  presence: optional
  default: false
  content: If 'true', the system skips the Screen Time pane.
- key: SkipAccessibility
  supportedOS:
    iOS:
      introduced: n/a
    macOS:
      introduced: '11.0'
  type: <boolean>
  presence: optional
  default: false
  content: If 'true', the system skips the Accessibility pane.
- key: SkipSetupItems
  supportedOS:
    iOS:
      introduced: '14.0'
    macOS:
      introduced: n/a
  type: <array>
  presence: optional
  content: An array strings that describe the setup items to skip. SkipKeys provides
    a list of valid strings and their meanings. Available in iOS 14 and later.
  subkeys:
  - key: SkipSetupItems
    type: <string>
- key: SkipUnlockWithWatch
  supportedOS:
    iOS:
      introduced: n/a
    macOS:
      introduced: '12.0'
  type: <boolean>
  presence: optional
  default: false
  content: If 'true', the system skips the Unlock With Apple Watch pane.
- key: SkipWallpaper
  supportedOS:
    iOS:
      introduced: n/a
    macOS:
      introduced: '14.1'
  type: <boolean>
  presence: optional
  default: false
  content: If 'true', the system skips the Wallpaper selection window.
