title: 'Parental Controls: Time Limits'
description: The payload that configures parental control time limits.
payload:
  payloadtype: com.apple.familycontrols.timelimits.v2
  supportedOS:
    iOS:
      introduced: n/a
    macOS:
      introduced: '10.7'
      multiple: false
      devicechannel: true
      userchannel: true
      supervised: false
      requiresdep: false
      userapprovedmdm: false
      allowmanualinstall: true
      userenrollment:
        mode: forbidden
    tvOS:
      introduced: n/a
    visionOS:
      introduced: n/a
    watchOS:
      introduced: n/a
  content: Parental controls time limits.
payloadkeys:
- key: familyControlsEnabled
  type: <boolean>
  presence: required
  content: If `true`, enables time limits.
- key: time-limits
  type: <dictionary>
  presence: optional
  content: The time limits to enforce if `familyControlsEnabled` is enabled.
  subkeys:
  - key: weekday-allowance
    type: <dictionary>
    presence: optional
    content: The weekday allowance settings.
    subkeytype: Allowance
    subkeys: &id001
    - key: enabled
      type: <boolean>
      presence: required
      content: If `true`, enable these settings.
    - key: rangeType
      type: <integer>
      presence: required
      rangelist:
      - 0
      - 1
      content: |-
        The type of day range, which has the following possible values:

        - `0`: Weekday
        - `1`: Weekend
    - key: start
      type: <string>
      presence: optional
      content: The curfew start time, in the format '%d:%d:%d'.
    - key: end
      type: <string>
      presence: optional
      content: The curfew end time, in the format `%d:%d:%d`.
    - key: secondsPerDay
      type: <integer>
      presence: optional
      content: The allowance for that day, in seconds.
  - key: weekday-curfew
    type: <dictionary>
    presence: optional
    content: The weekday curfew settings.
    subkeytype: Allowance
    subkeys: *id001
  - key: weekend-allowance
    type: <dictionary>
    presence: optional
    content: The weekend allowance settings.
    subkeytype: Allowance
    subkeys: *id001
  - key: weekend-curfew
    type: <dictionary>
    presence: optional
    content: The weekend curfew settings.
    subkeytype: Allowance
    subkeys: *id001
