title: Time Server
description: The payload that configures the time server.
payload:
  payloadtype: com.apple.MCX
  supportedOS:
    iOS:
      introduced: n/a
    macOS:
      introduced: 10.12.4
      multiple: false
      devicechannel: true
      userchannel: false
      requiresdep: false
      userapprovedmdm: false
      allowmanualinstall: true
      userenrollment:
        mode: forbidden
    tvOS:
      introduced: n/a
    visionOS:
      introduced: n/a
    watchOS:
      introduced: n/a
  content: Settings for time zone and server. If multiple profiles with this payload
    are sent, the device's time server will be set to the value in the last payload
    installed. Removing the payload will not change the settings back to the prior
    settings.
payloadkeys:
- key: timeServer
  type: <string>
  presence: optional
  content: The NTP server to connect to. In macOS 10.13 and later, only one time server
    is supported.
- key: timeZone
  type: <string>
  presence: optional
  content: The time zone path location string in `/usr/share/zoneinfo/`; for example,
    `America/Denver` or `Zulu`.
notes:
- title: ''
  content: If multiple profiles with this payload are sent, the system sets the device's
    time server to the value in the last payload installed. Removing the payload won't
    change the settings back to the prior settings.
