title: User Preferences
payload:
  payloadtype: com.apple.preference.users
  supportedOS:
    iOS:
      introduced: n/a
    macOS:
      introduced: '10.12'
      multiple: false
      devicechannel: true
      userchannel: true
      requiresdep: false
      userapprovedmdm: false
      allowmanualinstall: true
      userenrollment:
        mode: allowed
    tvOS:
      introduced: n/a
    visionOS:
      introduced: n/a
    watchOS:
      introduced: n/a
payloadkeys:
- key: DisableUsingiCloudPassword
  type: <boolean>
  presence: optional
  default: false
  content: If 'true', disables the iCloud password for local accounts.
