title: DNS Proxy
description: The payload that configures DNS proxies.
payload:
  payloadtype: com.apple.dnsProxy.managed
  supportedOS:
    iOS:
      introduced: '11.0'
      multiple: false
      supervised: false
      allowmanualinstall: false
      sharedipad:
        mode: allowed
        devicechannel: true
        userchannel: false
      userenrollment:
        mode: allowed
    macOS:
      introduced: '10.15'
      multiple: false
      devicechannel: true
      userchannel: false
      requiresdep: false
      userapprovedmdm: false
      allowmanualinstall: true
      userenrollment:
        mode: forbidden
    tvOS:
      introduced: n/a
    visionOS:
      introduced: '1.1'
      multiple: false
      supervised: false
      allowmanualinstall: false
      userenrollment:
        mode: allowed
    watchOS:
      introduced: n/a
  content: As of iOS 15.0 this payload can be installed on unsupervised devices via
    MDM and can only be installed via MDM. As of iOS 16.0, this can be installed on
    user enrollments via MDM if DNSProxyUUID is specified.
payloadkeys:
- key: AppBundleIdentifier
  title: App Bundle Identifier
  type: <string>
  presence: required
  content: The bundle identifier of the app containing the DNS proxy network extension.
- key: ProviderBundleIdentifier
  title: Provider Bundle Identifier
  type: <string>
  presence: optional
  content: The bundle identifier of the DNS proxy network extension to use. Declaring
    the bundle identifier is useful for apps that contain more than one DNS proxy
    extension.
- key: ProviderConfiguration
  title: Provider Configuration
  type: <dictionary>
  presence: optional
  content: The dictionary of vendor-specific configuration items.
  subkeys:
  - key: ANY
    type: <any>
    presence: optional
    content: Key/value pairs.
- key: DNSProxyUUID
  title: DNS Proxy UUID
  supportedOS:
    iOS:
      introduced: '16.0'
    macOS:
      introduced: n/a
  type: <string>
  presence: optional
  content: A globally unique identifier for this DNS proxy configuration. The proxy
    processes DNS lookups traffic for managed apps with the same `DNSProxyUUID` in
    their app attributes. This key is required for user enrollment.
notes:
- title: ''
  content: Beginning with iOS 15, this profile is unsupervised and needs to be installed
    through MDM.
