title: Certificate (PEM)
description: Use this section to define settings for a pem certificate.
payload:
  payloadtype: com.apple.security.pem
  supportedOS:
    iOS:
      introduced: '4.0'
      supervised: false
      allowmanualinstall: true
      sharedipad:
        mode: allowed
        devicechannel: true
        userchannel: false
      userenrollment:
        mode: allowed
    macOS:
      introduced: '10.7'
      devicechannel: true
      userchannel: true
      requiresdep: false
      userapprovedmdm: false
      allowmanualinstall: true
      userenrollment:
        mode: allowed
    tvOS:
      introduced: '5.0'
      supervised: false
      allowmanualinstall: true
    watchOS:
      introduced: '3.0'
      allowmanualinstall: true
  content: PEM-encoded certificate without private key. May contain root certificates.
payloadkeys:
- key: PayloadCertificateFileName
  title: Payload Certificate Filename
  type: <string>
  presence: optional
  content: The file name of the enclosed certificate.
- key: PayloadContent
  title: Payload Certificate Filename
  type: <data>
  presence: required
  content: The binary representation of the payload, encoded in Base64.
