title: 'Parental Controls: Game Center'
description: The payload that configures Game Center parental controls.
payload:
  payloadtype: com.apple.gamed
  supportedOS:
    iOS:
      introduced: n/a
    macOS:
      introduced: '10.9'
      multiple: false
      devicechannel: true
      userchannel: true
      supervised: false
      requiresdep: false
      userapprovedmdm: false
      allowmanualinstall: true
      userenrollment:
        mode: forbidden
    tvOS:
      introduced: n/a
    visionOS:
      introduced: n/a
    watchOS:
      introduced: n/a
  content: Parental controls Game Center restrictions.
payloadkeys:
- key: GKFeatureGameCenterAllowed
  supportedOS:
    macOS:
      deprecated: '10.13'
  type: <boolean>
  presence: optional
  default: true
  content: If `true`, enables Game Center.
- key: GKFeatureAccountModificationAllowed
  type: <boolean>
  presence: optional
  default: true
  content: If `true`, allows account modifications.
- key: GKFeatureAddingGameCenterFriendsAllowed
  supportedOS:
    macOS:
      deprecated: '10.13'
  type: <boolean>
  presence: optional
  default: true
  content: If `true`, allows adding Game Center friends.
- key: GKFeatureMultiplayerGamingAllowed
  supportedOS:
    macOS:
      deprecated: '10.13'
  type: <boolean>
  presence: optional
  default: true
  content: If `true`, allows multiplayer gaming.
