title: Security Preferences
description: The payload that configures security preferences.
payload:
  payloadtype: com.apple.preference.security
  supportedOS:
    iOS:
      introduced: n/a
    macOS:
      introduced: '10.10'
      multiple: false
      devicechannel: true
      userchannel: true
      supervised: false
      requiresdep: false
      userapprovedmdm: false
      allowmanualinstall: true
      userenrollment:
        mode: forbidden
    tvOS:
      introduced: n/a
    visionOS:
      introduced: n/a
    watchOS:
      introduced: n/a
payloadkeys:
- key: dontAllowPasswordResetUI
  type: <boolean>
  presence: optional
  default: false
  content: If `true`, disables user changes to the password.
- key: dontAllowLockMessageUI
  type: <boolean>
  presence: optional
  default: false
  content: If `true`, disables user changes to the lock message.
- key: dontAllowFireWallUI
  type: <boolean>
  presence: optional
  default: false
  content: If `true`, disables user changes to the firewall settings.
