title: '802.1X: Third Active Ethernet'
description: The payload that configures the third wired, active Ethernet interface.
payload:
  payloadtype: com.apple.thirdactiveethernet.managed
  supportedOS:
    iOS:
      introduced: n/a
    macOS:
      introduced: '10.7'
      multiple: false
      devicechannel: true
      userchannel: true
      supervised: false
      requiresdep: false
      userapprovedmdm: false
      allowmanualinstall: true
      userenrollment:
        mode: allowed
    tvOS:
      introduced: n/a
    visionOS:
      introduced: n/a
    watchOS:
      introduced: n/a
payloadkeys:
- key: ANY
  type: <any>
  presence: optional
  content: Keys relevant to 802.1x configuration.  User enrollment payloads do not
    support the various proxy keys including ProxyType, ProxyServer, ProxyServerPort,
    ProxyUsername, ProxyPassword,, ProxyPACURL and ProxyPACFallbackAllowed.
notes:
- title: ''
  content: |-
    This payload's contents contain these profile-specific keys:

    - Interface (String): This payload uses the value `ThirdActiveEthernet`.
    - EAPClientConfiguration (`EAPClientConfiguration`): The dictionary that defines the enterprise profile for the network.
    - SetupModes (String): The type of connection mode, which is either "System" or "Loginwindow." "System" is the default.

     Payloads with `active` in their name apply to Ethernet interfaces that are working at the time of profile installation. If there's no active Ethernet interface working, this payload configures the interface with the highest service-order priority.
