title: 'Parental Controls: Dictionary'
description: ''
payload:
  payloadtype: com.apple.Dictionary
  supportedOS:
    iOS:
      introduced: n/a
    macOS:
      introduced: '10.7'
      multiple: false
      devicechannel: true
      userchannel: true
      requiresdep: false
      userapprovedmdm: false
      allowmanualinstall: true
      userenrollment:
        mode: forbidden
    tvOS:
      introduced: n/a
    visionOS:
      introduced: n/a
    watchOS:
      introduced: n/a
  content: Parental controls dictionary restrictions.
payloadkeys:
- key: parentalControl
  type: <boolean>
  presence: required
  content: If 'true', enables parental controls dictionary restrictions.
