title: System Preferences
description: The payload that configures the preference panes.
payload:
  payloadtype: com.apple.systempreferences
  supportedOS:
    iOS:
      introduced: n/a
    macOS:
      introduced: '10.7'
      deprecated: '13.0'
      multiple: false
      devicechannel: true
      userchannel: true
      supervised: false
      requiresdep: false
      userapprovedmdm: false
      allowmanualinstall: true
      userenrollment:
        mode: forbidden
    tvOS:
      introduced: n/a
    visionOS:
      introduced: n/a
    watchOS:
      introduced: n/a
  content: |-
    Hide and show individual System Preferences panes.
    The following preference pane items are no longer supported on macOS 10.14:
    • com.apple.preferences.appstore
    The following preference pane items are no longer supported on macOS 10.15:
    • com.apple.preference.ink
    • com.apple.preferences.icloud
    • com.apple.preferences.parentalcontrols
    This payload is deprecated as of macOS 13. When new restrictions become available to control functionality exposed through System Settings, those restrictions should be used instead of disabling the entire preference pane. This allows for user transparency even when the user's control has been disabled by a restriction.
    macOS 13 introduces a new DisabledSystemSettings key for controlling macOS 13 and newer System Settings extensions. However, note that System Settings extensions within the Privacy & Security section cannot be disabled. If DisabledSystemSettings is not provided, the system will attempt to honor the EnabledPreferencePanes and DisabledPreferencePanes by mapping the old preference pane value to one or more new settings extension values whose content was wholly contained in the old preference pane value.
payloadkeys:
- key: EnabledPreferencePanes
  type: <array>
  presence: optional
  content: The list of enabled System Preferences panes.
  subkeys: &id001
  - key: PreferencePanes
    type: <string>
    presence: optional
    rangelist:
    - com.apple.ClassroomSettings
    - com.apple.Localization
    - com.apple.preference.datetime
    - com.apple.preference.desktopscreeneffect
    - com.apple.preference.digihub.discs
    - com.apple.preference.displays
    - com.apple.preference.dock
    - com.apple.preference.energysaver
    - com.apple.preference.expose
    - com.apple.preference.general
    - com.apple.preference.ink
    - com.apple.preference.keyboard
    - com.apple.preference.mouse
    - com.apple.preference.network
    - com.apple.preference.notifications
    - com.apple.preference.printfax
    - com.apple.preference.screentime
    - com.apple.preference.security
    - com.apple.preference.sidecar
    - com.apple.preference.sound
    - com.apple.preference.speech
    - com.apple.preference.spotlight
    - com.apple.preference.startupdisk
    - com.apple.preference.trackpad
    - com.apple.preference.universalaccess
    - com.apple.preferences.AppleIDPrefPane
    - com.apple.preferences.appstore
    - com.apple.preferences.Bluetooth
    - com.apple.preferences.configurationprofiles
    - com.apple.preferences.extensions
    - com.apple.preferences.FamilySharingPrefPane
    - com.apple.preferences.icloud
    - com.apple.preferences.internetaccounts
    - com.apple.preferences.parentalcontrols
    - com.apple.preferences.password
    - com.apple.preferences.sharing
    - com.apple.preferences.softwareupdate
    - com.apple.preferences.users
    - com.apple.preferences.wallet
    - com.apple.prefpanel.fibrechannel
    - com.apple.prefs.backup
    - com.apple.Xsan
- key: DisabledPreferencePanes
  type: <array>
  presence: optional
  content: The list of disabled System Preferences panes.
  subkeys: *id001
- key: DisabledSystemSettings
  supportedOS:
    macOS:
      introduced: '13.0'
  type: <array>
  presence: optional
  content: |-
    The list of disabled System Settings extensions. All other items will be enabled. When `DisabledSystemSettings` is specified, the device ignores `DisabledPreferencePanes` and `EnabledPreferencePanes`.

    > Note:
    > A given System Settings extension can supply more than one section in System Settings; disabling such an extension disables all sections it supplies.
  subkeys:
  - key: SettingsExtensions
    type: <string>
    presence: optional
    rangelist:
    - com.apple.Accessibility-Settings.extension
    - com.apple.AirDrop-Handoff-Settings.extension
    - com.apple.Battery-Settings.extension
    - com.apple.BluetoothSettings
    - com.apple.CD-DVD-Settings.extension
    - com.apple.ClassKit-Settings.extension
    - com.apple.Classroom-Settings.extension
    - com.apple.ControlCenter-Settings.extension
    - com.apple.Date-Time-Settings.extension
    - com.apple.Desktop-Settings.extension
    - com.apple.Displays-Settings.extension
    - com.apple.ExtensionsPreferences
    - com.apple.Family-Settings.extension
    - com.apple.Focus-Settings.extension
    - com.apple.Game-Center-Settings.extension
    - com.apple.Game-Controller-Settings.extension
    - com.apple.HeadphoneSettings
    - com.apple.Internet-Accounts-Settings.extension
    - com.apple.Keyboard-Settings.extension
    - com.apple.Localization-Settings.extension
    - com.apple.Lock-Screen-Settings.extension
    - com.apple.LoginItems-Settings.extension
    - com.apple.Mouse-Settings.extension
    - com.apple.Network-Settings.extension
    - com.apple.NetworkExtensionSettingsUI.NESettingsUIExtension
    - com.apple.Notifications-Settings.extension
    - com.apple.Passwords-Settings.extension
    - com.apple.Print-Scan-Settings.extension
    - com.apple.Screen-Time-Settings.extension
    - com.apple.ScreenSaver-Settings.extension
    - com.apple.Sharing-Settings.extension
    - com.apple.Siri-Settings.extension
    - com.apple.Software-Update-Settings.extension
    - com.apple.Sound-Settings.extension
    - com.apple.Startup-Disk-Settings.extension
    - com.apple.Time-Machine-Settings.extension
    - com.apple.Touch-ID-Settings.extension
    - com.apple.Trackpad-Settings.extension
    - com.apple.Transfer-Reset-Settings.extension
    - com.apple.Users-Groups-Settings.extension
    - com.apple.WalletSettingsExtension
    - com.apple.Wallpaper-Settings.extension
    - com.apple.settings.Storage
    - com.apple.systempreferences.AppleIDSettings
    - com.apple.wifi-settings-extension
