title: File Provider
description: The payload that configures file provider settings.
payload:
  payloadtype: com.apple.fileproviderd
  supportedOS:
    iOS:
      introduced: n/a
    macOS:
      introduced: '11.0'
      multiple: false
      devicechannel: true
      userchannel: true
      supervised: false
      requiresdep: false
      userapprovedmdm: true
      allowmanualinstall: false
      userenrollment:
        mode: forbidden
    tvOS:
      introduced: n/a
    visionOS:
      introduced: n/a
    watchOS:
      introduced: n/a
payloadkeys:
- key: AllowManagedFileProvidersToRequestAttribution
  type: <boolean>
  presence: optional
  default: false
  content: If `true`, enables file providers access to the path of the requesting
    process.
- key: ManagementAllowsKnownFolderSyncing
  supportedOS:
    macOS:
      introduced: '15.2'
      devicechannel: true
      userchannel: false
  type: <boolean>
  presence: optional
  default: true
  content: If `false`, the device prevents the File Provider extension from using
    desktop and documents synchronization in any app. This does not impact the ability
    for apps to utilize the File Provider extension for file and folder syncing with
    remote storage.
- key: ManagementKnownFolderSyncingAllowList
  supportedOS:
    macOS:
      introduced: '15.2'
      devicechannel: true
      userchannel: false
  type: <array>
  presence: optional
  content: An array of strings representing the composed identifiers of apps. The
    device allows the corresponding apps to use File Provider extension desktop and
    documents synchronization. If present, and `ManagementAllowsKnownFolderSyncing`
    is set to `true`, the device allows only the apps in this list to use desktop
    and documents synchronization. This key is ignored if `ManagementAllowsKnownFolderSyncing`
    is set to `false`. This setting does not impact the ability for apps to use File
    Provider extension volume access. The format of the app identifiers is "Bundle-ID
    (Team-ID)", for example `com.example.app (ABCD1234)`.
  subkeys:
  - key: AllowListItem
    type: <string>
    presence: required
    content: A composed app identifier. The format is "Bundle.Identifier (TeamIdentifier)".
