title: Global Preferences
description: The payload to configure global preferences.
payload:
  payloadtype: .GlobalPreferences
  supportedOS:
    iOS:
      introduced: n/a
    macOS:
      introduced: '10.7'
      multiple: false
      devicechannel: true
      userchannel: true
      supervised: false
      requiresdep: false
      userapprovedmdm: false
      allowmanualinstall: true
      userenrollment:
        mode: forbidden
    tvOS:
      introduced: n/a
    visionOS:
      introduced: n/a
    watchOS:
      introduced: n/a
  content: Global preferences on macOS
payloadkeys:
- key: MultipleSessionEnabled
  type: <boolean>
  presence: optional
  default: true
  content: If `false`, disables fast user switching.
- key: com.apple.autologout.AutoLogOutDelay
  type: <real>
  presence: optional
  content: The `autologout` delay, in seconds. A value of `0` means `autologout` is
    off. In some cases, this delay may be restricted to values between 5 minutes and
    24 hours.
