title: 'Login Window: Login Items'
description: The payload that configures login behavior.
payload:
  payloadtype: loginwindow
  supportedOS:
    iOS:
      introduced: n/a
    macOS:
      introduced: '10.7'
      multiple: false
      devicechannel: true
      userchannel: false
      requiresdep: false
      userapprovedmdm: false
      allowmanualinstall: true
      userenrollment:
        mode: forbidden
    tvOS:
      introduced: n/a
    visionOS:
      introduced: n/a
    watchOS:
      introduced: n/a
  content: This payload handles login items management.
payloadkeys:
- key: DisableLoginItemsSuppression
  supportedOS:
    macOS:
      introduced: all
  type: <boolean>
  presence: optional
  default: false
  content: If `true`, the system prevents the user from disabling login item launches
    by using the Shift key.
