title: Credential:User Name and Password
description: A reference to data describing a credential representing a user name
  and password. Note that this should always be considered as security sensitive data.
payload:
  declarationtype: com.apple.asset.credential.userpassword
  supportedOS:
    iOS:
      introduced: '15.0'
    macOS:
      introduced: '13.0'
    tvOS:
      introduced: '16.0'
payloadkeys:
- key: Reference
  type: <dictionary>
  presence: required
  content: The reference to the credential.
  subkeys:
  - key: DataURL
    type: <string>
    presence: required
    content: The URL that hosts the credential data. The URL must start with 'https://'.
  - key: ContentType
    type: <string>
    presence: required
    content: The media type that describes the data.
  - key: Size
    type: <integer>
    presence: required
    content: The size of the data at the 'DataURL'. Use this value to verify that
      the returned data is the expected data. Use this value to detect when the data
      changes.
  - key: Hash-SHA-256
    type: <string>
    presence: required
    content: |-
      A SHA-256 hash of the data at the 'DataURL'. Use this value to verify that the returned data is the expected data. Use this value to detect when the data changes.
      If 'Size' is '0', clients need to ignore this value or set it to an empty string.
