title: Asset:Credential Certificate
description: 'A reference to a PKCS #1 or PEM encoded certificate.'
payload:
  declarationtype: com.apple.asset.credential.certificate
  supportedOS:
    iOS:
      introduced: '17.0'
    macOS:
      introduced: '14.0'
    tvOS:
      introduced: '17.0'
    visionOS:
      introduced: '1.1'
    watchOS:
      introduced: '10.0'
payloadkeys:
- key: Reference
  type: <dictionary>
  asset-content-types:
  - application/pkcs1
  - application/pem
  presence: required
  content: The external reference. Ensure that the asset data uses a media type of
    `application/pkcs1` or `application/pem` to correctly identify the type of encoded
    certificate. If the asset data includes a `ContentType` sub-key, set it to the
    corresponding media type.
  subkeys:
  - key: DataURL
    type: <string>
    presence: required
    content: The URL to retrieve data, which needs to start with `https://`.
  - key: ContentType
    type: <string>
    presence: optional
    content: The media type that describes the data. If present, the system checks
      the actual media type of the downloaded data, and an error occurs if the values
      don't match.
  - key: Size
    type: <integer>
    presence: optional
    content: The size of the data. Set the size to `0` if there's no expectation of
      a response body. If present, the system checks the actual size of the downloaded
      data, and an error occurs if the values don't match.
  - key: Hash-SHA-256
    type: <string>
    presence: optional
    content: A SHA-256 hash of the data stored at the `DataURL`. Don't set this value
      if `Size` is `0` as the client ignores it. However, if present, the system checks
      the actual hash of the downloaded data, and an error occurs if the values don't
      match.
- key: Authentication
  type: <dictionary>
  presence: optional
  content: The server authentication details.
  subkeys:
  - key: Type
    type: <string>
    presence: required
    rangelist:
    - MDM
    - None
    content: |-
      The type of authentication, which has these allowed values:
      - `MDM`: A request that uses MDM semantics, which includes the device-identity certificate, and any user authentication. This is equivalent to an MDM request made to the `CheckInURL` or `ServerURL`. This option is only available through declarative device management.
      - `None`: A standard GET request.
