title: Asset:Data
description: A reference to arbitrary data with a specific media type.
payload:
  declarationtype: com.apple.asset.data
  supportedOS:
    iOS:
      introduced: '17.0'
    macOS:
      introduced: '14.0'
    tvOS:
      introduced: '17.0'
    watchOS:
      introduced: '10.0'
payloadkeys:
- key: Reference
  type: <dictionary>
  presence: required
  content: The external reference.
  subkeys:
  - key: DataURL
    type: <string>
    presence: required
    content: The URL that hosts the credential data. The URL must start with 'https://'.
  - key: ContentType
    type: <string>
    presence: optional
    content: The media type that describes the data.
  - key: Size
    type: <integer>
    presence: optional
    content: The size of the data at the 'DataURL'. Use this value to verify that
      the returned data is the expected data. Use this value to detect when the data
      changes.
  - key: Hash-SHA-256
    type: <string>
    presence: optional
    content: |-
      A SHA-256 hash of the data at the 'DataURL'. Use this value to verify that the returned data is the expected data. Use this value to detect when the data changes.
      If 'Size' is '0', clients need to ignore this value or set it to an empty string.
- key: Authentication
  type: <dictionary>
  presence: optional
  content: The server authentication details.
  subkeys:
  - key: Type
    type: <string>
    presence: required
    rangelist:
    - MDM
    - None
    content: |-
      Type of authentication:
      * MDM - a request using MDM semantics (includes the device identity certificate, and any user authentication). Equivalent to an MDM request made to the CheckInURL or ServerURL. This option can only be used when using declarative device management.
      * None - a standard GET request is carried out.
