title: Asset:User Identity
description: User identity data.
payload:
  declarationtype: com.apple.asset.useridentity
  supportedOS:
    iOS:
      introduced: '15.0'
    macOS:
      introduced: '13.0'
    tvOS:
      introduced: '16.0'
    watchOS:
      introduced: '10.0'
payloadkeys:
- key: FullName
  title: Full Name
  type: <string>
  presence: optional
  content: The user's full name.
- key: EmailAddress
  title: Email Address
  type: <string>
  presence: optional
  content: The email address of the user.
