title: Status Report
description: Status sent by the client.
payload:
  requesttype: StatusReport
  supportedOS:
    iOS:
      introduced: '15.0'
    macOS:
      introduced: '13.0'
    tvOS:
      introduced: '16.0'
    watchOS:
      introduced: '10.0'
payloadkeys:
- key: StatusItems
  title: Status Items
  type: <dictionary>
  presence: required
  content: The status items for this report.
- key: Errors
  title: Errors
  type: <array>
  presence: required
  content: An array of errors for this status report.
  subkeys:
  - key: _Errors
    title: Error
    type: <dictionary>
    content: Error information for a status item that cannot be returned.
    subkeys:
    - key: StatusItem
      title: Status Item
      type: <string>
      presence: required
      content: The status item that this error pertains to.
    - key: Reasons
      title: Status Reasons
      type: <array>
      presence: optional
      content: An array of reasons for the error.
      subkeytype: StatusReason
      subkeys:
      - key: _Reasons
        title: Status Reason
        type: <dictionary>
        content: Information about a status error.
        subkeytype: StatusReason
        subkeys:
        - key: Code
          title: Error Code
          type: <string>
          presence: required
          content: The error code for this error.
        - key: Description
          title: Error Description
          type: <string>
          presence: optional
          content: The description for this error.
        - key: Details
          title: Error Details
          type: <dictionary>
          presence: optional
          content: A dictionary that contains further details about this error.
- key: FullReport
  title: Full Report
  supportedOS:
    iOS:
      introduced: '17.0'
    macOS:
      introduced: '14.0'
    tvOS:
      introduced: '17.0'
  type: <boolean>
  presence: optional
  default: false
  content: When set to "true", this indicates that the status report contains the
    full set of current status, and is not an incremental report. This will include
    the full set of items in any status array item (not just the changes). Servers
    can use this to replace their entire set of status for the device, rather than
    do incremental update processing. Devices will set this to "true" when sending
    a "safety sync" status report, which is typically sent every 24 hours or so.
