title: Certificate List Command
description: This command allows the server to retrieve the list of installed certificates
  on the device. The command requires that the server has the Inspect Profile Manifest
  privilege. For userenrollment, this request will limit to certificates pushed via
  MDM. Starting with iOS 15.4, the CertificateList command will return a Not Now response
  prior to the first time a passcode-protected device is unlocked after boot. Between
  iOS 15.0 and iOS 15.4, devices in that state did not respond with Not Now, but some
  identity certificates may not have been reported in the response.
payload:
  requesttype: CertificateList
  supportedOS:
    iOS:
      introduced: '4.0'
      accessrights: AllowInspection
      supervised: false
      requiresdep: false
      sharedipad:
        mode: allowed
        devicechannel: true
        userchannel: false
      userenrollment:
        mode: allowed
    macOS:
      introduced: '10.7'
      accessrights: AllowInspection
      devicechannel: true
      userchannel: true
      requiresdep: false
      userenrollment:
        mode: allowed
    tvOS:
      introduced: '9.0'
      accessrights: AllowInspection
      supervised: false
    visionOS:
      introduced: '1.1'
      accessrights: AllowInspection
      supervised: false
      requiresdep: false
      userenrollment:
        mode: allowed
    watchOS:
      introduced: '10.0'
      accessrights: AllowInspection
      supervised: false
  content: |-
    This command allows the server to retrieve the list of installed certificates on the device. The command requires that the server has the Inspect Profile Manifest privilege.
    For userenrollment, this request will limit to certificates pushed via MDM.
payloadkeys:
- key: ManagedOnly
  supportedOS:
    iOS:
      introduced: '13.0'
    macOS:
      introduced: '10.15'
    tvOS:
      introduced: '13.0'
  type: <boolean>
  presence: optional
  default: false
  content: If 'true', only include certificates that MDM installed or that are in
    the same profile as the MDM payload. User-enrolled devices ignore this value and
    always only include managed certificates. This value is available in iOS 13 and
    later, macOS 10.15 and later, and tvOS 13 and later.
responsekeys:
- key: CertificateList
  type: <array>
  presence: required
  content: An array of certificate list items that describes each certificate.
  subkeys:
  - key: CertificateListItem
    type: <dictionary>
    subkeys:
    - key: CommonName
      type: <string>
      presence: required
      content: The certificate's common name.
    - key: IsIdentity
      type: <boolean>
      presence: required
      content: If 'true', this is an identity certificate.
    - key: Data
      type: <data>
      presence: required
      content: The certificate in DER-encoded X.509 format.
