title: Declarative Management Command
description: Enable your server to support declarative management or trigger a declarative
  management synchronization operation on the device.
payload:
  requesttype: DeclarativeManagement
  supportedOS:
    iOS:
      introduced: '15.0'
      supervised: false
      requiresdep: false
      sharedipad:
        mode: allowed
        devicechannel: true
        userchannel: true
      userenrollment:
        mode: allowed
    macOS:
      introduced: '13.0'
      devicechannel: true
      userchannel: true
      supervised: false
      requiresdep: false
      userenrollment:
        mode: allowed
    tvOS:
      introduced: '16.0'
      supervised: false
      requiresdep: false
    visionOS:
      introduced: '1.1'
      supervised: false
      requiresdep: false
      userenrollment:
        mode: allowed
    watchOS:
      introduced: '10.0'
      supervised: false
  content: This command allows the server to turn on the declarative management engine
    on the device (the first time it is used), or to trigger a declarative management
    synchronization operation.
payloadkeys:
- key: Data
  type: <data>
  presence: optional
  content: The base64-encoded declarative management JSON request using a `TokensResponse`.
notes:
- title: ''
  content: The server uses this command to turn on the declarative management engine
    on the device the first time the server sends it. Subsequent commands trigger
    a declarative management synchronization operation.
