title: Declarative Management Command
description: This command allows the server to turn on the Declarative Management
  engine on the device (the first time it is used), or to trigger a Declarative Management
  synchronization operation.
payload:
  requesttype: DeclarativeManagement
  supportedOS:
    iOS:
      introduced: '15.0'
      supervised: false
      requiresdep: false
      sharedipad:
        mode: allowed
        devicechannel: true
        userchannel: true
      userenrollment:
        mode: allowed
    macOS:
      introduced: '13.0'
      devicechannel: true
      userchannel: true
      supervised: false
      requiresdep: false
      userenrollment:
        mode: allowed
    tvOS:
      introduced: '16.0'
      supervised: false
      requiresdep: false
    watchOS:
      introduced: '10.0'
      supervised: false
  content: This command allows the server to turn on the Declarative Management engine
    on the device (the first time it is used), or to trigger a Declarative Management
    synchronization operation.
payloadkeys:
- key: Data
  type: <data>
  presence: optional
  content: The base64-encoded Declarative Management JSON request using a TokensResponse.
