title: Activation Lock Bypass Code Command
description: Get the code to bypass Activation Lock on a device.
payload:
  requesttype: ActivationLockBypassCode
  supportedOS:
    iOS:
      introduced: '7.1'
      accessrights: None
      supervised: true
      requiresdep: false
      sharedipad:
        mode: forbidden
      userenrollment:
        mode: forbidden
    macOS:
      introduced: '10.15'
      accessrights: None
      devicechannel: true
      userchannel: false
      supervised: true
      requiresdep: false
      userenrollment:
        mode: forbidden
    tvOS:
      introduced: n/a
    visionOS:
      introduced: '2.0'
      accessrights: None
      supervised: true
      requiresdep: false
      userenrollment:
        mode: forbidden
    watchOS:
      introduced: n/a
  content: Retrieves the Activation Lock bypass code from the device. This bypass
    code is only available for 15 days after supervision.
responsekeys:
- key: ActivationLockBypassCode
  type: <string>
  presence: required
  content: The Activation Lock bypass code if it's available.
notes:
- title: ''
  content: |-
    This command allows organizations to retrieve the device's bypass code. Organizations can use the bypass code to remove the Activation Lock from supervised devices prior to device activation without knowing the user's personal Apple Account and password.

    Supervised devices generate a device-specific Activation Lock bypass code. The activation server verifies this code to bypass Activation Lock on the device. For more information, see `Creating and Using Bypass Codes`.

    A device creates a new bypass code when:

    - Setting up the device the first time.
    - Erasing and not restoring the device from a backup.
    - Erasing and restoring the device from a backup from a different device.
