title: Refresh Cellular Plans Command
description: Query a carrier URL for active eSIM cellular-plan profiles on a device.
payload:
  requesttype: RefreshCellularPlans
  supportedOS:
    iOS:
      introduced: '13.0'
      accessrights: None
      supervised: false
      requiresdep: false
      sharedipad:
        mode: allowed
        devicechannel: true
        userchannel: false
      userenrollment:
        mode: forbidden
    macOS:
      introduced: n/a
    tvOS:
      introduced: n/a
    visionOS:
      introduced: n/a
    watchOS:
      introduced: n/a
  content: |-
    Instructs the device to query for active cellular plan eSIM "profiles" (not a profile in the MDM sense)
    at the designated carrier eSIM server URL. This command is only supported on cellular devices, and only
    a subset of those devices support eSIM configuration management. (Need details from CoreTelephony.)
payloadkeys:
- key: eSIMServerURL
  type: <string>
  presence: required
  content: The carrier's eSIM server URL to query. Obtain this URL from each carrier
    separately.
notes:
- title: Error codes
  content: |-
    An error response uses one of the following error codes:

    - `36001`: Unable to communicate with the cellular software stack.
    - `36002`: The hardware doesn't support this command.
    - `36003`: The cellular stack was unable to perform the request. This error can also occur if the cellular stack is busy, in which case, retrying the command later may resolve the issue.
