title: Device Erase Command
description: This command allows the server to remotely erase the device. This command
  requires the Device Erase right.
payload:
  requesttype: EraseDevice
  supportedOS:
    iOS:
      introduced: '4.0'
      accessrights: AllowDeviceErase
      supervised: false
      requiresdep: false
      sharedipad:
        mode: allowed
        devicechannel: true
        userchannel: false
      userenrollment:
        mode: forbidden
    macOS:
      introduced: '10.7'
      accessrights: AllowDeviceErase
      devicechannel: true
      userchannel: false
      requiresdep: false
      userenrollment:
        mode: forbidden
    tvOS:
      introduced: '10.2'
      accessrights: AllowDeviceErase
      supervised: false
  content: This command allows the server to remotely erase the device. This command
    requires the Device Erase right.
payloadkeys:
- key: PreserveDataPlan
  supportedOS:
    iOS:
      introduced: '11.0'
    macOS:
      introduced: n/a
    tvOS:
      introduced: n/a
  type: <boolean>
  presence: optional
  default: false
  content: If 'true', preserve the data plan on an iPhone or iPad with eSIM functionality,
    if one exists. This value is available in iOS 11 and later.
- key: DisallowProximitySetup
  supportedOS:
    iOS:
      introduced: '11.3'
      sharedipad:
        mode: forbidden
    macOS:
      introduced: n/a
    tvOS:
      introduced: n/a
  type: <boolean>
  presence: optional
  default: false
  content: If 'true', disable Proximity Setup on the next reboot and skip the pane
    in Setup Assistant. This value is available in iOS 11 and later. Prior to iOS
    14, don't use this option with any other option.
- key: PIN
  supportedOS:
    iOS:
      introduced: n/a
    macOS:
      introduced: '10.8'
    tvOS:
      introduced: n/a
  type: <string>
  presence: optional
  content: The six-character PIN for Find My. This value is available in macOS 10.8
    and later.
- key: ObliterationBehavior
  supportedOS:
    iOS:
      introduced: n/a
    macOS:
      introduced: '12.0'
    tvOS:
      introduced: n/a
  type: <string>
  presence: optional
  rangelist:
  - Default
  - DoNotObliterate
  - ObliterateWithWarning
  - Always
  content: |-
    This key defines the fallback behavior for erasing a device.
    In macOS 12 and later, this command uses Erase All Content and Settings (EACS) on Mac computers with the Apple M1 chip or the Apple T2 Security Chip. On those devices, if EACS can't run, the device can use obliteration (macOS 11.x behavior). This key has no effect on machines prior to the T2 chip. For a list of supported macs, see Mac models with the Apple T2 Security Chip <https://support.apple.com/en-us/HT208862>.
    Upon receiving this command, the device performs preflight checks to determine if the device is in a state that allows EACS. The 'status' of the EraseDeviceResponse is either 'Acknowledged' or 'Error'.
    The following values define the device's fallback behavior:

    'DoNotObliterate':
    If EACS preflight fails, the device responds to the server with an 'Error' status and doesn't attempt to erase itself.
    If EACS preflight succeeds but EACS fails, then the device doesn't attempt to erase itself.

    'ObliterateWithWarning':
    If EACS preflight fails, the device responds with an 'Acknowledged' status and then attempts to erase itself.
    If EACS preflight succeeds but EACS fails, then the device attempts to erase itself.

    'Default':
    If EACS preflight fails, the device responds to the server with an 'Error' status and then attempts to erase itself.
    If EACS preflight succeeds but EACS fails, then the device attempts to erase itself.
