title: Device Location Command
description: Request the location of a device when in Lost Mode.
payload:
  requesttype: DeviceLocation
  supportedOS:
    iOS:
      introduced: '9.3'
      accessrights: None
      supervised: true
      requiresdep: false
      sharedipad:
        mode: allowed
        devicechannel: true
        userchannel: false
      userenrollment:
        mode: forbidden
    macOS:
      introduced: n/a
    tvOS:
      introduced: n/a
    visionOS:
      introduced: n/a
    watchOS:
      introduced: n/a
responsekeys:
- key: Latitude
  type: <real>
  presence: required
  content: The latitude of the device's location.
- key: Longitude
  type: <real>
  presence: required
  content: The longitude of the device's location.
- key: HorizontalAccuracy
  supportedOS:
    iOS:
      introduced: '10.3'
  type: <real>
  presence: required
  content: The radius of uncertainty for the location in meters, which is a negative
    value if the horizontal accuracy is unknown.
- key: VerticalAccuracy
  supportedOS:
    iOS:
      introduced: '10.3'
  type: <real>
  presence: required
  content: The accuracy of the altitude value in meters, which is a negative value
    if the vertical accuracy is unknown.
- key: Altitude
  supportedOS:
    iOS:
      introduced: '10.3'
  type: <real>
  presence: required
  content: The altitude of the device's location, which is a negative value if the
    altitude is unknown.
- key: Speed
  supportedOS:
    iOS:
      introduced: '10.3'
  type: <real>
  presence: required
  content: The speed of the device in meters per second, which is a negative value
    if the speed is unknown.
- key: Course
  supportedOS:
    iOS:
      introduced: '10.3'
  type: <real>
  presence: required
  content: The direction the device is traveling, which is a negative value if the
    course is unknown.
- key: Timestamp
  supportedOS:
    iOS:
      introduced: '10.3'
  type: <string>
  presence: required
  content: The RFC 3339 timestamp of when the server determines the location of the
    device.
notes:
- title: ''
  content: |-
    A device responds with error codes:

    - `12067`: If it isn't in Lost mode.
    - `12068`: If its location is unknown.
    - `12078`: If the command is invalid while in Lost Mode.

    Refer to the following sections to determine supported channels and requirements, and to see an example request and response.
