title: Enable Lost Mode Command
description: Enable Lost Mode on a device, which provides a message and phone number
  on the Lock Screen.
payload:
  requesttype: EnableLostMode
  supportedOS:
    iOS:
      introduced: '9.3'
      accessrights: None
      supervised: true
      requiresdep: false
      sharedipad:
        mode: allowed
        devicechannel: true
        userchannel: false
      userenrollment:
        mode: forbidden
    macOS:
      introduced: n/a
    tvOS:
      introduced: n/a
    visionOS:
      introduced: n/a
    watchOS:
      introduced: n/a
  content: This command allows the server to put the device in MDM lost mode, with
    a message, phone number, and footnote text. A message or phone number must be
    provided.
payloadkeys:
- key: Message
  type: <string>
  presence: optional
  content: If present, the device displays this text on the Lock Screen. You must
    provide this value if you don't provide a value for `PhoneNumber`.
- key: PhoneNumber
  type: <string>
  presence: optional
  content: If present, the device displays this phone number on the Lock Screen. You
    must provide this value if you don't provide a value for `Message`.
- key: Footnote
  type: <string>
  presence: optional
  content: If present, the device displays this text at the bottom of the Lock Screen.
notes:
- title: ''
  content: |-
    While in Lost Mode, a device responds to invalid commands with error code `12078`.

    Refer to the following sections to determine supported channels and requirements, and to see an example request and response.
