title: Device Information Command
description: This command allows the server to query for specific device information.
  It's supported in the user channel.
payload:
  requesttype: DeviceInformation
  supportedOS:
    iOS:
      introduced: '4.0'
      accessrights: Special Case
      supervised: false
      requiresdep: false
      sharedipad:
        mode: allowed
        devicechannel: true
        userchannel: true
      userenrollment:
        mode: allowed
    macOS:
      introduced: '10.7'
      accessrights: Special Case
      devicechannel: true
      userchannel: true
      requiresdep: false
      userenrollment:
        mode: allowed
    tvOS:
      introduced: '6.0'
      accessrights: Special Case
      supervised: false
    watchOS:
      introduced: '10.0'
      accessrights: Special Case
      supervised: false
  content: This command allows the server to query for specific device information.
    It's supported in the user channel.
payloadkeys:
- key: Queries
  type: <array>
  presence: required
  content: An array of query dictionaries to get information about a device.
  subkeys:
  - key: QueriesItem
    type: <string>
    subkeys:
    - key: UDID
      supportedOS:
        iOS:
          accessrights: n/a
          userenrollment:
            mode: forbidden
        macOS:
          accessrights: n/a
          userenrollment:
            mode: forbidden
        tvOS:
          accessrights: n/a
        watchOS:
          accessrights: n/a
      type: <string>
      content: The key to get the unique identifier of the device.
    - key: ProvisioningUDID
      supportedOS:
        iOS:
          introduced: n/a
        macOS:
          introduced: '11.3'
          accessrights: n/a
          userenrollment:
            mode: forbidden
        tvOS:
          introduced: n/a
        watchOS:
          introduced: n/a
      type: <string>
      content: The device identifier for provisioning profiles. This value differs
        from the UDID for Apple silicon. Available in macOS 11.3 and later.
    - key: OrganizationInfo
      supportedOS:
        iOS:
          introduced: '7.0'
          accessrights: n/a
        macOS:
          introduced: '10.11'
        tvOS:
          introduced: '9.0'
          accessrights: n/a
        watchOS:
          accessrights: n/a
      type: <string>
      content: The key to get the contents of SettingsCommand.Command.Settings.OrganizationInfo.OrganizationInfo.
    - key: MDMOptions
      supportedOS:
        iOS:
          introduced: '7.0'
          accessrights: n/a
        macOS:
          introduced: '11.0'
        tvOS:
          introduced: '9.0'
          accessrights: n/a
        watchOS:
          introduced: '10.0'
      type: <string>
      content: The key to get the contents of SettingsCommand.Command.Settings.MDMOptions.MDMOptions.
    - key: LastCloudBackupDate
      supportedOS:
        iOS:
          introduced: '8.0'
          userenrollment:
            mode: forbidden
        macOS:
          introduced: n/a
        tvOS:
          introduced: n/a
        watchOS:
          introduced: n/a
      type: <string>
      content: The key to get the date of the most recent iCloud backup. This value
        is available in iOS 8 and later.
    - key: AwaitingConfiguration
      supportedOS:
        iOS:
          introduced: '9.0'
          accessrights: n/a
          userenrollment:
            mode: forbidden
        macOS:
          introduced: '10.11'
          accessrights: n/a
          userenrollment:
            mode: forbidden
        tvOS:
          introduced: '10.2'
          accessrights: n/a
        watchOS:
          accessrights: n/a
      type: <string>
      content: If true from device channel, device is still waiting for a DeviceConfigured
        message from MDM to continue through Setup Assistant. If true from user channel
        (Shared iPad only), device is still waiting for a UserConfigured message from
        MDM to continue through Setup Assistant and finish login. Always available.
    - key: iTunesStoreAccountIsActive
      supportedOS:
        iOS:
          introduced: '7.0'
          accessrights: AllowAppInstallation
          userenrollment:
            mode: forbidden
        macOS:
          introduced: '10.9'
          accessrights: AllowAppInstallation
          userenrollment:
            mode: forbidden
        tvOS:
          introduced: '9.0'
          accessrights: AllowAppInstallation
        watchOS:
          accessrights: AllowAppInstallation
      type: <string>
      content: The key to determine if an iTunes Store account is active. This value
        requires the App Installation access right.
    - key: iTunesStoreAccountHash
      supportedOS:
        iOS:
          introduced: '8.0'
          accessrights: AllowAppInstallation
          userenrollment:
            mode: forbidden
        macOS:
          introduced: '10.10'
          accessrights: AllowAppInstallation
          userenrollment:
            mode: forbidden
        tvOS:
          introduced: '9.0'
          accessrights: AllowAppInstallation
        watchOS:
          accessrights: AllowAppInstallation
      type: <string>
      content: The key to get a hash of the logged-in iTunes Store account. Also see
        GetVppUserRequest. This value requires the App Installation access right.
    - key: DeviceName
      supportedOS:
        iOS:
          accessrights: AllowQueryDeviceInformation
        macOS:
          accessrights: AllowQueryDeviceInformation
        tvOS:
          accessrights: AllowQueryDeviceInformation
        watchOS:
          accessrights: AllowQueryDeviceInformation
      type: <string>
      content: The key to get the device name. This value requires the Device Information
        access right.
    - key: OSVersion
      supportedOS:
        iOS:
          accessrights: AllowQueryDeviceInformation
        macOS:
          accessrights: AllowQueryDeviceInformation
        tvOS:
          accessrights: AllowQueryDeviceInformation
        watchOS:
          accessrights: AllowQueryDeviceInformation
      type: <string>
      content: The key to get the operating system version. This value requires the
        Device Information access right.
    - key: SupplementalOSVersionExtra
      supportedOS:
        iOS:
          introduced: '16.1'
          accessrights: AllowQueryDeviceInformation
        macOS:
          introduced: '13.0'
          accessrights: AllowQueryDeviceInformation
        tvOS:
          introduced: '16.1'
          accessrights: AllowQueryDeviceInformation
        watchOS:
          introduced: n/a
      type: <string>
      content: The key to get the OS update rapid security response version letter,
        if a rapid security response update is installed. This value requires the
        Device Information access right.
    - key: BuildVersion
      supportedOS:
        iOS:
          accessrights: AllowQueryDeviceInformation
        macOS:
          accessrights: AllowQueryDeviceInformation
        tvOS:
          accessrights: AllowQueryDeviceInformation
        watchOS:
          accessrights: AllowQueryDeviceInformation
      type: <string>
      content: The key to get the operating system version. This value requires the
        Device Information access right.
    - key: SupplementalBuildVersion
      supportedOS:
        iOS:
          introduced: '16.1'
          accessrights: AllowQueryDeviceInformation
        macOS:
          introduced: '13.0'
          accessrights: AllowQueryDeviceInformation
        tvOS:
          introduced: '16.1'
          accessrights: AllowQueryDeviceInformation
        watchOS:
          accessrights: AllowQueryDeviceInformation
      type: <string>
      content: The key to get the build version for the currently installed rapid
        security response. If there's no installed rapid security response, this value
        is the same as 'BuildVersion'. This value requires the Device Information
        access right.
    - key: ModelName
      supportedOS:
        iOS:
          accessrights: AllowQueryDeviceInformation
        macOS:
          accessrights: AllowQueryDeviceInformation
        tvOS:
          accessrights: AllowQueryDeviceInformation
        watchOS:
          accessrights: AllowQueryDeviceInformation
      type: <string>
      content: The key to get the model name; for example, iPhone. This value requires
        the Device Information access right.
    - key: Model
      supportedOS:
        iOS:
          accessrights: AllowQueryDeviceInformation
        macOS:
          accessrights: AllowQueryDeviceInformation
        tvOS:
          accessrights: AllowQueryDeviceInformation
        watchOS:
          accessrights: AllowQueryDeviceInformation
      type: <string>
      content: The key to get the model. This value requires the Device Information
        access right.
    - key: ModelNumber
      supportedOS:
        iOS:
          introduced: '16.4'
          accessrights: AllowQueryDeviceInformation
        macOS:
          introduced: '13.3'
          accessrights: AllowQueryDeviceInformation
        tvOS:
          introduced: '16.4'
          accessrights: AllowQueryDeviceInformation
        watchOS:
          introduced: n/a
      type: <string>
      content: The key to get the device's hardware model number including region
        info, for example, 'MK1A3LL/A'. This value requires the Device Information
        right, and it requires Apple silicon on macOS.
    - key: IsAppleSilicon
      supportedOS:
        iOS:
          introduced: n/a
        macOS:
          introduced: '12.0'
          accessrights: AllowQueryDeviceInformation
        tvOS:
          introduced: n/a
        watchOS:
          introduced: n/a
      type: <string>
      content: |-
        If 'true', the device is a Mac with Apple silicon (for example, an Apple M1 chip).
        Available in macOS 12 and later.
    - key: ProductName
      supportedOS:
        iOS:
          accessrights: AllowQueryDeviceInformation
        macOS:
          accessrights: AllowQueryDeviceInformation
        tvOS:
          accessrights: AllowQueryDeviceInformation
        watchOS:
          accessrights: AllowQueryDeviceInformation
      type: <string>
      content: The key to get the product name, such as iPad8,12. This value requires
        the Device Information access right.
    - key: SerialNumber
      supportedOS:
        iOS:
          accessrights: AllowQueryDeviceInformation
          userenrollment:
            mode: forbidden
        macOS:
          accessrights: AllowQueryDeviceInformation
          userenrollment:
            mode: forbidden
        tvOS:
          accessrights: AllowQueryDeviceInformation
        watchOS:
          accessrights: AllowQueryDeviceInformation
      type: <string>
      content: The key to get the serial number. This value requires the Device Information
        access right.
    - key: DeviceCapacity
      supportedOS:
        iOS:
          accessrights: AllowQueryDeviceInformation
        macOS:
          accessrights: AllowQueryDeviceInformation
        tvOS:
          introduced: n/a
        watchOS:
          accessrights: AllowQueryDeviceInformation
      type: <string>
      content: The key to get the device's total capacity. This value requires the
        Device Information access right, and is available in iOS 4 and later, and
        macOS 10.7 and later.
    - key: AvailableDeviceCapacity
      supportedOS:
        iOS:
          accessrights: AllowQueryDeviceInformation
        macOS:
          accessrights: AllowQueryDeviceInformation
        tvOS:
          introduced: n/a
        watchOS:
          accessrights: AllowQueryDeviceInformation
      type: <string>
      content: The key to get the available capacity. This value requires the Device
        Information access right, and is available in iOS 4 and later, and macOS 10.7
        and later.
    - key: IMEI
      supportedOS:
        iOS:
          deprecated: '16.0'
          accessrights: AllowQueryDeviceInformation
          userenrollment:
            mode: forbidden
        macOS:
          introduced: n/a
        tvOS:
          introduced: n/a
        watchOS:
          introduced: n/a
      type: <string>
      content: The key to get the International Mobile Equipment Identity (IMEI) number.
        This value requires the Device Information access right. It's available as
        of iOS 4 and deprecated in iOS 16.
    - key: MEID
      supportedOS:
        iOS:
          deprecated: '16.0'
          accessrights: AllowQueryDeviceInformation
          userenrollment:
            mode: forbidden
        macOS:
          introduced: n/a
        tvOS:
          introduced: n/a
        watchOS:
          introduced: n/a
      type: <string>
      content: The key to get the mobile equipment ID (MEID). This value requires
        the Device Information access right. It's available as of iOS 4 and deprecated
        in iOS 16.
    - key: ModemFirmwareVersion
      supportedOS:
        iOS:
          accessrights: AllowQueryDeviceInformation
          userenrollment:
            mode: forbidden
        macOS:
          introduced: n/a
        tvOS:
          introduced: n/a
        watchOS:
          introduced: n/a
      type: <string>
      content: The key to get the modem firmware version. This value requires the
        Device Information access right, and is available in iOS 4 and later.
    - key: CellularTechnology
      supportedOS:
        iOS:
          introduced: 4.2.6
          accessrights: AllowQueryDeviceInformation
        macOS:
          introduced: n/a
        tvOS:
          introduced: n/a
        watchOS:
          introduced: n/a
      type: <string>
      content: The key to get the cellular technology type. This value requires the
        Device Information access right, and is available in iOS 4.2.6 and later.
    - key: BatteryLevel
      supportedOS:
        iOS:
          introduced: '5.0'
          accessrights: AllowQueryDeviceInformation
        macOS:
          introduced: '13.3'
          accessrights: AllowQueryDeviceInformation
        tvOS:
          introduced: n/a
        watchOS:
          accessrights: AllowQueryDeviceInformation
      type: <string>
      content: The key to get the battery level. This value requires the Device Information
        access right, and is available in iOS 5 and later.
    - key: HasBattery
      supportedOS:
        iOS:
          introduced: n/a
        macOS:
          introduced: '13.3'
          accessrights: AllowQueryDeviceInformation
        tvOS:
          introduced: n/a
        watchOS:
          introduced: n/a
      type: <string>
      content: The key to determine whether the device has an internal battery.
    - key: IsSupervised
      supportedOS:
        iOS:
          introduced: '6.0'
          accessrights: AllowQueryDeviceInformation
        macOS:
          introduced: '10.15'
        tvOS:
          introduced: '9.0'
          accessrights: AllowQueryDeviceInformation
        watchOS:
          accessrights: AllowQueryDeviceInformation
      type: <string>
      content: The key to determine if the device is a supervised device. This value
        requires the Device Information access right, and is available in iOS 6 and
        later, macOS 10.15 and later, and tvOS 9 and later.
    - key: IsMultiUser
      supportedOS:
        iOS:
          introduced: '9.3'
          accessrights: AllowQueryDeviceInformation
        macOS:
          introduced: n/a
        tvOS:
          introduced: n/a
        watchOS:
          introduced: n/a
      type: <string>
      content: The key to determine if the device is in ephemeral multiuser mode.
        This value requires the Device Information access right, and is available
        in iOS 9.3 and later.
    - key: IsDeviceLocatorServiceEnabled
      supportedOS:
        iOS:
          introduced: '7.0'
          accessrights: AllowQueryDeviceInformation
        macOS:
          introduced: n/a
        tvOS:
          introduced: n/a
        watchOS:
          accessrights: AllowQueryDeviceInformation
      type: <string>
      content: The key to determine if a device locator service, such as Find My,
        is in an enabled state on the device. This value requires the Device Information
        access right, and is available in iOS 7 and later.
    - key: IsActivationLockEnabled
      supportedOS:
        iOS:
          introduced: '7.0'
          deprecated: '16.0'
          accessrights: AllowQueryDeviceInformation
          userenrollment:
            mode: forbidden
        macOS:
          introduced: '10.15'
          deprecated: '13.0'
          accessrights: AllowQueryDeviceInformation
          userenrollment:
            mode: forbidden
        tvOS:
          introduced: n/a
        watchOS:
          deprecated: '10.0'
          accessrights: AllowQueryDeviceInformation
      type: <string>
      content: The key to determine if Activation Lock is in an enabled state on the
        device. This value requires the Device Information access right. It's available
        as of iOS 7 and macOS 10.15, and deprecated in iOS 16 and macOS 13.
    - key: IsActivationLockSupported
      supportedOS:
        iOS:
          introduced: n/a
        macOS:
          introduced: '10.15'
          accessrights: AllowQueryDeviceInformation
          userenrollment:
            mode: forbidden
        tvOS:
          introduced: n/a
        watchOS:
          introduced: n/a
      type: <string>
      content: The key to determine if the device supports Activation Lock. Also see
        'IsActivationLockManageable' in SecurityInfoResponse.SecurityInfo.ManagementStatus.
        This value is available in macOS 10.9 and later.
    - key: IsDoNotDisturbInEffect
      supportedOS:
        iOS:
          introduced: '7.0'
          accessrights: AllowQueryDeviceInformation
          userenrollment:
            mode: forbidden
        macOS:
          introduced: n/a
        tvOS:
          introduced: n/a
        watchOS:
          accessrights: AllowQueryDeviceInformation
      type: <string>
      content: The key to determine if the device is in Do Not Disturb (DND) mode.
        This value requires the Device Information access right, and is available
        in iOS 7 and later.
    - key: DeviceID
      supportedOS:
        iOS:
          introduced: n/a
        macOS:
          introduced: n/a
        tvOS:
          introduced: '6.0'
          accessrights: AllowQueryDeviceInformation
        watchOS:
          introduced: n/a
      type: <string>
      content: The key to get the device ID. This value requires the Device Information
        access right, and is available in tvOS 6 and later.
    - key: EASDeviceIdentifier
      supportedOS:
        iOS:
          introduced: '7.0'
          accessrights: AllowQueryDeviceInformation
        macOS:
          introduced: n/a
        tvOS:
          introduced: n/a
        watchOS:
          introduced: n/a
      type: <string>
      content: The key to get the device identifier for Exchange ActiveSync (EAS).
        This value requires the Device Information access right, and is available
        in iOS 7 and later.
    - key: IsCloudBackupEnabled
      supportedOS:
        iOS:
          introduced: '7.1'
          accessrights: AllowQueryDeviceInformation
          userenrollment:
            mode: forbidden
        macOS:
          introduced: n/a
        tvOS:
          introduced: n/a
        watchOS:
          introduced: n/a
      type: <string>
      content: The key to determine if iCloud Backup is in an enabled state on the
        device. This value requires the Device Information access right, and is available
        in iOS 7.1 and later.
    - key: ActiveManagedUsers
      supportedOS:
        iOS:
          introduced: n/a
        macOS:
          introduced: '10.11'
          accessrights: AllowQueryDeviceInformation
          userchannel: false
        tvOS:
          introduced: n/a
        watchOS:
          introduced: n/a
      type: <string>
      content: The key to get an array of directory GUIDs for logged-in managed users.
        This value requires the Device Information access right, and is available
        in macOS 10.11 and later.
    - key: OSUpdateSettings
      supportedOS:
        iOS:
          introduced: n/a
        macOS:
          introduced: '10.11'
          accessrights: AllowQueryDeviceInformation
          userenrollment:
            mode: forbidden
        tvOS:
          introduced: n/a
        watchOS:
          introduced: n/a
      type: <string>
      content: The key to get the contents of DeviceInformationResponse.QueryResponses.OSUpdateSettings.
        This value requires the Device Information access right, and is available
        in macOS 10.11 and later.
    - key: LocalHostName
      supportedOS:
        iOS:
          introduced: n/a
        macOS:
          introduced: '10.11'
          accessrights: AllowQueryDeviceInformation
        tvOS:
          introduced: n/a
        watchOS:
          introduced: n/a
      type: <string>
      content: The key to get the local hostname from Bonjour. This value is available
        in macOS 10.11 and later.
    - key: HostName
      supportedOS:
        iOS:
          introduced: n/a
        macOS:
          introduced: '10.11'
          accessrights: AllowQueryDeviceInformation
        tvOS:
          introduced: n/a
        watchOS:
          introduced: n/a
      type: <string>
      content: The key to get the hostname. This value is available in macOS 10.11
        and later.
    - key: AutoSetupAdminAccounts
      supportedOS:
        iOS:
          introduced: n/a
        macOS:
          introduced: '10.11'
          accessrights: AllowQueryDeviceInformation
          requiresdep: true
          userenrollment:
            mode: forbidden
        tvOS:
          introduced: n/a
        watchOS:
          introduced: n/a
      type: <string>
      content: The key to get the contents of DeviceInformationResponse.QueryResponses.AutoSetupAdminAccountsItem,
        which Setup Assistant automatically creates during enrollment. This value
        requires the Device Information access right, and is available in macOS 10.11
        and later.
    - key: SystemIntegrityProtectionEnabled
      supportedOS:
        iOS:
          introduced: n/a
        macOS:
          introduced: '10.12'
          accessrights: AllowQueryDeviceInformation
        tvOS:
          introduced: n/a
        watchOS:
          introduced: n/a
      type: <string>
      content: The key to determine if System Integrity Protection is in an enabled
        state on the device. This value requires the Device Information access right,
        and is available in macOS 10.12 and later.
    - key: SupportsLOMDevice
      supportedOS:
        iOS:
          introduced: n/a
        macOS:
          introduced: '11.0'
          accessrights: AllowQueryDeviceInformation
        tvOS:
          introduced: n/a
        watchOS:
          introduced: n/a
      type: <string>
      content: The key to determine if the device can receive 'PowerON', 'PowerOFF',
        and 'Reset' commands from a lights-out management (LOM) controller. This query
        is available in macOS 11 and later.
    - key: IsMDMLostModeEnabled
      supportedOS:
        iOS:
          introduced: '9.3'
          accessrights: AllowQueryDeviceInformation
          userenrollment:
            mode: forbidden
        macOS:
          introduced: n/a
        tvOS:
          introduced: n/a
        watchOS:
          accessrights: AllowQueryDeviceInformation
      type: <string>
      content: The key to determine if Managed Lost Mode is in an enabled state on
        the device. This value requires the Device Information access right, and is
        available in iOS 9.3 and later.
    - key: MaximumResidentUsers
      supportedOS:
        iOS:
          introduced: '9.3'
          accessrights: AllowQueryDeviceInformation
          supervised: true
          requiresdep: true
          sharedipad:
            mode: required
            devicechannel: true
            userchannel: false
          userenrollment:
            mode: forbidden
        macOS:
          introduced: n/a
        tvOS:
          introduced: n/a
        watchOS:
          introduced: n/a
      type: <string>
      content: The key to get the maximum number of users that can use this Shared
        iPad device. Beginning with iOS 13.4, the value that returns is always '32'.
        This value requires the Device Information access right, and is available
        in iOS 9.3 and later.
    - key: EstimatedResidentUsers
      supportedOS:
        iOS:
          introduced: '14.0'
          accessrights: AllowQueryDeviceInformation
          supervised: true
          requiresdep: true
          sharedipad:
            mode: required
            devicechannel: true
            userchannel: false
          userenrollment:
            mode: forbidden
        macOS:
          introduced: n/a
        tvOS:
          introduced: n/a
        watchOS:
          introduced: n/a
      type: <string>
      content: The key to get the estimated number of users that can use this Shared
        iPad device, according to the available space of the device and each user's
        quota. This value requires the Device Information access right, and is available
        in iOS 14 and later.
    - key: QuotaSize
      supportedOS:
        iOS:
          introduced: '13.4'
          accessrights: AllowQueryDeviceInformation
          supervised: true
          requiresdep: true
          sharedipad:
            mode: required
            devicechannel: true
            userchannel: false
          userenrollment:
            mode: forbidden
        macOS:
          introduced: n/a
        tvOS:
          introduced: n/a
        watchOS:
          introduced: n/a
      type: <string>
      content: The key to get the quota size for each user on this Shared iPad device.
        This value requires the Device Information access right, and is available
        in iOS 13.4 and later.
    - key: ResidentUsers
      supportedOS:
        iOS:
          introduced: '13.4'
          accessrights: AllowQueryDeviceInformation
          supervised: true
          requiresdep: true
          sharedipad:
            mode: required
            devicechannel: true
            userchannel: false
          userenrollment:
            mode: forbidden
        macOS:
          introduced: n/a
        tvOS:
          introduced: n/a
        watchOS:
          introduced: n/a
      type: <string>
      content: The key to get the number of users currently on this Shared iPad device.
        This value requires the Device Information access right, and is available
        in iOS 13.4 and later.
    - key: UserSessionTimeout
      supportedOS:
        iOS:
          introduced: '14.5'
          accessrights: AllowQueryDeviceInformation
          supervised: true
          requiresdep: true
          sharedipad:
            mode: required
            devicechannel: true
            userchannel: false
          userenrollment:
            mode: forbidden
        macOS:
          introduced: n/a
        tvOS:
          introduced: n/a
        watchOS:
          introduced: n/a
      type: <string>
      content: The timeout interval for the user session. '0' means no timeout.
    - key: TemporarySessionTimeout
      supportedOS:
        iOS:
          introduced: '14.5'
          accessrights: AllowQueryDeviceInformation
          supervised: true
          requiresdep: true
          sharedipad:
            mode: required
            devicechannel: true
            userchannel: false
          userenrollment:
            mode: forbidden
        macOS:
          introduced: n/a
        tvOS:
          introduced: n/a
        watchOS:
          introduced: n/a
      type: <string>
      content: The timeout interval for the temporary session. '0' means no timeout.
    - key: TemporarySessionOnly
      supportedOS:
        iOS:
          introduced: '14.5'
          accessrights: AllowQueryDeviceInformation
          supervised: true
          requiresdep: true
          sharedipad:
            mode: required
            devicechannel: true
            userchannel: false
          userenrollment:
            mode: forbidden
        macOS:
          introduced: n/a
        tvOS:
          introduced: n/a
        watchOS:
          introduced: n/a
      type: <string>
      content: If 'true', the device only allows temporary sessions.
    - key: ManagedAppleIDDefaultDomains
      supportedOS:
        iOS:
          introduced: '16.0'
          accessrights: AllowQueryDeviceInformation
          supervised: true
          requiresdep: true
          sharedipad:
            mode: required
            devicechannel: true
            userchannel: false
          userenrollment:
            mode: forbidden
        macOS:
          introduced: n/a
        tvOS:
          introduced: n/a
        watchOS:
          introduced: n/a
      type: <string>
      content: |-
        The list of domains that the device suggests on the Shared iPad login screen.
        Available in iOS 16 and later.
    - key: OnlineAuthenticationGracePeriod
      supportedOS:
        iOS:
          introduced: '16.0'
          accessrights: AllowQueryDeviceInformation
          supervised: true
          requiresdep: true
          sharedipad:
            mode: required
            devicechannel: true
            userchannel: false
          userenrollment:
            mode: forbidden
        macOS:
          introduced: n/a
        tvOS:
          introduced: n/a
        watchOS:
          introduced: n/a
      type: <string>
      content: |-
        The grace period for Shared iPad online authentication (in days). 0 means the device requires online authentication for every login.
        Available in iOS 16 and later.
    - key: SkipLanguageAndLocaleSetupForNewUsers
      supportedOS:
        iOS:
          introduced: '16.2'
          accessrights: AllowQueryDeviceInformation
          supervised: true
          requiresdep: true
          sharedipad:
            mode: required
            devicechannel: true
            userchannel: false
          userenrollment:
            mode: forbidden
        macOS:
          introduced: n/a
        tvOS:
          introduced: n/a
        watchOS:
          introduced: n/a
      type: <string>
      content: The key to determine whether the system skips the language and country/region
        panes for new users on Shared iPad.
    - key: PushToken
      supportedOS:
        iOS:
          introduced: '9.3'
          accessrights: AllowQueryDeviceInformation
          sharedipad:
            devicechannel: false
          userenrollment:
            mode: forbidden
        macOS:
          introduced: '10.12'
        tvOS:
          introduced: n/a
        watchOS:
          introduced: n/a
      type: <string>
      content: The key to get the push token for the current user-channel connection.
        The MDM server ignores this query for the device channel. This value requires
        the Device Information access right, and is available in iOS 9.3 and later,
        and macOS 10.12 and later.
    - key: DiagnosticSubmissionEnabled
      supportedOS:
        iOS:
          introduced: '9.3'
          accessrights: AllowQueryDeviceInformation
        macOS:
          introduced: n/a
        tvOS:
          introduced: n/a
        watchOS:
          accessrights: AllowQueryDeviceInformation
      type: <string>
      content: The key to determine if the diagnostic submission setting is in an
        enabled state on the device. This value requires the Device Information access
        right, and is available in iOS 9.3 and later.
    - key: AppAnalyticsEnabled
      supportedOS:
        iOS:
          introduced: '9.3'
          accessrights: AllowQueryDeviceInformation
        macOS:
          introduced: n/a
        tvOS:
          introduced: n/a
        watchOS:
          accessrights: AllowQueryDeviceInformation
      type: <string>
      content: The key to determine if the device is sharing app analytics. This value
        requires the Device Information access right, and is available in iOS 4 and
        later, and macOS 10.7 and later.
    - key: TimeZone
      supportedOS:
        iOS:
          introduced: '14.0'
          accessrights: AllowQueryDeviceInformation
        macOS:
          introduced: n/a
        tvOS:
          introduced: '14.0'
          accessrights: AllowQueryDeviceInformation
        watchOS:
          accessrights: AllowQueryDeviceInformation
      type: <string>
      content: The key to get the current Internet Assigned Numbers Authority (IANA)
        time zone database name. This value requires the Device Information access
        right, and is available in iOS 14 and later, and tvOS 14 and later.
    - key: ICCID
      supportedOS:
        iOS:
          deprecated: '16.0'
          accessrights: AllowQueryNetworkInformation
          userenrollment:
            mode: forbidden
        macOS:
          introduced: n/a
        tvOS:
          introduced: n/a
        watchOS:
          introduced: n/a
      type: <string>
      content: The key to get the integrated circuit card (ICC) identifier for the
        installed SIM card. This value requires the Network Information access right.
        It's available as of iOS 4 and deprecated in iOS 16.
    - key: BluetoothMAC
      supportedOS:
        iOS:
          accessrights: AllowQueryNetworkInformation
          userenrollment:
            mode: forbidden
        macOS:
          accessrights: AllowQueryNetworkInformation
          userenrollment:
            mode: forbidden
        tvOS:
          accessrights: AllowQueryNetworkInformation
        watchOS:
          introduced: n/a
      type: <string>
      content: The key to get the Bluetooth media access control (MAC) address. This
        value requires the Network Information access right.
    - key: WiFiMAC
      supportedOS:
        iOS:
          accessrights: AllowQueryNetworkInformation
          userenrollment:
            mode: forbidden
        macOS:
          accessrights: AllowQueryNetworkInformation
          userenrollment:
            mode: forbidden
        tvOS:
          accessrights: AllowQueryNetworkInformation
        watchOS:
          accessrights: AllowQueryNetworkInformation
      type: <string>
      content: The key to get the Wi-Fi MAC address. This value requires the Network
        Information access right.
    - key: EthernetMAC
      supportedOS:
        iOS:
          introduced: n/a
        macOS:
          accessrights: AllowQueryNetworkInformation
          userenrollment:
            mode: forbidden
        tvOS:
          introduced: n/a
        watchOS:
          introduced: n/a
      type: <string>
      content: The key to get the primary Ethernet MAC address. This value requires
        the Network Information access right, and is available in macOS 10.7 and later.
    - key: CurrentCarrierNetwork
      supportedOS:
        iOS:
          deprecated: '16.0'
          accessrights: AllowQueryNetworkInformation
          userenrollment:
            mode: forbidden
        macOS:
          introduced: n/a
        tvOS:
          introduced: n/a
        watchOS:
          introduced: n/a
      type: <string>
      content: The key to get the name of the current carrier network. This value
        requires the Network Information access right. It's available as of iOS 4
        and deprecated in iOS 16.
    - key: SIMCarrierNetwork
      supportedOS:
        iOS:
          removed: '5.0'
          accessrights: AllowQueryNetworkInformation
          userenrollment:
            mode: forbidden
        macOS:
          introduced: n/a
        tvOS:
          introduced: n/a
        watchOS:
          introduced: n/a
      type: <string>
      content: Apple no longer supports this query. Use 'SubscriberCarrierNetwork'
        instead.
    - key: SubscriberCarrierNetwork
      supportedOS:
        iOS:
          introduced: '5.0'
          deprecated: '16.0'
          accessrights: AllowQueryNetworkInformation
          userenrollment:
            mode: forbidden
        macOS:
          introduced: n/a
        tvOS:
          introduced: n/a
        watchOS:
          introduced: n/a
      type: <string>
      content: The key to get the name of the home carrier network. This value requires
        the Network Information access right. It's available as of iOS 5 and deprecated
        in iOS 16.
    - key: CarrierSettingsVersion
      supportedOS:
        iOS:
          deprecated: '16.0'
          accessrights: AllowQueryNetworkInformation
          userenrollment:
            mode: forbidden
        macOS:
          introduced: n/a
        tvOS:
          introduced: n/a
        watchOS:
          introduced: n/a
      type: <string>
      content: The key to get the version of the carrier settings. This value requires
        the Network Information access right. It's available as of iOS 4 and deprecated
        in iOS 16.
    - key: PhoneNumber
      supportedOS:
        iOS:
          deprecated: '16.0'
          accessrights: AllowQueryNetworkInformation
          userenrollment:
            mode: forbidden
        macOS:
          introduced: n/a
        tvOS:
          introduced: n/a
        watchOS:
          introduced: n/a
      type: <string>
      content: The key to get the raw phone number, without punctuation, and including
        the country code. This value requires the Network Information access right.
        It's available as of iOS 4 and deprecated in iOS 16.
    - key: DataRoamingEnabled
      supportedOS:
        iOS:
          introduced: '5.0'
          accessrights: AllowQueryNetworkInformation
          userenrollment:
            mode: forbidden
        macOS:
          introduced: n/a
        tvOS:
          introduced: n/a
        watchOS:
          introduced: n/a
      type: <string>
      content: The key to determine if data roaming is in an enabled state on the
        device. This value requires the Network Information access right, and is available
        in iOS 5 and later.
    - key: VoiceRoamingEnabled
      supportedOS:
        iOS:
          introduced: '5.0'
          deprecated: '16.0'
          accessrights: AllowQueryNetworkInformation
          userenrollment:
            mode: forbidden
        macOS:
          introduced: n/a
        tvOS:
          introduced: n/a
        watchOS:
          introduced: n/a
      type: <string>
      content: The key to determine whether voice roaming, which isn't available for
        all carriers, is in an enabled state on the device. This value requires the
        Network Information access right. It's available as of iOS 5 and deprecated
        in iOS 16.
    - key: PersonalHotspotEnabled
      supportedOS:
        iOS:
          introduced: '7.0'
          accessrights: AllowQueryNetworkInformation
          userenrollment:
            mode: forbidden
        macOS:
          introduced: n/a
        tvOS:
          introduced: n/a
        watchOS:
          introduced: n/a
      type: <string>
      content: The key to determine if Personal Hotspot, which isn't available for
        all carriers, is in an enabled state on the device. This value requires the
        Network Information access right, and is available in iOS 7 and later.
    - key: IsNetworkTethered
      supportedOS:
        iOS:
          introduced: '10.3'
          accessrights: AllowQueryNetworkInformation
        macOS:
          introduced: n/a
        tvOS:
          introduced: n/a
        watchOS:
          introduced: n/a
      type: <string>
      content: The key to determine if the device is network-tethered. This value
        requires the Network Information access right, and is available in iOS 10.3
        and later.
    - key: IsRoaming
      supportedOS:
        iOS:
          introduced: '4.2'
          accessrights: AllowQueryNetworkInformation
          userenrollment:
            mode: forbidden
        macOS:
          introduced: n/a
        tvOS:
          introduced: n/a
        watchOS:
          introduced: n/a
      type: <string>
      content: The key to determine if the device is roaming. This value requires
        the Network Information access right and is available in iOS 4.2 and later.
    - key: SubscriberMCC
      supportedOS:
        iOS:
          introduced: 4.2.6
          deprecated: '16.0'
          accessrights: AllowQueryNetworkInformation
          userenrollment:
            mode: forbidden
        macOS:
          introduced: n/a
        tvOS:
          introduced: n/a
        watchOS:
          introduced: n/a
      type: <string>
      content: The key to get the home mobile country code. This value requires the
        Network Information access right. It's available as of iOS 4.2.6 and deprecated
        in iOS 16.
    - key: SubscriberMNC
      supportedOS:
        iOS:
          introduced: 4.2.6
          deprecated: '16.0'
          accessrights: AllowQueryNetworkInformation
          userenrollment:
            mode: forbidden
        macOS:
          introduced: n/a
        tvOS:
          introduced: n/a
        watchOS:
          introduced: n/a
      type: <string>
      content: The key to get the home mobile network code. This value requires the
        Network Information access right. It's available as of iOS 4.2.6 and deprecated
        in iOS 16.
    - key: CurrentMCC
      supportedOS:
        iOS:
          deprecated: '16.0'
          accessrights: AllowQueryNetworkInformation
          userenrollment:
            mode: forbidden
        macOS:
          introduced: n/a
        tvOS:
          introduced: n/a
        watchOS:
          introduced: n/a
      type: <string>
      content: The key to get the current mobile country code (MCC). This value requires
        the Network Information access right. It's available as of iOS 4 and deprecated
        in iOS 16.
    - key: CurrentMNC
      supportedOS:
        iOS:
          deprecated: '16.0'
          accessrights: AllowQueryNetworkInformation
          userenrollment:
            mode: forbidden
        macOS:
          introduced: n/a
        tvOS:
          introduced: n/a
        watchOS:
          introduced: n/a
      type: <string>
      content: The key to get the current mobile network code (MNC). TThis value requires
        the Network Information access right. It's available as of iOS 4 and deprecated
        in iOS 16.
    - key: ServiceSubscriptions
      supportedOS:
        iOS:
          introduced: '12.0'
          accessrights: AllowQueryNetworkInformation
          userenrollment:
            mode: forbidden
        macOS:
          introduced: n/a
        tvOS:
          introduced: n/a
        watchOS:
          introduced: n/a
      type: <string>
      content: The key to get the contents of DeviceInformationResponse.QueryResponses.ServiceSubscriptionProperty.
        This value requires the Network Information access right.
    - key: PINRequiredForEraseDevice
      supportedOS:
        iOS:
          introduced: n/a
        macOS:
          introduced: '11.0'
          accessrights: AllowQueryDeviceInformation
          userenrollment:
            mode: forbidden
        tvOS:
          introduced: n/a
      type: <string>
      content: The key to determine if the EraseDeviceCommand requires a PIN. This
        value is available in macOS 11 and later.
    - key: PINRequiredForDeviceLock
      supportedOS:
        iOS:
          introduced: n/a
        macOS:
          introduced: '11.0'
          accessrights: AllowQueryDeviceInformation
          userenrollment:
            mode: forbidden
        tvOS:
          introduced: n/a
        watchOS:
          introduced: n/a
      type: <string>
      content: The key to determine if the DeviceLockCommand requires a PIN. This
        value is available in macOS 11 and later.
    - key: SupportsiOSAppInstalls
      supportedOS:
        iOS:
          introduced: n/a
        macOS:
          introduced: '11.0'
          accessrights: AllowQueryDeviceInformation
        tvOS:
          introduced: n/a
        watchOS:
          introduced: n/a
      type: <string>
      content: The key to determine whether the macOS device supports iOS/iPadOS app
        installs. This query is available in macOS 11 and later.
    - key: SoftwareUpdateDeviceID
      supportedOS:
        iOS:
          introduced: '15.0'
          userenrollment:
            mode: forbidden
        macOS:
          introduced: '12.0'
          userenrollment:
            mode: forbidden
        tvOS:
          introduced: n/a
        watchOS:
          introduced: n/a
      type: <string>
      content: The key that represents the device identifier you use to look up available
        OS updates through <https://gdmf.apple.com/v2/pmv>. Available in iOS 15 and
        later, and macOS 12 and later.
    - key: SoftwareUpdateSettings
      supportedOS:
        iOS:
          introduced: '14.5'
          userenrollment:
            mode: forbidden
        macOS:
          introduced: n/a
        tvOS:
          introduced: n/a
        watchOS:
          introduced: n/a
      type: <string>
      content: The key to get the device settings that control which updates appear
        in the Software Update pane in Settings. Available in iOS 14.5 and later.
    - key: AccessibilitySettings
      supportedOS:
        iOS:
          introduced: '16.0'
          supervised: true
          sharedipad:
            mode: allowed
            devicechannel: false
          userenrollment:
            mode: forbidden
        macOS:
          introduced: n/a
        tvOS:
          introduced: n/a
        watchOS:
          supervised: true
      type: <string>
      content: The key to get the current state of settable accessibility settings.
        Available in iOS 16 and later.
    - key: DevicePropertiesAttestation
      supportedOS:
        iOS:
          introduced: '16.0'
          supervised: false
          userenrollment:
            mode: allowed
        macOS:
          introduced: '14.0'
        tvOS:
          introduced: '16.0'
      type: <string>
      content: The key to get an attestation of the device's properties. Available
        in iOS 16 and later, macOS 14 and later, tvOS 16 and later, and watchOS 10
        and later.
    - key: EACSPreflight
      supportedOS:
        iOS:
          introduced: n/a
        macOS:
          introduced: '13.3'
          accessrights: AllowQueryDeviceInformation
          userchannel: false
          userenrollment:
            mode: forbidden
        tvOS:
          introduced: n/a
        watchOS:
          introduced: n/a
      type: <string>
      content: The key to determine whether the device can perform an EraseDeviceCommand
        using Erase All Content and Settings (EACS).
- key: DeviceAttestationNonce
  supportedOS:
    iOS:
      introduced: '16.0'
      supervised: false
      userenrollment:
        mode: allowed
    macOS:
      introduced: '14.0'
    tvOS:
      introduced: '16.0'
  type: <data>
  presence: optional
  content: |-
    This value can contain up to 32 bytes of data. If specified, queries need to contain 'DevicePropertiesAttestation'. If omitted or if the value matches the cached attestation, the system returns the cached attestation. Otherwise, the system requests and returns a new attestation that contains the new nonce.
    The nonce appears in the resulting attestation to ensure it was recently generated. To request a new attestation, provide a new nonce. The system caches the most recently generated attestation on the device. Requests for new attestations are rate limited. If it has been fewer than 7 days since the system generated an attestation, the device returns the cached attestation rather than generating a new one.
responsekeys:
- key: QueryResponses
  type: <dictionary>
  presence: required
  content: A dictionary that contains information about the device.
  subkeys:
  - key: UDID
    type: <string>
    content: The unique identifier of the device.
  - key: ProvisioningUDID
    supportedOS:
      iOS:
        introduced: n/a
      macOS:
        introduced: '11.3'
        accessrights: n/a
        userenrollment:
          mode: forbidden
      tvOS:
        introduced: n/a
      watchOS:
        introduced: n/a
    type: <string>
    content: The device identifier used in provisioning profiles. This value differs
      from the UDID on Macs with Apple silicon. Available in macOS 11.3 and later.
  - key: OrganizationInfo
    supportedOS:
      iOS:
        introduced: '7.0'
      macOS:
        introduced: '10.11'
      tvOS:
        introduced: '9.0'
    type: <dictionary>
    content: The contents of SettingsCommand.Command.Settings.OrganizationInfo.OrganizationInfo.
    subkeys:
    - key: OrganizationName
      type: <string>
      presence: required
      content: A string that describes the organization operating the MDM server.
        This value is available in iOS 7 and later, macOS 10.11 and later, and tvOS
        9 and later.
    - key: OrganizationAddress
      type: <string>
      presence: optional
      content: The organization's address. Use the LF character ('&#10') to insert
        line breaks. This value is available in iOS 7 and later, macOS 10.11 and later,
        and tvOS 9 and later.
    - key: OrganizationPhone
      type: <string>
      presence: optional
      content: The organization's phone number. This value is available in iOS 7 and
        later, macOS 10.11 and later, and tvOS 9 and later.
    - key: OrganizationEmail
      type: <string>
      presence: optional
      content: The organization's support email address. This value is available in
        iOS 7 and later, macOS 10.11 and later, and tvOS 9 and later.
    - key: OrganizationMagic
      type: <string>
      presence: optional
      content: A unique identifier for the various services a single organization
        manages. This value is available in iOS 7 and later, macOS 10.11 and later,
        and tvOS 9 and later.
  - key: MDMOptions
    supportedOS:
      iOS:
        introduced: '7.0'
      macOS:
        introduced: '11.0'
      tvOS:
        introduced: '9.0'
    type: <dictionary>
    content: The contents of SettingsCommand.Command.Settings.MDMOptions.MDMOptions.
    subkeys:
    - key: ActivationLockAllowedWhileSupervised
      supportedOS:
        watchOS:
          introduced: n/a
      type: <boolean>
      presence: optional
      default: false
      content: If 'true', a supervised device registers itself with Activation Lock
        when the user enables Find My. Unsupervised devices ignore this value. This
        value is available in iOS 7 and later, macOS 11 and later, and tvOS 9 and
        later.
    - key: BootstrapTokenAllowed
      supportedOS:
        iOS:
          introduced: n/a
        macOS:
          introduced: '11.0'
        tvOS:
          introduced: n/a
        watchOS:
          introduced: n/a
      type: <boolean>
      presence: optional
      default: false
      content: If 'true', the server supports Bootstrap Token commands. This value
        is available in macOS 11 and later.
    - key: PromptUserToAllowBootstrapTokenForAuthentication
      supportedOS:
        iOS:
          introduced: n/a
        macOS:
          introduced: '11.0'
        tvOS:
          introduced: n/a
        watchOS:
          introduced: n/a
      type: <boolean>
      presence: optional
      default: false
      content: If 'true', the device can accept a Bootstrap Token from the MDM server
        instead of prompting for user authentication prior to installation. This only
        applies when 'BootstrapTokenAllowedForAuthentication' is 'true' in the SecurityInfoResponse.SecurityInfo
        response. This value is available for Apple silicon devices in macOS 11 and
        later.
  - key: LastCloudBackupDate
    supportedOS:
      iOS:
        introduced: '8.0'
      macOS:
        introduced: n/a
      tvOS:
        introduced: n/a
      watchOS:
        introduced: n/a
    type: <date>
    content: The date of the last iCloud backup. This query is available in iOS 8
      and later.
  - key: AwaitingConfiguration
    supportedOS:
      iOS:
        introduced: '9.0'
      macOS:
        introduced: '10.11'
      tvOS:
        introduced: '10.2'
    type: <boolean>
    content: |-
      If 'true' on the device channel, the device is still waiting for a DeviceConfiguredCommand to continue through Setup Assistant.
      If 'true' on the user channel (Shared iPad only), the device is still waiting for a UserConfiguredCommand to continue through Setup Assistant and finish login.
  - key: iTunesStoreAccountIsActive
    supportedOS:
      iOS:
        introduced: '7.0'
      macOS:
        introduced: '10.9'
      tvOS:
        introduced: '9.0'
    type: <boolean>
    content: If 'true', the device has an active iTunes Store account. This value
      requires the App Installation access right.
  - key: iTunesStoreAccountHash
    supportedOS:
      iOS:
        introduced: '8.0'
      macOS:
        introduced: '10.10'
      tvOS:
        introduced: '9.0'
    type: <string>
    content: A hash of the logged-in iTunes Store account. Also see GetVppUserRequest.
      This value requires the App Installation access right.
  - key: DeviceName
    type: <string>
    content: The device name. This value requires the Device Information access right.
  - key: OSVersion
    type: <string>
    content: The operating system version. This value requires the Device Information
      access right.
  - key: SupplementalOSVersionExtra
    supportedOS:
      watchOS:
        introduced: n/a
    type: <string>
    content: The OS update rapid security response version letter.
  - key: BuildVersion
    type: <string>
    content: The operating system version. This value requires the Device Information
      access right.
  - key: SupplementalBuildVersion
    type: <string>
    content: The supplemental OS build version.
  - key: ModelName
    type: <string>
    content: The model name, for example, iPhone. This value requires the Device Information
      access right.
  - key: Model
    type: <string>
    content: The model. This value requires the Device Information access right.
  - key: ModelNumber
    supportedOS:
      watchOS:
        introduced: n/a
    type: <string>
    content: The device's hardware model number including region info, for example,
      'MK1A3LL/A'. This value requires the Device Information right, and it requires
      Apple silicon on macOS.
  - key: IsAppleSilicon
    supportedOS:
      iOS:
        introduced: n/a
      macOS:
        introduced: '12.0'
      tvOS:
        introduced: n/a
      watchOS:
        introduced: n/a
    type: <boolean>
    content: If 'true', the macOS device uses an Apple silicon chip.
  - key: ProductName
    type: <string>
    content: The product name, such as iPad8,12. This value requires the Device Information
      access right.
  - key: SerialNumber
    type: <string>
    content: The serial number. This value requires the Device Information access
      right.
  - key: DeviceCapacity
    supportedOS:
      tvOS:
        introduced: n/a
    type: <real>
    content: The total capacity in floating-point base-10 gigabytes (GB) on iOS and
      macOS 12 or later. The capacity is in base-2 gibibytes (GiB) on macOS 11 and
      earlier. This value requires the Device Information access right, and is available
      in iOS 4 and later, and macOS 10.7 and later.
  - key: AvailableDeviceCapacity
    supportedOS:
      tvOS:
        introduced: n/a
    type: <real>
    content: The available capacity in floating-point base-10 gigabytes (GB) on iOS
      and macOS 12 or later. The capacity is in base-2 gibibytes (GiB) on macOS 11
      and earlier. This value requires the Device Information access right, and is
      available in iOS 4 and later, and macOS 10.7 and later.
  - key: IMEI
    supportedOS:
      iOS:
        deprecated: '16.0'
      macOS:
        introduced: n/a
      tvOS:
        introduced: n/a
      watchOS:
        introduced: n/a
    type: <string>
    content: The International Mobile Equipment Identity (IMEI) number. This value
      requires the Device Information access right. It's available as of iOS 4 and
      deprecated in iOS 16.
  - key: MEID
    supportedOS:
      iOS:
        deprecated: '16.0'
      macOS:
        introduced: n/a
      tvOS:
        introduced: n/a
      watchOS:
        introduced: n/a
    type: <string>
    content: The mobile equipment identifier (MEID) number. This value requires the
      Device Information access right. It's available as of iOS 4 and deprecated in
      iOS 16.
  - key: ModemFirmwareVersion
    supportedOS:
      macOS:
        introduced: n/a
      tvOS:
        introduced: n/a
      watchOS:
        introduced: n/a
    type: <string>
    content: The modem firmware version. This value requires the Device Information
      access right, and is available in iOS 4.0 and later.
  - key: CellularTechnology
    supportedOS:
      iOS:
        introduced: 4.2.6
      macOS:
        introduced: n/a
      tvOS:
        introduced: n/a
      watchOS:
        introduced: n/a
    type: <integer>
    rangelist:
    - 0
    - 1
    - 2
    - 3
    content: |-
      The cellular technology type, which is one of the following values:
      * '0':' 'None'
      * '1':' 'GSM'
      * '2':' 'CDMA'
      * '3':' 'Both'
      This value requires the Device Information access right, and is available in iOS 4.2.6 and later.
  - key: BatteryLevel
    supportedOS:
      iOS:
        introduced: '5.0'
      macOS:
        introduced: '13.3'
      tvOS:
        introduced: n/a
    type: <real>
    content: The battery level, between '0.0' and '1.0', or '-1.0' if MDM can't determine
      the battery level. This value requires the Device Information access right,
      and is available in iOS 5 and later.
  - key: HasBattery
    supportedOS:
      iOS:
        introduced: n/a
      macOS:
        introduced: '13.3'
      tvOS:
        introduced: n/a
      watchOS:
        introduced: n/a
    type: <boolean>
    content: If 'true', the device has an internal battery.
  - key: IsSupervised
    supportedOS:
      iOS:
        introduced: '6.0'
      macOS:
        introduced: '10.15'
      tvOS:
        introduced: '9.0'
    type: <boolean>
    content: If 'true', it's a supervised device. This value requires the Device Information
      access right, and is available in iOS 6 and later, macOS 10.15 and later, and
      tvOS 9 and later.
  - key: IsMultiUser
    supportedOS:
      iOS:
        introduced: '9.3'
      macOS:
        introduced: n/a
      tvOS:
        introduced: n/a
      watchOS:
        introduced: n/a
    type: <boolean>
    content: If 'true', the device is in ephemeral multiuser mode. This value requires
      the Device Information access right, and is available in iOS 9.3 and later.
  - key: IsDeviceLocatorServiceEnabled
    supportedOS:
      iOS:
        introduced: '7.0'
      macOS:
        introduced: n/a
      tvOS:
        introduced: n/a
    type: <boolean>
    content: If 'true', the device has enabled a device locator service, such as Find
      My. This value requires the Device Information access right, and is available
      in iOS 7 and later.
  - key: IsActivationLockEnabled
    supportedOS:
      iOS:
        introduced: '7.0'
        deprecated: '16.0'
      macOS:
        introduced: '10.9'
        deprecated: '13.0'
      tvOS:
        introduced: n/a
      watchOS:
        deprecated: '10.0'
    type: <boolean>
    content: If 'true', the device has enabled Activation Lock. This value requires
      the Device Information access right. It's available as of iOS 7 and macOS 10.9,
      and deprecated in iOS 16 and macOS 13.
  - key: IsActivationLockSupported
    supportedOS:
      iOS:
        introduced: n/a
      macOS:
        introduced: '10.9'
      tvOS:
        introduced: n/a
      watchOS:
        introduced: n/a
    type: <boolean>
    content: If 'true', the device supports Activation Lock. Also see 'IsActivationLockManageable'
      in SecurityInfoResponse.SecurityInfo.ManagementStatus. This value is available
      in macOS 10.9 and later.
  - key: IsDoNotDisturbInEffect
    supportedOS:
      iOS:
        introduced: '7.0'
      macOS:
        introduced: n/a
      tvOS:
        introduced: n/a
    type: <boolean>
    content: If 'true', the device is in Do Not Disturb (DND) mode. This value is
      'true' even if DND is only in effect for a locked device. This value requires
      the Device Information access right, and is available in iOS 7 and later.
  - key: SupportsLOMDevice
    supportedOS:
      iOS:
        introduced: n/a
      macOS:
        introduced: '11.0'
      tvOS:
        introduced: n/a
      watchOS:
        introduced: n/a
    type: <boolean>
    content: If 'true', the device can receive 'PowerON', 'PowerOFF', and 'Reset'
      commands from a lights-out management (LOM) controller. This query is available
      in macOS 11 and later.
  - key: DeviceID
    supportedOS:
      iOS:
        introduced: n/a
      macOS:
        introduced: n/a
      tvOS:
        introduced: '6.0'
      watchOS:
        introduced: n/a
    type: <string>
    content: The device identifier. This value requires the Device Information access
      right, and is available in tvOS 6 and later.
  - key: EASDeviceIdentifier
    supportedOS:
      iOS:
        introduced: '7.0'
      macOS:
        introduced: n/a
      tvOS:
        introduced: n/a
      watchOS:
        introduced: n/a
    type: <string>
    content: The device identifier for Exchange Active Sync (EAS). This value requires
      the Device Information access right, and is available in iOS 7 and later.
  - key: IsCloudBackupEnabled
    supportedOS:
      iOS:
        introduced: '7.1'
      macOS:
        introduced: n/a
      tvOS:
        introduced: n/a
      watchOS:
        introduced: n/a
    type: <boolean>
    content: If 'true', the device has enabled iCloud backup. This value requires
      the Device Information access right, and is available in iOS 7.1 and later.
  - key: ActiveManagedUsers
    supportedOS:
      iOS:
        introduced: n/a
      macOS:
        introduced: '10.11'
      tvOS:
        introduced: n/a
      watchOS:
        introduced: n/a
    type: <array>
    content: An array of the directory GUIDs of the logged-in managed users. If one
      of these users is currently logged in to the console, the 'CurrentConsoleManagedUser'
      key returns the GUID of that user. This value requires the Device Information
      access right, and is available in macOS 10.11 and later.
    subkeys:
    - key: ActiveManagedUsersItems
      type: <string>
  - key: OSUpdateSettings
    supportedOS:
      iOS:
        introduced: n/a
      macOS:
        introduced: '10.11'
      tvOS:
        introduced: n/a
      watchOS:
        introduced: n/a
    type: <dictionary>
    content: The contents of DeviceInformationResponse.QueryResponses.OSUpdateSettings.
      This value requires the Device Information access right, and is available in
      macOS 10.11 and later.
    subkeys:
    - key: CatalogURL
      type: <string>
      content: The URL to the software update catalog the client is using. This value
        is available in macOS 10.11 and later.
    - key: IsDefaultCatalog
      type: <boolean>
      content: If 'true', 'CatalogURL' is the default catalog. This value is available
        in macOS 10.11 and later.
    - key: PreviousScanDate
      type: <date>
      content: The date of the last software update scan. This value is available
        in macOS 10.11 and later.
    - key: PreviousScanResult
      type: <string>
      content: The result code of last software update scan; '”0”' = success. This
        value is available in macOS 10.11 and later.
    - key: PerformPeriodicCheck
      type: <boolean>
      content: If 'true', start a new scan. This value is available in macOS 10.11
        and later.
    - key: AutoCheckEnabled
      type: <boolean>
      content: The preference to automatically check for app updates. This value is
        available in macOS 10.11 and later.
    - key: BackgroundDownloadEnabled
      type: <boolean>
      content: The preference to download app updates in the background. This value
        is available in macOS 10.11 and later.
    - key: AutomaticAppInstallationEnabled
      type: <boolean>
      content: The preference to automatically install app updates. This value is
        available in macOS 10.11 and later.
    - key: AutomaticOSInstallationEnabled
      type: <boolean>
      content: The preference to automatically install operating system updates. This
        value is available in macOS 10.11 and later.
    - key: AutomaticSecurityUpdatesEnabled
      type: <boolean>
      content: The preference to automatically install system data files and security
        updates. This value is available in macOS 10.11 and later.
  - key: LocalHostName
    supportedOS:
      iOS:
        introduced: n/a
      macOS:
        introduced: '10.11'
      tvOS:
        introduced: n/a
      watchOS:
        introduced: n/a
    type: <string>
    content: The local host name from Bonjour. This value is available in macOS 10.11
      and later.
  - key: HostName
    supportedOS:
      iOS:
        introduced: n/a
      macOS:
        introduced: '10.11'
      tvOS:
        introduced: n/a
      watchOS:
        introduced: n/a
    type: <string>
    content: The host name. This value is available in macOS 10.11 and later.
  - key: AutoSetupAdminAccounts
    supportedOS:
      iOS:
        introduced: n/a
      macOS:
        introduced: '10.11'
      tvOS:
        introduced: n/a
      watchOS:
        introduced: n/a
    type: <array>
    content: The contents of DeviceInformationResponse.QueryResponses.AutoSetupAdminAccountsItem,
      which Setup Assistant automatically created during DEP enrollment. This value
      requires the Device Information access right, and is available in macOS 10.11
      and later.
    subkeys:
    - key: AutoSetupAdminAccountsItem
      type: <dictionary>
      subkeys:
      - key: GUID
        type: <string>
        content: The 'GeneratedUID' of the administrator account. This value is available
          in macOS 10.11 and later.
      - key: shortName
        type: <string>
        content: The short name of the administrator account. This value is available
          in macOS 10.11 and later.
  - key: SystemIntegrityProtectionEnabled
    supportedOS:
      iOS:
        introduced: n/a
      macOS:
        introduced: '10.12'
      tvOS:
        introduced: n/a
      watchOS:
        introduced: n/a
    type: <boolean>
    content: If 'true', the device has enabled System Integrity Protection. This value
      requires the Device Information access right, and is available in macOS 10.12
      and later.
  - key: IsMDMLostModeEnabled
    supportedOS:
      iOS:
        introduced: '9.3'
      macOS:
        introduced: n/a
      tvOS:
        introduced: n/a
    type: <boolean>
    content: If 'true', the device has enabled Managed Lost Mode. This value requires
      the Device Information access right, and is available in iOS 9.3 and later.
  - key: MaximumResidentUsers
    supportedOS:
      iOS:
        introduced: '9.3'
      macOS:
        introduced: n/a
      tvOS:
        introduced: n/a
      watchOS:
        introduced: n/a
    type: <integer>
    content: The maximum number of users that can use this shared iPad device. Starting
      with iOS 13.4, the value that returns is always '32'. This value requires the
      Device Information access right, and is available in iOS 9.3 and later.
  - key: EstimatedResidentUsers
    supportedOS:
      iOS:
        introduced: '14.0'
      macOS:
        introduced: n/a
      tvOS:
        introduced: n/a
      watchOS:
        introduced: n/a
    type: <integer>
    content: The estimated number of users that can use this shared iPad device, according
      to the space available on the device and each user's quota. This value requires
      the Device Information access right, and is available in iOS 14 and later.
  - key: QuotaSize
    supportedOS:
      iOS:
        introduced: '13.4'
      macOS:
        introduced: n/a
      tvOS:
        introduced: n/a
      watchOS:
        introduced: n/a
    type: <integer>
    content: The quota size in megabytes for each user on this shared iPad device.
      This value requires the Device Information access right, and is available in
      iOS 13.4 and later.
  - key: ResidentUsers
    supportedOS:
      iOS:
        introduced: '13.4'
      macOS:
        introduced: n/a
      tvOS:
        introduced: n/a
      watchOS:
        introduced: n/a
    type: <integer>
    content: The number of users currently on this shared iPad device. This value
      requires the Device Information access right, and is available in iOS 13.4 and
      later.
  - key: UserSessionTimeout
    supportedOS:
      iOS:
        introduced: '14.5'
      macOS:
        introduced: n/a
      tvOS:
        introduced: n/a
      watchOS:
        introduced: n/a
    type: <integer>
    content: The timeout interval for the user session. '0' means no timeout.
  - key: TemporarySessionTimeout
    supportedOS:
      iOS:
        introduced: '14.5'
      macOS:
        introduced: n/a
      tvOS:
        introduced: n/a
      watchOS:
        introduced: n/a
    type: <integer>
    content: The timeout interval for the temporary session. '0' means no timeout.
  - key: TemporarySessionOnly
    supportedOS:
      iOS:
        introduced: '14.5'
      macOS:
        introduced: n/a
      tvOS:
        introduced: n/a
      watchOS:
        introduced: n/a
    type: <boolean>
    content: If 'true', the device only allows temporary sessions.
  - key: ManagedAppleIDDefaultDomains
    supportedOS:
      iOS:
        introduced: '16.0'
      macOS:
        introduced: n/a
      tvOS:
        introduced: n/a
      watchOS:
        introduced: n/a
    type: <array>
    content: |-
      The list of domains that the device suggests on the Shared iPad login screen.
      Available in iOS 16 and later.
    subkeys:
    - key: AppleID domain
      type: <string>
  - key: OnlineAuthenticationGracePeriod
    supportedOS:
      iOS:
        introduced: '16.0'
      macOS:
        introduced: n/a
      tvOS:
        introduced: n/a
      watchOS:
        introduced: n/a
    type: <integer>
    content: |-
      The grace period for Shared iPad online authentication (in days). 0 means the device requires online authentication for every login.
      Available in iOS 16 and later.
  - key: SkipLanguageAndLocaleSetupForNewUsers
    supportedOS:
      iOS:
        introduced: '16.2'
      macOS:
        introduced: n/a
      tvOS:
        introduced: n/a
      watchOS:
        introduced: n/a
    type: <boolean>
    content: If 'true', skip the language and country/region panes for new users on
      Shared iPad.
  - key: PushToken
    supportedOS:
      iOS:
        introduced: '9.3'
      macOS:
        introduced: '10.12'
      tvOS:
        introduced: n/a
      watchOS:
        introduced: n/a
    type: <data>
    content: The push token for the user-channel connection, in the same format as
      in TokenUpdateRequest. MDM ignores this query for the device channel. This value
      requires the Device Information access right, and is available in iOS 9.3 and
      later, and macOS 10.12 and later.
  - key: DiagnosticSubmissionEnabled
    supportedOS:
      iOS:
        introduced: '9.3'
      macOS:
        introduced: n/a
      tvOS:
        introduced: n/a
    type: <boolean>
    content: If 'true', the device has enabled diagnostic submission. This value requires
      the Device Information access right, and is available in iOS 9.3 and later.
  - key: AppAnalyticsEnabled
    supportedOS:
      iOS:
        introduced: '9.3'
      macOS:
        introduced: n/a
      tvOS:
        introduced: n/a
    type: <boolean>
    content: If 'true', the device is sharing app analytics. This value requires the
      Device Information access right, and is available in iOS 9.3 and later.
  - key: TimeZone
    supportedOS:
      iOS:
        introduced: '14.0'
      macOS:
        introduced: n/a
      tvOS:
        introduced: '14.0'
    type: <string>
    content: The current Internet Assigned Numbers Authority (IANA) time zone database
      name. This value requires the Device Information access right, and is available
      in iOS 14 and later, and tvOS 14 and later.
  - key: ICCID
    supportedOS:
      iOS:
        deprecated: '16.0'
      macOS:
        introduced: n/a
      tvOS:
        introduced: n/a
      watchOS:
        introduced: n/a
    type: <string>
    content: The integrated circuit card (ICC) identifier for the installed SIM card.
      This value requires the Network Information access right. It's available as
      of iOS 4 and deprecated in iOS 16.
  - key: BluetoothMAC
    supportedOS:
      watchOS:
        introduced: n/a
    type: <string>
    content: The Bluetooth media access control (MAC) address. This value requires
      the Network Information access right.
  - key: WiFiMAC
    type: <string>
    content: The Wi-Fi MAC address. This value requires the Network Information access
      right.
  - key: EthernetMAC
    supportedOS:
      iOS:
        introduced: n/a
      tvOS:
        introduced: n/a
      watchOS:
        introduced: n/a
    type: <string>
    content: The primary Ethernet MAC address. This value requires the Network Information
      access right, and is available in macOS 10.7 and later.
  - key: CurrentCarrierNetwork
    supportedOS:
      iOS:
        deprecated: '16.0'
      macOS:
        introduced: n/a
      tvOS:
        introduced: n/a
      watchOS:
        introduced: n/a
    type: <string>
    content: The name of the current carrier network. This value requires the Network
      Information access right. It's available as of iOS 4 and deprecated in iOS 16.
  - key: SIMCarrierNetwork
    supportedOS:
      iOS:
        removed: '5.0'
      macOS:
        introduced: n/a
      tvOS:
        introduced: n/a
      watchOS:
        introduced: n/a
    type: <string>
    content: Apple no longer supports this query. Use 'SubscriberCarrierNetwork' instead.
  - key: SubscriberCarrierNetwork
    supportedOS:
      iOS:
        introduced: '5.0'
        deprecated: '16.0'
      macOS:
        introduced: n/a
      tvOS:
        introduced: n/a
      watchOS:
        introduced: n/a
    type: <string>
    content: The name of the home carrier network. This value requires the Network
      Information access right. It's available as of iOS 5 and deprecated in iOS 16.
  - key: CarrierSettingsVersion
    supportedOS:
      iOS:
        deprecated: '16.0'
      macOS:
        introduced: n/a
      tvOS:
        introduced: n/a
      watchOS:
        introduced: n/a
    type: <string>
    content: The version of the carrier settings. This value requires the Network
      Information access right. It's available as of iOS 4 and deprecated in iOS 16.
  - key: PhoneNumber
    supportedOS:
      iOS:
        deprecated: '16.0'
      macOS:
        introduced: n/a
      tvOS:
        introduced: n/a
      watchOS:
        introduced: n/a
    type: <string>
    content: The raw phone number without punctuation and including the country code.
      This value requires the Network Information access right. It's available as
      of iOS 4 and deprecated in iOS 16.
  - key: DataRoamingEnabled
    supportedOS:
      iOS:
        introduced: '5.0'
      macOS:
        introduced: n/a
      tvOS:
        introduced: n/a
      watchOS:
        introduced: n/a
    type: <boolean>
    content: If 'true', the device has enabled data roaming. This value requires the
      Network Information access right, and is available in iOS 5 and later.
  - key: VoiceRoamingEnabled
    supportedOS:
      iOS:
        introduced: '5.0'
        deprecated: '16.0'
      macOS:
        introduced: n/a
      tvOS:
        introduced: n/a
      watchOS:
        introduced: n/a
    type: <boolean>
    content: If 'true', the device has enabled voice roaming, which isn't available
      for all carriers. This value requires the Network Information access right.
      It's available as of iOS 5 and deprecated in iOS 16.
  - key: PersonalHotspotEnabled
    supportedOS:
      iOS:
        introduced: '7.0'
      macOS:
        introduced: n/a
      tvOS:
        introduced: n/a
      watchOS:
        introduced: n/a
    type: <boolean>
    content: If 'true,' the device has enabled Personal Hotspot, which isn't available
      for all carriers. This value requires the Network Information access right,
      and is available in iOS 7.0 and later.
  - key: IsNetworkTethered
    supportedOS:
      iOS:
        introduced: '10.3'
      macOS:
        introduced: n/a
      tvOS:
        introduced: n/a
      watchOS:
        introduced: n/a
    type: <boolean>
    content: If 'true', the device is network-tethered. This value requires the Network
      Information access right, and is available in iOS 10.3 and later.
  - key: IsRoaming
    supportedOS:
      iOS:
        introduced: '4.2'
        deprecated: '16.0'
      macOS:
        introduced: n/a
      tvOS:
        introduced: n/a
      watchOS:
        introduced: n/a
    type: <boolean>
    content: If 'true', the device is roaming. This value requires the Network Information
      access right. It's available as of iOS 4.2 and deprecated in iOS 16.
  - key: SIMMCC
    supportedOS:
      iOS:
        removed: 4.2.6
      macOS:
        introduced: n/a
      tvOS:
        introduced: n/a
      watchOS:
        introduced: n/a
    type: <string>
    content: Apple no longer supports this query. Use 'SubscriberMCC' instead.
  - key: SIMMNC
    supportedOS:
      iOS:
        removed: 4.2.6
      macOS:
        introduced: n/a
      tvOS:
        introduced: n/a
      watchOS:
        introduced: n/a
    type: <string>
    content: Apple no longer supports this query. Use 'SubscriberMNC' instead.
  - key: SubscriberMCC
    supportedOS:
      iOS:
        introduced: 4.2.6
        deprecated: '16.0'
      macOS:
        introduced: n/a
      tvOS:
        introduced: n/a
      watchOS:
        introduced: n/a
    type: <string>
    content: The home Mobile Country Code (MCC). This value requires the Network Information
      access right. It's available as of iOS 4.2.6 and deprecated in iOS 16.
  - key: SubscriberMNC
    supportedOS:
      iOS:
        introduced: 4.2.6
        deprecated: '16.0'
      macOS:
        introduced: n/a
      tvOS:
        introduced: n/a
      watchOS:
        introduced: n/a
    type: <string>
    content: The key to get the home Mobile Network Code (MNC). This value requires
      the Network Information access right. It's available as of iOS 4.2.6 and deprecated
      in iOS 16.
  - key: CurrentMCC
    supportedOS:
      iOS:
        deprecated: '16.0'
      macOS:
        introduced: n/a
      tvOS:
        introduced: n/a
      watchOS:
        introduced: n/a
    type: <string>
    content: The current mobile country code (MCC).This value requires the Network
      Information access right. It's available as of iOS 4 and deprecated in iOS 16.
  - key: CurrentMNC
    supportedOS:
      iOS:
        deprecated: '16.0'
      macOS:
        introduced: n/a
      tvOS:
        introduced: n/a
      watchOS:
        introduced: n/a
    type: <string>
    content: The current mobile network code (MNC). This value requires the Network
      Information access right. It's available as of iOS 4 and deprecated in iOS 16.
  - key: ServiceSubscriptions
    supportedOS:
      iOS:
        introduced: '12.0'
      macOS:
        introduced: n/a
      tvOS:
        introduced: n/a
      watchOS:
        introduced: n/a
    type: <array>
    content: The contents of DeviceInformationResponse.QueryResponses.ServiceSubscriptionProperty.
      This value requires the Network Information access right.
    subkeys:
    - key: ServiceSubscriptionProperty
      type: <dictionary>
      content: Properties of this Service Subscription. See below.
      subkeys:
      - key: CarrierSettingsVersion
        type: <string>
        content: The version of the carrier settings. This value is available in iOS
          12 and later.
      - key: CurrentCarrierNetwork
        type: <string>
        content: The name of the current carrier network. This value is available
          in iOS 12 and later.
      - key: CurrentMCC
        type: <string>
        content: The current mobile country code (MCC). This value is available in
          iOS 12 and later.
      - key: CurrentMNC
        type: <string>
        content: The current mobile network code (MNC). This value is available in
          iOS 12 and later.
      - key: ICCID
        type: <string>
        content: The integrated circuit card identifier (ICCID) value. This value
          is available in iOS 12 and later.
      - key: EID
        supportedOS:
          iOS:
            introduced: '14.0'
          macOS:
            introduced: n/a
          tvOS:
            introduced: n/a
        type: <string>
        content: The eSIM identifier. This value is available in iOS 14 and later.
      - key: IMEI
        type: <string>
        content: The device International Mobile Equipment Identity (IMEI) number.
          This value is available in iOS 12 and later.
      - key: IsDataPreferred
        type: <boolean>
        content: If 'true', this subscription is the preference for data. This value
          is available in iOS 12 and later.
      - key: IsRoaming
        type: <boolean>
        content: If 'true', the phone is roaming. This value is available in iOS 12
          and later.
      - key: IsVoicePreferred
        type: <boolean>
        content: If 'true', this subscription is the preference for voice. This value
          is available in iOS 12 and later.
      - key: Label
        type: <string>
        content: The label of this subscription. This value is available in iOS 12
          and later.
      - key: LabelID
        type: <string>
        content: The unique identifier for this subscription. This value is available
          in iOS 12 and later.
      - key: MEID
        type: <string>
        content: The device Mobile Equipment Identifier (MEID) number. This query
          is available in iOS 12 and later.
      - key: PhoneNumber
        type: <string>
        content: The raw phone number without punctuation and including country code.
          This value is available in iOS 12 and later.
      - key: Slot
        type: <string>
        content: The description of the slot that contains the SIM representing this
          subscription. This value is available in iOS 12 and later.
      - key: SubscriberCarrierNetwork
        supportedOS:
          iOS:
            introduced: '16.0'
          macOS:
            introduced: n/a
          tvOS:
            introduced: n/a
        type: <string>
        content: The name of the home carrier network. This value is available in
          iOS 16 and later.
  - key: PINRequiredForEraseDevice
    supportedOS:
      iOS:
        introduced: n/a
      macOS:
        introduced: '11.0'
      tvOS:
        introduced: n/a
      watchOS:
        introduced: n/a
    type: <boolean>
    content: If 'true', the EraseDeviceCommand requires a PIN. This value is available
      in macOS 11 and later.
  - key: PINRequiredForDeviceLock
    supportedOS:
      iOS:
        introduced: n/a
      macOS:
        introduced: '11.0'
      tvOS:
        introduced: n/a
      watchOS:
        introduced: n/a
    type: <boolean>
    content: If 'true', the DeviceLockCommand requires a PIN. This value is available
      in macOS 11 and later.
  - key: SupportsiOSAppInstalls
    supportedOS:
      iOS:
        introduced: n/a
      macOS:
        introduced: '11.0'
      tvOS:
        introduced: n/a
      watchOS:
        introduced: n/a
    type: <boolean>
    content: If 'true', the device supports iOS/iPadOS app installs through MDM. This
      query is available in macOS 11 and later.
  - key: SoftwareUpdateDeviceID
    supportedOS:
      iOS:
        introduced: '15.0'
        userenrollment:
          mode: forbidden
      macOS:
        introduced: '12.0'
        userenrollment:
          mode: forbidden
      tvOS:
        introduced: n/a
      watchOS:
        introduced: n/a
    type: <string>
    content: The key representing the device identifier to use when looking up available
      OS updates through <https://gdmf.apple.com/v2/pmv>. Available in iOS 14.5 and
      later.
  - key: SoftwareUpdateSettings
    supportedOS:
      iOS:
        introduced: '14.5'
        userenrollment:
          mode: forbidden
      macOS:
        introduced: n/a
      tvOS:
        introduced: n/a
      watchOS:
        introduced: n/a
    type: <dictionary>
    content: The device settings that control which updates appear in the Software
      Update pane in Settings. Available in iOS 14.5 and later.
    subkeys:
    - key: RecommendationsCadence
      type: <integer>
      content: |-
        Which software updates to present to the user.
        * '0' (the default) allows all updates.
        * '1' allows only older updates.
        * '2' allows only newer updates.
        No effect if the device qualifies for only a single update.
  - key: AccessibilitySettings
    supportedOS:
      iOS:
        introduced: '16.0'
        supervised: true
        sharedipad:
          mode: allowed
          devicechannel: false
        userenrollment:
          mode: forbidden
      macOS:
        introduced: n/a
      tvOS:
        introduced: n/a
      watchOS:
        supervised: true
    type: <dictionary>
    content: The current state of settable accessibility settings. Available in iOS
      16 and later.
    subkeys:
    - key: BoldTextEnabled
      type: <boolean>
      content: If 'true', the device has enabled bold text.
    - key: IncreaseContrastEnabled
      supportedOS:
        watchOS:
          introduced: n/a
      type: <boolean>
      content: If 'true', the device has enabled increase contrast.
    - key: ReduceMotionEnabled
      type: <boolean>
      content: If 'true', the device has enabled reduced motion.
    - key: ReduceTransparencyEnabled
      type: <boolean>
      content: If 'true', the device has enabled reduced transparency.
    - key: TextSize
      type: <integer>
      rangelist:
      - -1
      - 0
      - 1
      - 2
      - 3
      - 4
      - 5
      - 6
      - 7
      - 8
      - 9
      - 10
      - 11
      content: |-
        The accessibility text size apps that support dynamic text use. 0 is the smallest value, and 11 is the largest available.
        '-1' indicates that the current size is unknown or hasn't been explicitly set.
    - key: TouchAccommodationsEnabled
      type: <boolean>
      content: If 'true', the device has enabled touch accommodations.
    - key: VoiceOverEnabled
      type: <boolean>
      content: If 'true', the device has enabled voiceover.
    - key: ZoomEnabled
      type: <boolean>
      content: If 'true', the device has enabled zoom.
    - key: GrayscaleEnabled
      supportedOS:
        iOS:
          introduced: n/a
      type: <boolean>
      content: If 'true', the device has enabled grayscale display.
  - key: DevicePropertiesAttestation
    supportedOS:
      iOS:
        introduced: '16.0'
        supervised: false
        userenrollment:
          mode: allowed
      macOS:
        introduced: '14.0'
      tvOS:
        introduced: '16.0'
    type: <array>
    content: The key to get an attestation of the device's properties. Available in
      iOS 16 and later, macOS 14 and later, tvOS 16 and later, and watchOS 10 and
      later.
    subkeys:
    - key: AttestationCertificate
      type: <data>
  - key: EACSPreflight
    supportedOS:
      iOS:
        introduced: n/a
      macOS:
        introduced: '13.3'
        userenrollment:
          mode: forbidden
      tvOS:
        introduced: n/a
      watchOS:
        introduced: n/a
    type: <string>
    content: |-
      Specifies whether the device can perform an EraseDeviceCommand using Erase All Content and Settings (EACS).
      Responses can include:
      · 'success': The device supports EACS
      · 'not supported': The device is too old to support EACS
      · 'unknown failure': A problem occurred for which there isn't a more specific error message
      · '(other string)': A reason why the device can't perform EACS, for example, “System is not sealed”
