title: LOM Device Request Command
description: Send requests to a device using lights-out management (LOM).
payload:
  requesttype: LOMDeviceRequest
  supportedOS:
    iOS:
      introduced: n/a
    macOS:
      introduced: '11.0'
      accessrights: DeviceLockAndRemovePasscode
      devicechannel: true
      userchannel: false
      supervised: false
      requiresdep: false
      userenrollment:
        mode: forbidden
    tvOS:
      introduced: n/a
    visionOS:
      introduced: n/a
    watchOS:
      introduced: n/a
  content: Used to send LOM requests ("PowerON", "PowerOFF", "Reset") to LOM Controller
    which then forwards the request to LOM Devices.
payloadkeys:
- key: RequestList
  type: <array>
  presence: required
  content: An array of requests to perform.
  subkeys:
  - key: RequestListItem
    type: <dictionary>
    presence: required
    content: A dictionary that contains a requested action to perform on a device
      using lights-out management (LOM).
    subkeys:
    - key: DeviceRequestType
      type: <string>
      presence: required
      rangelist:
      - PowerON
      - PowerOFF
      - Reset
      content: The requested action to perform on the device.
    - key: DeviceRequestUUID
      type: <string>
      presence: required
      content: The unique identifier of the request.
    - key: DeviceDNSName
      type: <string>
      presence: required
      content: The DNS name of the device. This should match the `dNSName` in `SubjectAltName`
        or an equivalent in a PKCS12 identity.
    - key: PrimaryIPv6AddressList
      type: <array>
      presence: required
      content: An array that contains the IPv6 addresses for primary LOM-compatible
        Ethernet interfaces for the device.
      subkeys:
      - key: PrimaryIPv6AddressListItem
        type: <string>
        presence: required
    - key: SecondaryIPv6AddressList
      type: <array>
      presence: required
      content: An array that contains the IPv6 addresses for secondary LOM-compatible
        Ethernet interfaces for the device.
      subkeys:
      - key: SecondaryIPv6AddressListItem
        type: <string>
        presence: required
    - key: LOMProtocolVersion
      type: <integer>
      presence: required
      content: The LOM protocol version that the device supports. Provide the same
        value that `LOMProtocolVersion` receives in the `LOMSetupRequestResponse`.
responsekeys:
- key: ResponseList
  type: <array>
  presence: required
  content: An array of dictionaries that describes the status of each request.
  subkeys:
  - key: ResponseListItem
    type: <dictionary>
    presence: required
    content: A dictionary that describes a response list item.
    subkeys:
    - key: DeviceRequestSuccess
      type: <boolean>
      presence: required
      content: If `true`, the request was successful.
    - key: DeviceRequestUUID
      type: <string>
      presence: required
      content: The unique identifier of the request for this response list item.
    - key: DeviceRequestReturnError
      type: <string>
      presence: optional
      content: If present, a description of the error for a failed request.
notes:
- title: ''
  content: |-
    This command requires the `DeviceLockAndRemovePasscode` access right, `LightsOutManagementLOM` configuration and is available in macOS 11 and later on [supported macOS devices](https://support.apple.com/guide/deployment/lights-out-management-payload-settings-dep580cf25bc/web).

    `DeviceDNSName` is the `CommonName` in the Identity issued on the client certificate from `LightsOutManagementLOM`. `LOMSetupRequestResponse` returns `PrimaryIPv6AddressList` and `SecondaryIPv6AddressList` after a successful deployment of Lights Out management configuration payload and subsequent `LOMSetupRequestCommand`.
