title: Install Media Command
description: This command allows the server to install a book on a device. If the
  book is already being managed, this command will update the book.
payload:
  requesttype: InstallMedia
  supportedOS:
    iOS:
      introduced: '8.0'
      accessrights: AllowAppInstallation
      supervised: false
      requiresdep: false
      sharedipad:
        mode: allowed
        devicechannel: true
        userchannel: false
      userenrollment:
        mode: allowed
    macOS:
      introduced: '10.9'
      accessrights: AllowAppInstallation
      devicechannel: false
      userchannel: true
      requiresdep: false
      userenrollment:
        mode: forbidden
  content: This command allows the server to install a book on a device. If the book
    is already being managed, this command will update the book.
payloadkeys:
- key: iTunesStoreID
  type: <integer>
  presence: optional
  content: The book's iTunes Store identifier.
- key: MediaURL
  supportedOS:
    macOS:
      introduced: n/a
  type: <string>
  presence: optional
  content: The URL to retrieve the book. This value is available in iOS 8 and later.
- key: MediaType
  type: <string>
  presence: required
  rangelist:
  - Book
  content: The media type, which can only be 'Book'.
- key: PersistentID
  supportedOS:
    macOS:
      introduced: n/a
  type: <string>
  presence: optional
  content: The book's persistent identifier in reverse-DNS form; for example, 'com.acme.manuals.training'.
    This value is available in iOS 8 and later.
- key: Kind
  supportedOS:
    macOS:
      introduced: n/a
  type: <string>
  presence: optional
  rangelist:
  - pdf
  - epub
  - ibooks
  content: |-
    The kind of the media, which can be one of the following values:
    * 'pdf': A PDF file
    * 'epub': An EPUB file in 'gzip' format.
    * 'ibooks': An iBooks Author file in 'gzip' format.
    If you omit this value, its value is the file extension in the URL. This value is available in iOS 8 and later.
- key: Version
  supportedOS:
    macOS:
      introduced: n/a
  type: <string>
  presence: optional
  content: The book's version number. This value is available in iOS 8 and later.
- key: Author
  supportedOS:
    macOS:
      introduced: n/a
  type: <string>
  presence: optional
  content: The name of the book's author. This value is available in iOS 8 and later.
- key: Title
  supportedOS:
    macOS:
      introduced: n/a
  type: <string>
  presence: optional
  content: The book's title. This value is available in iOS 8 and later.
responsekeys:
- key: iTunesStoreID
  type: <integer>
  presence: optional
  content: The book's iTunes Store identifier, if present in the command.
- key: MediaURL
  supportedOS:
    macOS:
      introduced: n/a
  type: <string>
  presence: optional
  content: The URL to retrieve the book, if present in the command. This value is
    available in iOS 8 and later.
- key: PersistentID
  supportedOS:
    macOS:
      introduced: n/a
  type: <string>
  presence: optional
  content: The book's persistent identifier, if present in the command. This value
    is available in iOS 8 and later.
- key: MediaType
  type: <string>
  presence: optional
  content: The media type, which can only be 'Book'.
- key: State
  type: <string>
  presence: optional
  rangelist:
  - Queued
  - PromptingForLogin
  - Updating
  - Installing
  - Managed
  - ManagedButUninstalled
  - Installed
  - Uninstalled
  - Failed
  - Unknown
  content: The installation state of this book. The 'Failed' and 'Unknown' states
    are transient and the device only reports them once. Books from the Book Store
    report their state as 'Installed' instead of 'Managed'.
- key: RejectionReason
  type: <string>
  presence: optional
  rangelist:
  - CouldNotVerifyITunesStoreID
  - PurchaseNotFound
  - AppStoreDisabled
  - WrongMediaType
  - DownloadInvalid
  - EnterpriseBooksNotSupportedInMultiUser
  content: |-
    The reason, if installation fails, which is one of the following values:
    * 'CouldNotVerifyITunesStoreID': The 'iTunesStoreID' is invalid.
    * 'PurchaseNotFound': The Volume Purchase Program (VPP) license isn't in the user's history.
    * 'AppStoreDisabled': App Store isn't available on the device.
    * 'WrongMediaType': The media type is invalid. The only valid type is 'Book'.
    * 'DownloadInvalid': The URL doesn't lead to a valid book.
    * 'EnterpriseBooksNotSupportedInMultiUser': Multiuser mode doesn't support enterprise books.
