title: Remove Media Command
description: Remove a previously installed book from a device.
payload:
  requesttype: RemoveMedia
  supportedOS:
    iOS:
      introduced: '8.0'
      accessrights: AllowAppInstallation
      supervised: false
      requiresdep: false
      sharedipad:
        mode: allowed
        devicechannel: true
        userchannel: false
      userenrollment:
        mode: allowed
    macOS:
      introduced: n/a
    tvOS:
      introduced: n/a
    visionOS:
      introduced: n/a
    watchOS:
      introduced: n/a
  content: This command allows an MDM server to remove managed media. This command
    returns Acknowledged even if the item is not found.
payloadkeys:
- key: MediaType
  type: <string>
  presence: required
  rangelist:
  - Book
  content: The media type, which can only be `Book`.
- key: iTunesStoreID
  type: <string>
  presence: optional
  content: The book's iTunes Store identifier.
- key: PersistentID
  type: <string>
  presence: optional
  content: The book's persistent identifier in reverse-DNS form; for example, `com.acme.manuals.training`.
notes:
- title: ''
  content: Refer to the following sections to determine supported channels and requirements,
    and to see an example request and response.
