title: Set Firmware Password Command
description: Changes or clears the firmware password for the device.
payload:
  requesttype: SetFirmwarePassword
  supportedOS:
    iOS:
      introduced: n/a
    macOS:
      introduced: '10.13'
      accessrights: DeviceLockAndRemovePasscode
      devicechannel: true
      userchannel: false
      requiresdep: false
      userenrollment:
        mode: forbidden
    tvOS:
      introduced: n/a
    visionOS:
      introduced: n/a
    watchOS:
      introduced: n/a
  content: Changes or clears the firmware password for the device. Requires the "Device
    lock and passcode removal right". This command is not available on Apple silicon
    devices.
payloadkeys:
- key: CurrentPassword
  type: <string>
  presence: optional
  content: The current password, which you must set if the device has a firmware password.
- key: NewPassword
  type: <string>
  presence: required
  content: The new firmware password. Set to an empty string to clear the password.
    The characters in this value must consist of low-ASCII, printable characters ('0x20'
    through '0x7E') to ensure that all characters are enterable on the EFI login screen.
- key: AllowOroms
  type: <boolean>
  presence: optional
  default: false
  content: If 'true', enable ROMs.
responsekeys:
- key: SetFirmwarePassword
  type: <dictionary>
  presence: required
  content: Command result.
  subkeys:
  - key: PasswordChanged
    type: <boolean>
    presence: required
    content: If 'true', the password change succeeded.
