title: Clear Passcode Command
description: Remove the passcode from a device.
payload:
  requesttype: ClearPasscode
  supportedOS:
    iOS:
      introduced: '4.0'
      accessrights: AllowPasscodeRemovalAndLock
      supervised: false
      requiresdep: false
      sharedipad:
        mode: forbidden
      userenrollment:
        mode: forbidden
    macOS:
      introduced: n/a
    tvOS:
      introduced: n/a
    visionOS:
      introduced: '1.1'
      accessrights: AllowPasscodeRemovalAndLock
      supervised: false
      requiresdep: false
      userenrollment:
        mode: forbidden
    watchOS:
      introduced: '10.0'
      accessrights: AllowPasscodeRemovalAndLock
      supervised: false
  content: This command allows the server to clear the passcode on the device. This
    command requires the Device Lock and Passcode Removal right.
payloadkeys:
- key: UnlockToken
  type: <data>
  presence: required
  content: The unlock token value that the device provides in its `TokenUpdateMessage`
    check-in message.
notes:
- title: ''
  content: |-
    Clearing the passcode in iOS 16 no longer adds the passcode to the history of passcodes. Therefore, the user can reuse the cleared passcode even when the `Passcode` payload has the `pinHistory` key set.

    Refer to the following sections to determine supported channels and requirements, and to see an example request and response.
