title: Remove Provisioning Profile Command
description: Remove a previously installed provisioning profile from a device.
payload:
  requesttype: RemoveProvisioningProfile
  supportedOS:
    iOS:
      introduced: '4.0'
      accessrights: AllowProvisioningInstallationRemoval
      supervised: false
      requiresdep: false
      sharedipad:
        mode: allowed
        devicechannel: true
        userchannel: false
      userenrollment:
        mode: allowed
    macOS:
      introduced: '11.0'
      accessrights: None
      devicechannel: true
      userchannel: false
      supervised: false
      requiresdep: false
      userenrollment:
        mode: allowed
    tvOS:
      introduced: '10.2'
      accessrights: AllowProvisioningInstallationRemoval
      supervised: false
    visionOS:
      introduced: '1.1'
      accessrights: AllowProvisioningInstallationRemoval
      supervised: false
      requiresdep: false
      userenrollment:
        mode: allowed
    watchOS:
      introduced: '10.0'
      accessrights: AllowProvisioningInstallationRemoval
      supervised: false
  content: This command allows the server to remove a provisioning profile. This command
    requires the Provisioning Profile Installation and Removal right. On macOS, this
    command is for iOS and iPadOS style provisioning profiles only.
payloadkeys:
- key: UUID
  type: <string>
  presence: required
  content: The unique identifier of the provisioning profile to remove.
notes:
- title: ''
  content: |-
    Refer to the following sections to determine supported channels and requirements, and to see an example request and response.

    > Note:
    > Don't remove a provisioning profile to revoke access to an enterprise app. An app continues to be usable until the device restarts, even with no provisioning profile. Provisioning profiles also synchronize with iTunes and the system reinstalls them when users sync devices. For more information on removing apps, see `Remove-Application-Command`.
