title: Rotate FileVault Key Command
description: Change the FileVault primary password on a device.
payload:
  requesttype: RotateFileVaultKey
  supportedOS:
    iOS:
      introduced: n/a
    macOS:
      introduced: '10.9'
      accessrights: DeviceLockAndRemovePasscode
      devicechannel: true
      userchannel: false
      supervised: false
      requiresdep: false
      userenrollment:
        mode: forbidden
    tvOS:
      introduced: n/a
    visionOS:
      introduced: n/a
    watchOS:
      introduced: n/a
  content: This command allows for changing a device's FileVaultMaster password.
payloadkeys:
- key: KeyType
  type: <string>
  presence: required
  rangelist:
  - personal
  - institutional
  content: The type of FileVault key you want to change the password for. Set this
    value to `personal` and set a value for `Password` in the `FileVaultUnlock` dictionary
    to enable unlocking a device with a password. Set this value to `institutional`
    and set values for `PrivateKeyExport` and `PrivateKeyExportPassword` in the `FileVaultUnlock`
    dictionary.
- key: FileVaultUnlock
  type: <dictionary>
  presence: required
  content: A dictionary that contains FileVault unlock options.
  subkeys:
  - key: Password
    title: Password
    type: <string>
    presence: optional
    content: A FileVault user's password, or if using a CoreStorage volume, the personal
      recovery key.
  - key: PrivateKeyExport
    title: PrivateKeyExport
    supportedOS:
      macOS:
        deprecated: '10.15'
    type: <data>
    presence: optional
    content: The data for a .p12 export of the private key for the current institutional
      recovery key, which requires that `KeyType` is `institutional`. The system ignores
      this key on APFS volumes.
  - key: PrivateKeyExportPassword
    title: PrivateKeyExportPassword
    supportedOS:
      macOS:
        deprecated: '10.15'
    type: <string>
    presence: optional
    content: The password for `PrivateKeyExport`. Either `Password` or both `PrivateKeyExport`
      and `PrivateKeyExportPassword` must be present. The system ignores this key
      on APFS volumes.
- key: NewCertificate
  type: <data>
  presence: optional
  content: A DER-encoded certificate for creating a new institutional recovery key,
    which the system requires if `KeyType` is `institutional`.
- key: ReplyEncryptionCertificate
  type: <data>
  presence: optional
  content: A DER-encoded certificate for encrypting the new personal recovery key
    in a wrapper conforming to the IETF Cryptographic Message Syntax (CMS) standard.
responsekeys:
- key: RotateResult
  type: <dictionary>
  presence: optional
  content: The result of rotating the personal recovery key.
  subkeytype: RotateResultItem
  subkeys:
  - key: EncryptedNewRecoveryKey
    type: <data>
    presence: optional
    content: A new personal recovery key that is encrypted using a `ReplyEncryptionCertificate`
      as a CMS-compliant envelope.
notes:
- title: ''
  content: |-
    Change the FileVault password periodically to mitigate the security risk of deployed devices.

    Refer to the following sections to determine supported channels and requirements, and to see an example request and response.
