title: OS Update Status Command
description: Get the status of operating-system updates on a device.
payload:
  requesttype: OSUpdateStatus
  supportedOS:
    iOS:
      introduced: '9.0'
      deprecated: '26.0'
      accessrights: AllowAppInstallation
      supervised: true
      requiresdep: false
      sharedipad:
        mode: allowed
        devicechannel: true
        userchannel: false
      userenrollment:
        mode: forbidden
    macOS:
      introduced: 10.11.5
      deprecated: '26.0'
      accessrights: None
      devicechannel: true
      userchannel: false
      supervised: true
      requiresdep: false
      userenrollment:
        mode: forbidden
    tvOS:
      introduced: '12.0'
      deprecated: '26.0'
      accessrights: AllowAppInstallation
      devicechannel: true
      supervised: true
      requiresdep: false
    visionOS:
      introduced: n/a
    watchOS:
      introduced: n/a
  content: Queries the device for the status of software updates.
responsekeys:
- key: OSUpdateStatus
  type: <array>
  presence: required
  content: |-
    An array of dictionaries that describes the statuses of software updates. The array is empty if there are no software updates currently in progress.
    This command only returns the status for System Applications and Configuration Data updates when a software update is managed by a Declarative Device Management `SoftwareUpdateEnforcementSpecific` configuration.
  subkeys:
  - key: OSUpdateStatusItem
    type: <dictionary>
    presence: required
    content: A dictionary that describes the status of a software update.
    subkeys:
    - key: ProductKey
      type: <string>
      presence: required
      content: The product key that represents the update.
    - key: IsDownloaded
      type: <boolean>
      presence: required
      content: If `true`, the update has finished downloading.
    - key: DownloadPercentComplete
      type: <real>
      presence: required
      content: A floating-point number between `0.0` and `1.0` that indicates the
        download progress as a percentage.
    - key: Status
      type: <string>
      presence: required
      content: |-
        The status of the update, which is one of the following values:

        - `Idle`: The update is idle.
        - `Downloading`: The software update is downloading and subsequently preparing.
        - `Installing`: The software update is installing.
    - key: MaxDeferrals
      supportedOS:
        iOS:
          introduced: n/a
        macOS:
          introduced: '12.3'
        tvOS:
          introduced: n/a
      type: <integer>
      presence: optional
      content: |-
        The number of times a user can defer this OS update.

        Available in macOS 12.3 and later.
    - key: DeferralsRemaining
      supportedOS:
        iOS:
          introduced: n/a
        macOS:
          introduced: '12.3'
        tvOS:
          introduced: n/a
      type: <integer>
      presence: optional
      content: |-
        The number of remaining user deferrals for this OS update.

        Available in macOS 12.3 and later.
    - key: NextScheduledInstall
      supportedOS:
        iOS:
          introduced: n/a
        macOS:
          introduced: '12.3'
        tvOS:
          introduced: n/a
      type: <date>
      presence: optional
      content: |-
        The date of the next attempt at installing this OS update.

        Available in macOS 12.3 and later.
    - key: PastNotifications
      supportedOS:
        iOS:
          introduced: n/a
        macOS:
          introduced: '12.3'
        tvOS:
          introduced: n/a
      type: <array>
      presence: optional
      content: |-
        The dates/times when the OS notified the user about installing this OS update.

        Available in macOS 12.3 and later.
      subkeys:
      - key: PastNotificationDate
        title: Past Notification Date
        type: <date>
notes:
- title: ''
  content: Refer to the following sections to determine supported channels and requirements,
    and to see an example request and response.
