title: Delete User Command
description: Delete a user's account from a device.
payload:
  requesttype: DeleteUser
  supportedOS:
    iOS:
      introduced: '9.3'
      accessrights: None
      supervised: false
      requiresdep: false
      sharedipad:
        mode: required
        devicechannel: true
        userchannel: false
      userenrollment:
        mode: forbidden
    macOS:
      introduced: '10.13'
      accessrights: None
      devicechannel: true
      userchannel: false
      supervised: true
      requiresdep: false
      userenrollment:
        mode: forbidden
    tvOS:
      introduced: n/a
    visionOS:
      introduced: n/a
    watchOS:
      introduced: n/a
  content: This command allows the server to delete a user that has an active account
    on the device.
payloadkeys:
- key: UserName
  type: <string>
  presence: optional
  content: The user name of the account to delete. This key is required when the value
    for `DeleteAllUsers` is absent or `false`.
- key: ForceDeletion
  supportedOS:
    macOS:
      introduced: n/a
  type: <boolean>
  presence: optional
  default: false
  content: If `true`, the system deletes the account even if the user has data that's
    pending sync to the cloud. This value is available on iOS 9.3 and later.
- key: DeleteAllUsers
  supportedOS:
    iOS:
      introduced: '14.0'
    macOS:
      introduced: n/a
  type: <boolean>
  presence: optional
  default: false
  content: If `true`, the system attempts to delete all users from the device. If
    `ForceDeletion` is `false`, the system generates an error instead and doesn't
    delete users who have data that's pending sync. This value is available in iOS
    14 and later.
notes:
- title: ''
  content: Refer to the following sections to determine supported channels and requirements,
    and to see an example request and response.
- title: Error codes
  content: |-
    An error response uses one of the following error codes:

    - `12071`: The user doesn't exist.
    - `12072`: The user is currently logged in.
    - `12073`: The user has data to sync and ForceDeletion is false or unspecified.
    - `12074`: Unable to delete the user. In macOS, this error code also returns for an attempt to delete the last administrator account.
