title: User List Command
description: Get a list of users with active accounts on a device.
payload:
  requesttype: UserList
  supportedOS:
    iOS:
      introduced: '9.3'
      accessrights: None
      supervised: false
      requiresdep: false
      sharedipad:
        mode: required
        devicechannel: true
        userchannel: false
      userenrollment:
        mode: forbidden
    macOS:
      introduced: '10.13'
      accessrights: None
      devicechannel: true
      userchannel: false
      supervised: true
      requiresdep: false
      userenrollment:
        mode: forbidden
    tvOS:
      introduced: n/a
    visionOS:
      introduced: n/a
    watchOS:
      introduced: n/a
  content: This command allows the server to query for a list of users that have an
    active account on the device.
responsekeys:
- key: Users
  type: <array>
  presence: required
  content: An array of user dictionaries that contains information about the active
    accounts.
  subkeys:
  - key: UsersItem
    type: <dictionary>
    presence: required
    content: A dictionary that contains information about an active account on a device.
    subkeys:
    - key: UserName
      type: <string>
      presence: required
      content: The user name for the account. In macOS, this is the short name of
        the user account. This value is available in iOS 9.3 and later, and macOS
        10.13 and later.
    - key: FullName
      supportedOS:
        iOS:
          introduced: n/a
      type: <string>
      presence: required
      content: The user's full name. This value is available in macOS 10.13 and later.
    - key: UID
      supportedOS:
        iOS:
          introduced: n/a
      type: <integer>
      presence: required
      content: The user's unique identifier. This value is available in macOS 10.13
        and later.
    - key: UserGUID
      supportedOS:
        iOS:
          introduced: n/a
      type: <string>
      presence: required
      content: The user's `GeneratedUID`. This value is available in macOS 10.13 and
        later.
    - key: IsLoggedIn
      type: <boolean>
      presence: required
      content: If `true`, the user is currently logged in on the device. This value
        is available in iOS 9.3 and later, and macOS 10.13 and later.
    - key: HasDataToSync
      supportedOS:
        macOS:
          introduced: n/a
      type: <boolean>
      presence: required
      content: If `true`, the user has data to sync to the cloud. This value is available
        in iOS 9.3 and later.
    - key: DataQuota
      supportedOS:
        macOS:
          introduced: n/a
      type: <integer>
      presence: required
      content: If present, the user's data quota in bytes. This isn't present if the
        account doesn't enforce a quota. This value is available in iOS 9.3 and later.
    - key: DataUsed
      supportedOS:
        macOS:
          introduced: n/a
      type: <integer>
      presence: required
      content: The amount of data, in bytes, that the user has used. This value is
        available in iOS 9.3 and later.
    - key: MobileAccount
      supportedOS:
        iOS:
          introduced: n/a
      type: <boolean>
      presence: required
      content: If `true`, the account is a mobile account. This value is available
        in macOS 10.13 and later.
    - key: HasSecureToken
      supportedOS:
        iOS:
          introduced: n/a
        macOS:
          introduced: '11.0'
      type: <boolean>
      presence: required
      content: If `true`, the user currently has a secure token set. This value is
        available in macOS 11 and later.
notes:
- title: ''
  content: Refer to the following sections to determine supported channels and requirements,
    and to see an example request and response.
