title: DeclarationBase
description: Keys common to all declarations used with the Remote Management protocol.
payload:
  declarationtype: any
  supportedOS:
    iOS:
      introduced: '15.0'
    macOS:
      introduced: '13.0'
    tvOS:
      introduced: '16.0'
payloadkeys:
- key: Type
  type: <string>
  presence: required
  content: A string specifying the type of this declaration.
- key: Identifier
  type: <string>
  presence: required
  content: A string uniquely identifying this declaration.
- key: ServerToken
  type: <string>
  presence: required
  content: A unique token generated by the server specifying a particular revision
    of the declaration.
- key: Payload
  type: <dictionary>
  presence: required
  content: The payload describing this declaration.
