title: Account:Exchange
description: Use this configuration to define settings for access to Exchange ActiveSync
  and Web Services servers.
payload:
  declarationtype: com.apple.configuration.account.exchange
  supportedOS:
    iOS:
      introduced: '15.0'
      allowed-enrollments:
      - supervised
      - device
      - user
      - local
      allowed-scopes:
      - system
      sharedipad:
        allowed-scopes:
        - user
    macOS:
      introduced: '13.0'
      allowed-enrollments:
      - supervised
      - user
      - local
      allowed-scopes:
      - user
    tvOS:
      introduced: n/a
    visionOS:
      introduced: '1.1'
      allowed-enrollments:
      - device
      - user
      - local
      allowed-scopes:
      - system
    watchOS:
      introduced: n/a
  apply: multiple
  content: This payload configures an Exchange ActiveSync account on an iOS device.
payloadkeys:
- key: VisibleName
  title: Account Name
  type: <string>
  presence: optional
  content: The name that apps show to the user for this Exchange account. If not present,
    the system generates a suitable default.
- key: EnabledProtocolTypes
  title: Enabled Protocol Types
  type: <array>
  presence: required
  content: |-
    The set of protocol types to enable on the Exchange server, in order of preference. This is an array of unique strings with possible values:
    * 'EAS:' Exchange ActiveSync
    * 'EWS:' Exchange Web Services (EWS)
    If the device supports one or more of the listed protocol types, it sets up an account for the first supported type.
    If the device doesn't support any of the listed protocol types, it doesn't set up an account and the system reports an error.
  subkeys:
  - key: EnabledProtocolTypesItem
    type: <string>
    presence: required
    rangelist:
    - EAS
    - EWS
- key: UserIdentityAssetReference
  title: User Identity Asset Reference
  type: <string>
  assettypes:
  - com.apple.asset.useridentity
  presence: optional
  content: The identifier of an asset declaration that contains the user identity
    for this account. The corresponding asset must be of type 'UserIdentity'.
- key: HostName
  title: Server Host Name
  type: <string>
  presence: optional
  content: The hostname of the EWS server (or IP address). This is a required field
    unless the declaration contains an 'OAuth' property, with a 'SignInURL' that has
    'enabled' as 'true'.
- key: Port
  title: Server Port
  supportedOS:
    iOS:
      introduced: n/a
    visionOS:
      introduced: n/a
  type: <integer>
  presence: optional
  content: The port number of the EWS server. The system uses this only when this
    declaration has a 'HostName' value.
- key: Path
  title: Server Path
  supportedOS:
    iOS:
      introduced: n/a
    visionOS:
      introduced: n/a
  type: <string>
  presence: optional
  content: The path of the EWS server. The system uses this only when this declaration
    has a 'HostName' value.
- key: ExternalHostName
  title: Server External Host Name
  supportedOS:
    iOS:
      introduced: n/a
    visionOS:
      introduced: n/a
  type: <string>
  presence: optional
  content: The external hostname of the EWS server (or IP address). This is a required
    field unless the declaration contains an 'OAuth' property, with a 'SignInURL'
    that has 'enabled' as 'true'.
- key: ExternalPort
  title: Server External Port
  supportedOS:
    iOS:
      introduced: n/a
    visionOS:
      introduced: n/a
  type: <integer>
  presence: optional
  content: The external port number of the EWS server. The system uses this only when
    this declaration has a 'HostName' value.
- key: External Path
  title: Server External Path
  supportedOS:
    iOS:
      introduced: n/a
    visionOS:
      introduced: n/a
  type: <string>
  presence: optional
  content: The external path of the EWS server. The system uses this only when this
    declaration has a 'HostName' value.
- key: OAuth
  title: Controls use of OAuth
  type: <dictionary>
  presence: optional
  content: The configuration settings for OAuth for this account.
  subkeys:
  - key: Enabled
    title: Use OAuth
    type: <boolean>
    presence: required
    content: If 'true', enables OAuth for this account.
  - key: SignInURL
    type: <string>
    presence: optional
    content: The URL that this account uses for signing in with OAuth. The system
      ignores this value unless 'Enabled' is 'true'. The system doesn't use autodiscovery
      when a declaration contains this URL, so the declaration must also contain a
      'HostName'.
  - key: TokenRequestURL
    supportedOS:
      macOS:
        introduced: n/a
    type: <string>
    presence: optional
    content: The URL that this account uses for token requests with OAuth. The system
      ignores this value unless 'Enabled' is 'true'.
- key: AuthenticationCredentialsAssetReference
  title: Authentication Credentials Asset Reference
  type: <string>
  assettypes:
  - com.apple.asset.credential.userpassword
  presence: optional
  content: The identifier of an asset declaration that contains the credentials for
    this account to authenticate with an Exchange server. Set the corresponding asset
    type to 'CredentialUserNameAndPassword'.
- key: AuthenticationIdentityAssetReference
  title: Authentication Identity Asset Reference
  type: <string>
  assettypes:
  - com.apple.asset.credential.acme
  - com.apple.asset.credential.identity
  - com.apple.asset.credential.scep
  presence: optional
  content: The identifier of a credential asset declaration that contains the identity
    that this account requires to authenticate with the Exchange server.
- key: SMIME
  title: S/MIME Settings
  supportedOS:
    iOS:
      introduced: '17.0'
    macOS:
      introduced: n/a
  type: <dictionary>
  presence: optional
  content: Settings for S/MIME.
  subkeys:
  - key: Signing
    title: S/MIME Signing Settings
    type: <dictionary>
    presence: optional
    content: Settings for S/MIME signing.
    subkeys:
    - key: Enabled
      title: Signing Enabled
      type: <boolean>
      presence: required
      content: If 'true', the system enables S/MIME signing.
    - key: IdentityAssetReference
      title: S/MIME Signing Identity Asset Reference
      type: <string>
      assettypes:
      - com.apple.asset.credential.acme
      - com.apple.asset.credential.identity
      - com.apple.asset.credential.scep
      presence: optional
      content: Specifies the identifier of an asset declaration containing the identity
        required for S/MIME signing of messages sent from this account.
    - key: UserOverrideable
      title: Signing User Overrideable
      type: <boolean>
      presence: optional
      default: false
      content: If 'true', the user can turn S/MIME signing on or off in Settings.
    - key: IdentityUserOverrideable
      title: Signing Identity User Overrideable
      type: <boolean>
      presence: optional
      default: false
      content: If 'true', the user can select an S/MIME signing identity in Settings.
  - key: Encryption
    title: S/MIME Encryption Settings
    type: <dictionary>
    presence: optional
    content: Settings for S/MIME encryption.
    subkeys:
    - key: Enabled
      title: Encryption By Default Enabled
      type: <boolean>
      presence: required
      content: If 'true', the system enables S/MIME encryption by default, which the
        user can't override if 'PerMessageSwitchEnabled' is 'false'.
    - key: IdentityAssetReference
      title: S/MIME Encryption Identity Asset Reference
      type: <string>
      assettypes:
      - com.apple.asset.credential.acme
      - com.apple.asset.credential.identity
      - com.apple.asset.credential.scep
      presence: optional
      content: Specifies the identifier of an asset declaration containing the identity
        required for S/MIME encryption. The system attaches the public certificate
        to outgoing mail to allow the user to receive encrypted mail. When the user
        sends encrypted mail, the system uses the public certificate to encrypt the
        copy of the mail in their Sent mailbox.
    - key: UserOverrideable
      title: Encryption By Default User Overrideable
      type: <boolean>
      presence: optional
      default: false
      content: If 'true', the user can turn S/MIME encryption by default on or off
        in Settings.
    - key: IdentityUserOverrideable
      title: Encryption Identity User Overrideable
      type: <boolean>
      presence: optional
      default: false
      content: If 'true', the user can select an S/MIME signing identity in Settings.
    - key: PerMessageSwitchEnabled
      title: Per Message Switch Enabled
      type: <boolean>
      presence: optional
      default: false
      content: If 'true', the system enables the per-message encryption switch in
        the compose view.
- key: MailServiceActive
  supportedOS:
    macOS:
      introduced: n/a
  type: <boolean>
  presence: optional
  default: true
  content: If 'true', the system activates the mail service for this account.
- key: LockMailService
  supportedOS:
    macOS:
      introduced: n/a
  type: <boolean>
  presence: optional
  default: false
  content: If 'true', the system prevents the user from changing the status of the
    mail service for this account.
- key: ContactsServiceActive
  supportedOS:
    macOS:
      introduced: n/a
  type: <boolean>
  presence: optional
  default: true
  content: If 'true', activates the address book service for this account.
- key: LockContactsService
  supportedOS:
    macOS:
      introduced: n/a
  type: <boolean>
  presence: optional
  default: false
  content: If 'true', the system prevents the user from changing the status of the
    address book service for this account.
- key: CalendarServiceActive
  supportedOS:
    macOS:
      introduced: n/a
  type: <boolean>
  presence: optional
  default: true
  content: If 'true', activates the calendar service for this account.
- key: LockCalendarService
  supportedOS:
    macOS:
      introduced: n/a
  type: <boolean>
  presence: optional
  default: false
  content: If 'true', the system prevents the user from changing the status of the
    calendar service for this account.
- key: RemindersServiceActive
  supportedOS:
    macOS:
      introduced: n/a
  type: <boolean>
  presence: optional
  default: true
  content: If 'true', the system activates the reminders service for this account.
- key: LockRemindersService
  supportedOS:
    macOS:
      introduced: n/a
  type: <boolean>
  presence: optional
  default: false
  content: If 'true', the system prevents the user from changing the status of the
    reminders service for this account.
- key: NotesServiceActive
  supportedOS:
    macOS:
      introduced: n/a
  type: <boolean>
  presence: optional
  default: true
  content: If 'true', the system activates the notes service for this account.
- key: LockNotesService
  supportedOS:
    macOS:
      introduced: n/a
  type: <boolean>
  presence: optional
  default: false
  content: If 'true', the system prevents the user from changing the status of the
    notes service for this account.
