title: Account:Subscribed Calendar
description: Use this configuration to define settings for a subscribed calendar.
payload:
  declarationtype: com.apple.configuration.account.subscribed-calendar
  supportedOS:
    iOS:
      introduced: '15.0'
      allowed-enrollments:
      - supervised
      - device
      - user
      - local
      allowed-scopes:
      - system
      sharedipad:
        allowed-scopes:
        - user
    macOS:
      introduced: '14.0'
      allowed-enrollments:
      - supervised
      - user
      - local
      allowed-scopes:
      - user
    tvOS:
      introduced: n/a
    visionOS:
      introduced: '1.1'
      allowed-enrollments:
      - device
      - user
      - local
      allowed-scopes:
      - system
    watchOS:
      introduced: n/a
  apply: multiple
  content: A subscribed calendar configuration defines a subscribed calendar for a
    user.
payloadkeys:
- key: VisibleName
  title: Account Name
  type: <string>
  presence: optional
  content: The name that apps show to the user for this calendar account. If not present,
    the system generates a suitable default.
- key: CalendarURL
  title: Calendar URL
  type: <string>
  presence: required
  content: The URL of the subscribed calendar, which needs to start with 'https://'.
- key: AuthenticationCredentialsAssetReference
  title: Authentication Credentials Asset Reference
  type: <string>
  assettypes:
  - com.apple.asset.credential.userpassword
  presence: optional
  content: The identifier of an asset declaration that contains the credentials for
    this account to authenticate with a calendar server. Set the corresponding asset
    type to 'CredentialUserNameAndPassword'.
