title: Account:CalDAV
description: Use this configuration to define settings for access to CalDAV servers.
payload:
  declarationtype: com.apple.configuration.account.caldav
  supportedOS:
    iOS:
      introduced: '15.0'
      allowed-enrollments:
      - supervised
      - device
      - user
      - local
      allowed-scopes:
      - system
      sharedipad:
        allowed-scopes:
        - user
    macOS:
      introduced: '13.0'
      allowed-enrollments:
      - supervised
      - user
      - local
      allowed-scopes:
      - user
    tvOS:
      introduced: n/a
    visionOS:
      introduced: '1.1'
      allowed-enrollments:
      - device
      - user
      - local
      allowed-scopes:
      - system
    watchOS:
      introduced: n/a
  apply: multiple
  content: A CalDAV configuration defines a CalDAV calendar and reminders account
    for a user.
payloadkeys:
- key: VisibleName
  title: Account Name
  type: <string>
  presence: optional
  content: The name that apps show to the user for this calendar account. If not present,
    the system generates a suitable default.
- key: HostName
  title: Server Host Name
  type: <string>
  presence: required
  content: The hostname or IP address of the CalDAV server.
- key: Port
  title: Server Port
  type: <integer>
  presence: optional
  content: The port number for the CalDAV server.
- key: Path
  title: Server Path
  type: <string>
  presence: optional
  content: The path for the CalDAV server.
- key: AuthenticationCredentialsAssetReference
  title: Authentication Credentials Asset Reference
  type: <string>
  assettypes:
  - com.apple.asset.credential.userpassword
  presence: optional
  content: The identifier of an asset declaration that contains the credentials for
    this account. Set the corresponding asset type to 'CredentialUserNameAndPassword'.
related-status-items:
- status-items:
  - account.list.caldav
  note: Each configuration will have a corresponding status item.
