title: Account:Exchange
description: Use this configuration to define settings for access to Exchange ActiveSync
  and Web Services servers.
payload:
  declarationtype: com.apple.configuration.account.exchange
  supportedOS:
    iOS:
      introduced: '15.0'
      sharedipad:
        mode: allowed
        devicechannel: false
        userchannel: true
      userenrollment:
        mode: allowed
    macOS:
      introduced: '13.0'
      devicechannel: false
      userchannel: true
      userenrollment:
        mode: allowed
    tvOS:
      introduced: n/a
  content: This payload configures an Exchange ActiveSync account on an iOS device.
payloadkeys:
- key: VisibleName
  title: Account Name
  type: <string>
  presence: optional
  content: The name that apps show to the user for this Exchange account. If not present,
    the system generates a suitable default.
- key: EnabledProtocolTypes
  title: Enabled Protocol Types
  type: <array>
  presence: required
  content: |-
    The set of protocol types to enable on the Exchange server, in order of preference. This is an array of unique strings with possible values:
    * 'EAS:' Exchange ActiveSync
    * 'EWS:' Exchange Web Services (EWS)
    If the device supports one or more of the listed protocol types, it sets up an account for the first supported type.
    If the device doesn't support any of the listed protocol types, it doesn't set up an account and the system reports an error.
  subkeys:
  - key: EnabledProtocolTypesItem
    type: <string>
    presence: required
    rangelist:
    - EAS
    - EWS
- key: UserIdentityAssetReference
  title: User Identity Asset Reference
  type: <string>
  presence: optional
  content: The identifier of an asset declaration that contains the user identity
    for this account. The corresponding asset must be of type UserIdentity.
- key: HostName
  title: Server Host Name
  type: <string>
  presence: optional
  content: The hostname of the EWS server (or IP address). This is a required field
    unless the declaration contains an 'OAuth' property, with a 'SignInURL' that has
    'enabled' as 'true'.
- key: Port
  title: Server Port
  supportedOS:
    iOS:
      introduced: n/a
  type: <integer>
  presence: optional
  content: The port number of the EWS server. The system uses this only when this
    declaration has a 'HostName' value.
- key: Path
  title: Server Path
  supportedOS:
    iOS:
      introduced: n/a
  type: <string>
  presence: optional
  content: The path of the EWS server. The system uses this only when this declaration
    has a 'HostName' value.
- key: ExternalHostName
  title: Server External Host Name
  supportedOS:
    iOS:
      introduced: n/a
  type: <string>
  presence: optional
  content: The external hostname of the EWS server (or IP address). This is a required
    field unless the declaration contains an 'OAuth' property, with a 'SignInURL'
    that has 'enabled' as 'true'.
- key: ExternalPort
  title: Server External Port
  supportedOS:
    iOS:
      introduced: n/a
  type: <integer>
  presence: optional
  content: The external port number of the EWS server. The system uses this only when
    this declaration has a 'HostName' value.
- key: External Path
  title: Server External Path
  supportedOS:
    iOS:
      introduced: n/a
  type: <string>
  presence: optional
  content: The external path of the EWS server. The system uses this only when this
    declaration has a 'HostName' value.
- key: OAuth
  title: Controls use of OAuth
  type: <dictionary>
  presence: optional
  content: The configuration settings for OAuth for this account.
  subkeys:
  - key: Enabled
    title: Use OAuth
    type: <boolean>
    presence: required
    content: If 'true', enables OAuth for this account.
  - key: SignInURL
    type: <string>
    presence: optional
    content: The URL that this account uses for signing in with OAuth. The system
      ignores this value unless 'Enabled' is 'true'. The system doesn't use autodiscovery
      when a declaration contains this URL, so the declaration must also contain a
      'HostName'.
  - key: TokenRequestURL
    supportedOS:
      macOS:
        introduced: n/a
    type: <string>
    presence: optional
    content: The URL that this account uses for token requests with OAuth. The system
      ignores this value unless 'Enabled' is 'true'.
- key: AuthenticationCredentialsAssetReference
  title: Authentication Credentials Asset Reference
  type: <string>
  presence: optional
  content: The identifier of an asset declaration that contains the credentials for
    this account to authenticate with an Exchange server. The corresponding asset
    must be of type CredentialUserNameAndPassword.
- key: MailServiceActive
  supportedOS:
    macOS:
      introduced: n/a
  type: <boolean>
  presence: optional
  default: true
  content: If 'true', activates the mail service for this account.
- key: LockMailService
  supportedOS:
    macOS:
      introduced: n/a
  type: <boolean>
  presence: optional
  default: false
  content: If 'true', prevents the user from changing the status of the mail service
    for this account.
- key: ContactsServiceActive
  supportedOS:
    macOS:
      introduced: n/a
  type: <boolean>
  presence: optional
  default: true
  content: If 'true', activates the address book service for this account.
- key: LockContactsService
  supportedOS:
    macOS:
      introduced: n/a
  type: <boolean>
  presence: optional
  default: false
  content: If 'true', prevents the user from changing the status of the address book
    service for this account.
- key: CalendarServiceActive
  supportedOS:
    macOS:
      introduced: n/a
  type: <boolean>
  presence: optional
  default: true
  content: If 'true', activates the calendar service for this account.
- key: LockCalendarService
  supportedOS:
    macOS:
      introduced: n/a
  type: <boolean>
  presence: optional
  default: false
  content: If 'true', prevents the user from changing the status of the calendar service
    for this account.
- key: RemindersServiceActive
  supportedOS:
    macOS:
      introduced: n/a
  type: <boolean>
  presence: optional
  default: true
  content: If 'true', activates the reminders service for this account.
- key: LockRemindersService
  supportedOS:
    macOS:
      introduced: n/a
  type: <boolean>
  presence: optional
  default: false
  content: If 'true', prevents the user from changing the status of the reminders
    service for this account.
- key: NotesServiceActive
  supportedOS:
    macOS:
      introduced: n/a
  type: <boolean>
  presence: optional
  default: true
  content: If 'true', activates the notes service for this account.
- key: LockNotesService
  supportedOS:
    macOS:
      introduced: n/a
  type: <boolean>
  presence: optional
  default: false
  content: If 'true', prevents the user from changing the status of the notes service
    for this account.
