title: Account:LDAP
description: Use this configuration to define settings for access to LDAP servers.
payload:
  declarationtype: com.apple.configuration.account.ldap
  supportedOS:
    iOS:
      introduced: '15.0'
      allowed-enrollments:
      - supervised
      - device
      - user
      - local
      allowed-scopes:
      - system
      sharedipad:
        allowed-scopes:
        - user
    macOS:
      introduced: '13.0'
      allowed-enrollments:
      - supervised
      - user
      - local
      allowed-scopes:
      - user
    tvOS:
      introduced: n/a
    visionOS:
      introduced: '1.1'
      allowed-enrollments:
      - device
      - user
      - local
      allowed-scopes:
      - system
    watchOS:
      introduced: n/a
  apply: multiple
  content: An LDAP configuration defines an LDAP directory account for a user.
payloadkeys:
- key: VisibleName
  title: Account Name
  type: <string>
  presence: optional
  content: The name that apps show to the user for this LDAP account. If not present,
    the system generates a suitable default.
- key: HostName
  title: Server Host Name
  type: <string>
  presence: required
  content: The hostname or IP address of the LDAP server.
- key: Port
  title: Server Port
  type: <integer>
  presence: optional
  content: The port number or IP address of the LDAP server.
- key: AuthenticationCredentialsAssetReference
  title: Authentication Credentials Asset Reference
  type: <string>
  assettypes:
  - com.apple.asset.credential.userpassword
  presence: optional
  content: The identifier of an asset declaration that contains the credentials for
    this account. Set the corresponding asset type to 'CredentialUserNameAndPassword'.
- key: SearchSettings
  title: Search Settings
  type: <array>
  presence: optional
  content: The array of nodes to start LDAP searches from. There must be at least
    one node for this account to be useful. macOS only searches one node and ignores
    other items in the array.
  subkeys:
  - key: SearchSettingsItem
    title: An LDAP Search Setting
    type: <dictionary>
    subkeys:
    - key: VisibleDescription
      title: Visible Description
      type: <string>
      presence: optional
      content: The description of this search setting in the Contacts and Settings
        apps. If not present, the apps display no name.
    - key: SearchBase
      title: Search Base
      type: <string>
      presence: required
      content: The path to the node where a search starts. For example, 'ou=people,o=example
        corp'.
    - key: Scope
      title: Scope
      type: <string>
      presence: optional
      rangelist:
      - Base
      - OneLevel
      - Subtree
      default: Subtree
      content: |-
        The type of recursion to use in the search.
        * 'Base': Only the 'SearchBase' node.
        * 'OneLevel': The 'SearchBase' node and its immediate children.
        * 'Subtree': The 'SearchBase' node and all its children, regardless of depth.
