title: Account:Google
description: Use this configuration to define settings for access to Google services.
payload:
  declarationtype: com.apple.configuration.account.google
  supportedOS:
    iOS:
      introduced: '15.0'
      allowed-enrollments:
      - supervised
      - device
      - user
      - local
      allowed-scopes:
      - system
      sharedipad:
        allowed-scopes:
        - user
    macOS:
      introduced: '13.0'
      allowed-enrollments:
      - supervised
      - user
      - local
      allowed-scopes:
      - user
    tvOS:
      introduced: n/a
    visionOS:
      introduced: '1.1'
      allowed-enrollments:
      - device
      - user
      - local
      allowed-scopes:
      - system
    watchOS:
      introduced: n/a
  apply: multiple
  content: A Google configuration defines a Google account for a user. The user will
    be prompted to enter their credentials shortly after the configuration successfully
    installs.
payloadkeys:
- key: VisibleName
  title: Account Name
  type: <string>
  presence: optional
  content: The name that apps show to the user for this Google account. If not present,
    the system generates a suitable default.
- key: UserIdentityAssetReference
  title: User Identity Asset Reference
  type: <string>
  assettypes:
  - com.apple.asset.useridentity
  presence: required
  content: The identifier of an asset declaration that contains the user identity
    for this Google account. Set the corresponding asset type to 'UserIdentity' and
    ensure that it contains an 'EmailAddress' key that specifies the full Google email
    address for the account.
related-status-items:
- status-items:
  - account.list.google
  note: Each configuration will have a corresponding status item.
