title: Account:Mail
description: Use this configuration to define settings for access to email servers.
payload:
  declarationtype: com.apple.configuration.account.mail
  supportedOS:
    iOS:
      introduced: '15.0'
      allowed-enrollments:
      - device
      - user
      - local
      allowed-scopes:
      - system
      sharedipad:
        allowed-scopes:
        - user
    macOS:
      introduced: '13.0'
      allowed-enrollments:
      - device
      - user
      - local
      allowed-scopes:
      - user
    tvOS:
      introduced: n/a
    watchOS:
      introduced: n/a
  content: An email configuration defines an email account for a user.
payloadkeys:
- key: VisibleName
  title: Account Name
  type: <string>
  presence: optional
  content: The name that apps show to the user for this mail account. If not present,
    the system generates a suitable default.
- key: UserIdentityAssetReference
  title: User Identity Asset Reference
  type: <string>
  presence: optional
  content: The identifier of an asset declaration that contains the user identity
    for this account. The corresponding asset must be of type 'UserIdentity'.
- key: IncomingServer
  title: Incoming Server Settings
  type: <dictionary>
  presence: required
  content: The settings for the incoming mail server for this account.
  subkeys:
  - key: ServerType
    title: Server Type
    type: <string>
    presence: required
    rangelist:
    - IMAP
    - POP
    content: The mail protocol this account uses.
  - key: HostName
    title: Server Host Name
    type: <string>
    presence: required
    content: The host name for the incoming mail server.
  - key: Port
    title: Server Port
    type: <integer>
    presence: optional
    content: The port number for the incoming mail server.
  - key: AuthenticationMethod
    title: Server Authentication Method
    type: <string>
    presence: required
    rangelist:
    - None
    - Password
    - CRAMMD5
    - NTLM
    - HTTPMD5
    content: The authentication method for the incoming mail server.
  - key: AuthenticationCredentialsAssetReference
    title: Authentication Credentials Asset Reference
    type: <string>
    presence: optional
    content: |-
      The identifier of an asset declaration that contains the credentials for this account to authenticate with an incoming mail server. The corresponding asset must be of type 'CredentialUserNameAndPassword'.
      If the 'AuthenticationMethod' is 'None', this field must be blank. Otherwise, the declaration must contain this field.
  - key: IMAPPathPrefix
    title: IMAP Path Prefix
    type: <string>
    presence: optional
    content: The path prefix for the IMAP server. The system uses this only when 'ServerType'
      is 'IMAP'.
- key: OutgoingServer
  title: Outgoing Server Settings
  type: <dictionary>
  presence: required
  content: The settings for the outgoing mail server for this account.
  subkeys:
  - key: HostName
    title: Server Host Name
    type: <string>
    presence: required
    content: The host name for the outgoing mail server.
  - key: Port
    title: Server Port
    type: <integer>
    presence: optional
    content: The port number for the outgoing mail server.
  - key: AuthenticationMethod
    title: Server Authentication Method
    type: <string>
    presence: required
    rangelist:
    - None
    - Password
    - CRAMMD5
    - NTLM
    - HTTPMD5
    content: The authentication method for the outgoing mail server.
  - key: AuthenticationCredentialsAssetReference
    title: Authentication Credentials Asset Reference
    type: <string>
    presence: optional
    content: |-
      The identifier of an asset declaration that contains the credentials for this account to authenticate with an outgoing mail server. The corresponding asset must be of type 'CredentialUserNameAndPassword'.
      If the 'AuthenticationMethod' is 'None', this field must be blank. Otherwise, the declaration must contain this field.
- key: SMIME
  title: S/MIME Settings
  supportedOS:
    iOS:
      introduced: '17.0'
    macOS:
      introduced: n/a
  type: <dictionary>
  presence: optional
  content: Settings for S/MIME.
  subkeys:
  - key: Signing
    title: S/MIME Signing Settings
    type: <dictionary>
    presence: optional
    content: Settings for S/MIME signing.
    subkeys:
    - key: Enabled
      title: Signing Enabled
      type: <boolean>
      presence: required
      content: It true, S/MIME signing is enabled.
    - key: IdentityAssetReference
      title: S/MIME Signing Identity Asset Reference
      type: <string>
      presence: optional
      content: Specifies the identifier of an asset declaration containing the identity
        required for S/MIME signing of messages sent from this account.
    - key: UserOverrideable
      title: Signing User Overrideable
      type: <boolean>
      presence: optional
      default: false
      content: If true, the user can turn S/MIME signing on or off in Settings.
    - key: IdentityUserOverrideable
      title: Signing Identity User Overrideable
      type: <boolean>
      presence: optional
      default: false
      content: If true, the user can turn select an S/MIME signing identity in Settings.
  - key: Encryption
    title: S/MIME Encryption Settings
    type: <dictionary>
    presence: optional
    content: Settings for S/MIME encryption.
    subkeys:
    - key: Enabled
      title: Encryption By Default Enabled
      type: <boolean>
      presence: required
      content: It true, S/MIME encryption by default is enabled. Cannot be overridden
        by the user if the "PerMessageSwitchEnabled" key is set to false.
    - key: IdentityAssetReference
      title: S/MIME Encryption Identity Asset Reference
      type: <string>
      presence: optional
      content: Specifies the identifier of an asset declaration containing the identity
        required for S/MIME encryption. The public certificate is attached to outgoing
        mail to allow encrypted mail to be sent to this user. When the user sends
        encrypted mail, the public certificate is used to encrypt the copy of the
        mail in their Sent mailbox.
    - key: UserOverrideable
      title: Encryption By Default User Overrideable
      type: <boolean>
      presence: optional
      default: false
      content: If true, the user can turn S/MIME encryption by default on or off in
        Settings.
    - key: IdentityUserOverrideable
      title: Encryption Identity User Overrideable
      type: <boolean>
      presence: optional
      default: false
      content: If true, the user can turn select an S/MIME signing identity in Settings.
    - key: PerMessageSwitchEnabled
      title: Per Message Switch Enabled
      type: <boolean>
      presence: optional
      default: false
      content: If true, enables the per-message encryption switch in the compose view.
