title: Legacy Profile
description: Specifies an MDMv1 profile to download and install
payload:
  declarationtype: com.apple.configuration.legacy
  supportedOS:
    iOS:
      introduced: '15.0'
      sharedipad:
        mode: allowed
        devicechannel: true
        userchannel: true
      userenrollment:
        mode: allowed
    macOS:
      introduced: '13.0'
      devicechannel: true
      userchannel: true
      userenrollment:
        mode: allowed
    tvOS:
      introduced: '16.0'
payloadkeys:
- key: ProfileURL
  title: Profile's URL.
  type: <string>
  presence: required
  content: |-
    The URL of the profile to download and install. This must be an 'https://' URL.
    If a user enrollment triggers this configuration, the system silently ignores any MDM 1 payloads in macOS where the User Enrollment Mode setting is 'forbidden'. In iOS and tvOS, the system rejects the entire profile.
