title: Management:Status Subscriptions
description: The declaration to configure status subscriptions.
payload:
  declarationtype: com.apple.configuration.management.status-subscriptions
  supportedOS:
    iOS:
      introduced: '15.0'
      allowed-enrollments:
      - supervised
      - device
      - user
      allowed-scopes:
      - system
      sharedipad:
        allowed-scopes:
        - system
        - user
    macOS:
      introduced: '13.0'
      allowed-enrollments:
      - supervised
      - user
      allowed-scopes:
      - system
      - user
    tvOS:
      introduced: '16.0'
      allowed-enrollments:
      - supervised
      - device
      allowed-scopes:
      - system
    visionOS:
      introduced: '1.1'
      allowed-enrollments:
      - supervised
      - device
      - user
      allowed-scopes:
      - system
    watchOS:
      introduced: '10.0'
      allowed-enrollments:
      - supervised
      allowed-scopes:
      - system
  apply: combined
payloadkeys:
- key: StatusItems
  title: Status Items
  type: <array>
  presence: required
  combinetype: set-union
  content: An array of status items that the device notifies subscribers about.
  subkeys:
  - key: StatusItem
    type: <dictionary>
    content: The declaration for configuring a specific status subscription.
    subkeys:
    - key: Name
      type: <string>
      presence: required
      content: The name of the status item to send to subscribers.
