title: Management:Status Subscriptions
description: Use this configuration to define the status subscriptions that cause
  status to be reported by the client.
payload:
  declarationtype: com.apple.configuration.management.status-subscriptions
  supportedOS:
    iOS:
      introduced: '15.0'
      allowed-enrollments:
      - device
      - user
      allowed-scopes:
      - system
      sharedipad:
        allowed-scopes:
        - system
        - user
    macOS:
      introduced: '13.0'
      allowed-enrollments:
      - device
      - user
      allowed-scopes:
      - system
      - user
    tvOS:
      introduced: '16.0'
      allowed-enrollments:
      - device
      allowed-scopes:
      - system
    watchOS:
      introduced: '10.0'
      allowed-enrollments:
      - device
      allowed-scopes:
      - system
payloadkeys:
- key: StatusItems
  title: Status Items
  type: <array>
  presence: required
  content: An array of status items that the device notifies subscribers about.
  subkeys:
  - key: StatusItem
    type: <dictionary>
    subkeys:
    - key: Name
      type: <string>
      presence: required
      content: The name of the status item to send to subscribers.
