title: Screen Sharing:Connection Group
description: Use this configuration to define a group of Screen Sharing connections.
payload:
  declarationtype: com.apple.configuration.screensharing.connection.group
  supportedOS:
    iOS:
      introduced: n/a
    macOS:
      introduced: '14.0'
      allowed-enrollments:
      - device
      - user
      - local
      allowed-scopes:
      - system
      - user
    tvOS:
      introduced: n/a
    watchOS:
      introduced: n/a
payloadkeys:
- key: ConnectionGroupUUID
  title: Unique Identifier
  type: <string>
  presence: required
  content: A string which uniquely identifies this connection group.
- key: GroupName
  title: Group Name
  type: <string>
  presence: required
  content: The name of the Connection Group.
- key: Members
  title: Group Members
  type: <array>
  presence: required
  content: |-
    Array of ConnectionUUIDs (matching a connection declared in a
    com.apple.configuration.screensharing.connection configuration) of the Connections
    that should be members of this group.
  subkeys:
  - key: ConnectionUUID
    type: <string>
