title: Screen Sharing:Connection Group
description: The declaration to configure a group of screen-sharing connections.
payload:
  declarationtype: com.apple.configuration.screensharing.connection.group
  supportedOS:
    iOS:
      introduced: n/a
    macOS:
      introduced: '14.0'
      allowed-enrollments:
      - supervised
      - user
      - local
      allowed-scopes:
      - system
      - user
    tvOS:
      introduced: n/a
    visionOS:
      introduced: n/a
    watchOS:
      introduced: n/a
  apply: multiple
payloadkeys:
- key: ConnectionGroupUUID
  title: Unique Identifier
  type: <string>
  presence: required
  content: A unique identifier for this connection group.
- key: GroupName
  title: Group Name
  type: <string>
  presence: required
  content: The name of the connection group.
- key: Members
  title: Group Members
  type: <array>
  presence: required
  content: An array of `ConnectionUUID`s that represent connections declared in `ScreenSharingConnection`
    configurations that are members of this group.
  subkeys:
  - key: ConnectionUUID
    type: <string>
related-status-items:
- status-items:
  - screensharing.connection.group.unresolved-connection
  note: Any unresolved connection groups in the configuration will appear in the corresponding
    status item.
