title: Watch:Enrollment
description: Specifies an MDMv1 Apple Watch enrollment profile
payload:
  declarationtype: com.apple.configuration.watch.enrollment
  supportedOS:
    iOS:
      introduced: '17.0'
      allowed-enrollments:
      - supervised
      allowed-scopes:
      - system
      sharedipad:
        allowed-scopes: []
    macOS:
      introduced: n/a
    tvOS:
      introduced: n/a
    visionOS:
      introduced: n/a
    watchOS:
      introduced: n/a
  apply: single
payloadkeys:
- key: EnrollmentProfileURL
  title: Watch Enrollment Profile's URL.
  type: <string>
  presence: required
  content: The URL of the profile that the Apple Watch downloads and installs if the
    user opts in to management during the pairing process, which needs to start with
    'https://'. Successful enrollment requires that the pairing iPhone is supervised
    and the profile contains an MDM payload. Apple Watch attempts to install each
    payload that the profile contains.
- key: AnchorCertificateAssetReferences
  title: Anchor Certificate Asset References.
  type: <array>
  assettypes:
  - com.apple.asset.credential.certificate
  presence: optional
  content: |-
    An array of identifiers of asset declarations that contain anchor certificates to use to evaluate the trust of the enrollment profile server. Set the type of the corresponding assets to 'com.apple.asset.credential.certificate'.
    These certificates are pinned, meaning that the server specified by the 'EnrollmentProfileURL' must use a certificate that chains to one of the certs in this array.
    If it chains to one of the built-in trusted root certificates but not one of the 'AnchorCertificateAssetReferences' certs, the connection will fail.
  subkeys:
  - key: AnchorCertificateAssetReferenceItem
    type: <string>
    content: Specifies the identifier of an asset declaration containing the anchor
      certificate to be used.
