title: Status Account List Google
description: The client's Google accounts.
payload:
  statusitemtype: account.list.google
  supportedOS:
    iOS:
      introduced: '16.0'
      allowed-enrollments:
      - device
      - user
      - local
      allowed-scopes:
      - system
      sharedipad:
        allowed-scopes:
        - user
    macOS:
      introduced: '13.0'
      allowed-enrollments:
      - device
      - user
      - local
      allowed-scopes:
      - user
    tvOS:
      introduced: n/a
    watchOS:
      introduced: n/a
payloadkeys:
- key: account.list.google
  title: Status item value.
  type: <array>
  presence: required
  content: A list of status values for the Google accounts.
  subkeytype: Account
  subkeys:
  - key: status_value
    type: <dictionary>
    subkeys:
    - key: identifier
      title: Unique identifier of the account.
      type: <string>
      presence: required
      content: The unique identifier for the account.
    - key: _removed
      title: Indicates removal of the account.
      type: <boolean>
      presence: optional
      default: false
      content: If 'true', the account is removed and the status item object only contains
        this key and the 'identifier' key.
    - key: declaration-identifier
      title: Identifier of the declaration that installed the account.
      type: <string>
      presence: optional
      content: The identifier of the declaration that installed the account. Only
        present if a declaration installed the account.
    - key: visible-name
      title: Account name
      type: <string>
      presence: optional
      content: The name of the account.
    - key: username
      title: Account username
      type: <string>
      presence: optional
      content: The user name for the account.
    - key: is-mail-enabled
      title: Is mail enabled
      type: <boolean>
      presence: optional
      content: A Boolean value that indicates whether the Mail app displays mail for
        this account.
    - key: are-calendars-enabled
      title: Are calendars enabled
      type: <boolean>
      presence: optional
      content: A Boolean value that indicates whether the Calendar app displays calendars
        and events for this account.
    - key: are-contacts-enabled
      title: Are contacts enabled
      type: <boolean>
      presence: optional
      content: A Boolean value that indicates whether the Contacts app displays contacts
        for this account.
    - key: are-notes-enabled
      title: Are notes enabled
      type: <boolean>
      presence: optional
      content: A Boolean value that indicates whether the Notes app displays notes
        for this account.
