title: Status Account List Subscribed Calendar
description: The client's subscribed calendar accounts.
payload:
  statusitemtype: account.list.subscribed-calendar
  supportedOS:
    iOS:
      introduced: '16.0'
      allowed-enrollments:
      - supervised
      - device
      - user
      - local
      allowed-scopes:
      - system
      sharedipad:
        allowed-scopes:
        - user
    macOS:
      introduced: '14.0'
      allowed-enrollments:
      - supervised
      - user
      - local
      allowed-scopes:
      - user
    tvOS:
      introduced: n/a
    visionOS:
      introduced: '1.1'
      allowed-enrollments:
      - device
      - user
      - local
      allowed-scopes:
      - system
    watchOS:
      introduced: n/a
payloadkeys:
- key: account.list.subscribed-calendar
  title: Status item value.
  type: <array>
  presence: required
  content: A list of status values for the calendar accounts.
  subkeytype: Account
  subkeys:
  - key: status_value
    type: <dictionary>
    subkeys:
    - key: identifier
      title: Unique identifier of the account.
      type: <string>
      presence: required
      content: The unique identifier for the account.
    - key: _removed
      title: Indicates removal of the account.
      type: <boolean>
      presence: optional
      default: false
      content: If 'true', the account is removed and the status item object only contains
        this key and the 'identifier' key.
    - key: declaration-identifier
      title: Identifier of the declaration that installed the account.
      type: <string>
      presence: optional
      content: The identifier of the declaration that installed the account. Only
        present if a declaration installed the account.
    - key: visible-name
      title: Account name
      type: <string>
      presence: optional
      content: The name of the account.
    - key: calendar-url
      title: Account calendar URL
      type: <string>
      presence: optional
      content: The URL of the subscribed calendar.
    - key: username
      title: Account username
      type: <string>
      presence: optional
      content: The user name for the account.
    - key: is-enabled
      title: Is the calendar enabled
      type: <boolean>
      presence: optional
      content: A Boolean value that indicates whether the Calendar app displays this
        calendar.
