title: Status Device Operating System Version
description: The device's operating system version.
payload:
  statusitemtype: device.operating-system.version
  supportedOS:
    iOS:
      introduced: '15.0'
payloadkeys:
- key: device.operating-system.version
  title: Status item value.
  type: <string>
  presence: required
  content: A string that identifies the operating system's version in use on the device,
    such as '15.0'.
