title: Status Device UDID
description: The device's UDID.
payload:
  statusitemtype: device.identifier.udid
  supportedOS:
    iOS:
      introduced: '16.0'
      allowed-enrollments:
      - device
      - local
      allowed-scopes:
      - system
      sharedipad:
        allowed-scopes:
        - system
        - user
    macOS:
      introduced: '13.0'
      allowed-enrollments:
      - device
      - local
      allowed-scopes:
      - system
      - user
    tvOS:
      introduced: '16.0'
      allowed-enrollments:
      - device
      - local
      allowed-scopes:
      - system
    watchOS:
      introduced: '10.0'
      allowed-enrollments:
      - device
      - local
      allowed-scopes:
      - system
payloadkeys:
- key: device.identifier.udid
  title: Status item value.
  type: <string>
  presence: required
  content: The device's UDID. This value is always available on the device channel.
    This value is only available on user channels whose organization matches that
    of the device channel.
