title: Status Device Model Marketing Name
description: The device's hardware marketing name.
payload:
  statusitemtype: device.model.marketing-name
  supportedOS:
    iOS:
      introduced: '15.0'
    macOS:
      introduced: '13.0'
    tvOS:
      introduced: '16.0'
payloadkeys:
- key: device.model.marketing-name
  title: Status item value.
  type: <string>
  presence: required
  content: A string that identifies the device's marketing name, such as 'iPhone 12'.
    This value may not always be available.
