title: Status Device Operating System Version
description: The device's operating system version.
payload:
  statusitemtype: device.operating-system.version
  supportedOS:
    iOS:
      introduced: '15.0'
      allowed-enrollments:
      - device
      - user
      - local
      allowed-scopes:
      - system
      sharedipad:
        allowed-scopes:
        - system
        - user
    macOS:
      introduced: '13.0'
      allowed-enrollments:
      - device
      - user
      - local
      allowed-scopes:
      - system
      - user
    tvOS:
      introduced: '16.0'
      allowed-enrollments:
      - device
      - local
      allowed-scopes:
      - system
    watchOS:
      introduced: '10.0'
      allowed-enrollments:
      - device
      - local
      allowed-scopes:
      - system
payloadkeys:
- key: device.operating-system.version
  title: Status item value.
  type: <string>
  presence: required
  content: A string that identifies the operating system's version in use on the device,
    such as '15.0'.
