title: Status Device Operating System Supplemental Build Version
description: The device's operating system supplemental build version.
payload:
  statusitemtype: device.operating-system.supplemental.build-version
  supportedOS:
    iOS:
      introduced: '16.1'
    macOS:
      introduced: '13.0'
    tvOS:
      introduced: '16.1'
payloadkeys:
- key: device.operating-system.supplemental.build-version
  title: Status item value.
  type: <string>
  presence: required
  content: Identifies the operating system's build and rapid security response versions
    in use on the device (for example, '20A123a', or '20B27c').
