title: Status Device Operating System Supplemental Extra Version
description: The device's operating system rapid security response version.
payload:
  statusitemtype: device.operating-system.supplemental.extra-version
  supportedOS:
    iOS:
      introduced: '16.1'
      allowed-enrollments:
      - device
      - user
      - local
      allowed-scopes:
      - system
      sharedipad:
        allowed-scopes:
        - system
        - user
    macOS:
      introduced: '13.0'
      allowed-enrollments:
      - device
      - user
      - local
      allowed-scopes:
      - system
      - user
    tvOS:
      introduced: '16.1'
      allowed-enrollments:
      - device
      - local
      allowed-scopes:
      - system
    watchOS:
      introduced: '10.0'
      allowed-enrollments:
      - device
      - local
      allowed-scopes:
      - system
payloadkeys:
- key: device.operating-system.supplemental.extra-version
  title: Status item value.
  type: <string>
  presence: required
  content: Identifies the operating system's rapid security response version in use
    on the device (for example, 'a').
