title: Status Device Battery Health
description: The health of the battery.
payload:
  statusitemtype: device.power.battery-health
  supportedOS:
    iOS:
      introduced: '17.0'
      allowed-enrollments:
      - device
      - local
      allowed-scopes:
      - system
      sharedipad:
        allowed-scopes:
        - system
    macOS:
      introduced: n/a
    tvOS:
      introduced: n/a
    watchOS:
      introduced: n/a
payloadkeys:
- key: device.power.battery-health
  title: Status item value.
  type: <string>
  presence: required
  rangelist:
  - non-genuine
  - normal
  - service-recommended
  - unknown
  - unsupported
  content: |-
    The battery health status, which has the following values:
    * 'non-genuine' - the battery isn't a genuine Apple battery.
    * 'normal' - the battery is operating normally.
    * 'service-recommended' - the system recommends battery service.
    * 'unknown' - the system couldn't determine battery health information.
    * 'unsupported' - the device doesn't support battery health reporting.
    This field is available in iOS 17 and later on iPhone only. iPad returns 'unsupported'.
