title: Status Passcode Compliance
description: The state of passcode compliance.
payload:
  statusitemtype: passcode.is-compliant
  supportedOS:
    iOS:
      introduced: '16.0'
      allowed-enrollments:
      - supervised
      - device
      - user
      - local
      allowed-scopes:
      - system
      sharedipad:
        allowed-scopes:
        - system
        - user
    macOS:
      introduced: n/a
    tvOS:
      introduced: n/a
    visionOS:
      introduced: '1.1'
      allowed-enrollments:
      - device
      - user
      - local
      allowed-scopes:
      - system
    watchOS:
      introduced: '10.0'
      allowed-enrollments:
      - supervised
      - local
      allowed-scopes:
      - system
payloadkeys:
- key: passcode.is-compliant
  title: Status item value.
  type: <boolean>
  presence: required
  content: If 'true', the passcode is in compliance with all passcode policies set
    on the device. If 'false', the passcode isn't in compliance with one or more passcode
    policies set on the device. When there are no passcode policies on the device,
    this value 'true'.
