title: Status Security Certificate List
description: The client's managed certificates.
payload:
  statusitemtype: security.certificate.list
  supportedOS:
    iOS:
      introduced: '17.0'
      allowed-enrollments:
      - supervised
      - device
      - user
      - local
      allowed-scopes:
      - system
      sharedipad:
        allowed-scopes:
        - system
        - user
    macOS:
      introduced: '14.0'
      allowed-enrollments:
      - supervised
      - user
      - local
      allowed-scopes:
      - system
      - user
    tvOS:
      introduced: '17.0'
      allowed-enrollments:
      - supervised
      - device
      - local
      allowed-scopes:
      - system
    visionOS:
      introduced: '1.1'
      allowed-enrollments:
      - device
      - user
      - local
      allowed-scopes:
      - system
    watchOS:
      introduced: '10.0'
      allowed-enrollments:
      - supervised
      - local
      allowed-scopes:
      - system
payloadkeys:
- key: security.certificate.list
  title: Status item value.
  type: <array>
  presence: required
  content: A list of the device's managed certificates.
  subkeytype: Certificate
  subkeys:
  - key: status_value
    type: <dictionary>
    subkeys:
    - key: identifier
      title: Unique identifier of the certificate.
      type: <string>
      presence: required
      content: The unique identifier of the certificate which the system uses as the
        primary key.
    - key: _removed
      title: Indicates removal of the certificate.
      type: <boolean>
      presence: optional
      default: false
      content: To indicate removal of a certificate, this key's value is set to true,
        and only this key and the "identifier" key will be present in the status item
        object.
    - key: declaration-identifier
      title: Asset declaration identifier.
      type: <string>
      presence: optional
      content: The identifier of the asset declaration that installed the certificate,
        which is only present if a declaration installed the certificate.
    - key: subject-summary
      title: Subject summary
      type: <string>
      presence: required
      content: The summary of the certificate's subject.
    - key: is-identity
      title: Is Identity
      type: <boolean>
      presence: required
      content: If 'true', the certificate is an identity certificate.
    - key: data
      title: Certificate Data
      type: <data>
      presence: required
      content: The certificate data in DER-encoded X.509 format.
