title: Status Software Update Beta Enrollment
description: The device's enrolled beta program.
payload:
  statusitemtype: softwareupdate.beta-enrollment
  supportedOS:
    iOS:
      introduced: '18.0'
      allowed-enrollments:
      - supervised
      - device
      allowed-scopes:
      - system
      sharedipad:
        allowed-scopes:
        - system
    macOS:
      introduced: '15.0'
      allowed-enrollments:
      - supervised
      allowed-scopes:
      - system
    tvOS:
      introduced: n/a
    visionOS:
      introduced: n/a
    watchOS:
      introduced: n/a
payloadkeys:
- key: softwareupdate.beta-enrollment
  title: The device's enrolled beta program.
  type: <string>
  presence: required
  content: The device's enrolled beta program name, or an empty string if there is
    no enrolled beta program.
