title: Status Reason
description: Provides details about an error for an item in a status report.
payload:
  declarationtype: status-reason
  supportedOS:
    iOS:
      introduced: '15.0'
    macOS:
      introduced: '13.0'
    tvOS:
      introduced: '16.0'
    visionOS:
      introduced: '1.1'
    watchOS:
      introduced: '10.0'
payloadkeys:
- key: code
  title: Error Code
  type: <string>
  presence: required
  content: The error code for this error.
- key: description
  title: Error Description
  type: <string>
  presence: optional
  content: A description of this error.
- key: details
  title: Error Details
  type: <dictionary>
  presence: optional
  content: A dictionary that contains additional details about the error.
notes:
- title: ''
  content: Each status item defines its own set of `code`, `description`, and `details`
    values.
